TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:01:36 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    4370                      .dwattr $C$DW$511, DW_AT_const_value(0x04)
    4371              
    4372              $C$DW$512       .dwtag  DW_TAG_enumerator
    4373                      .dwattr $C$DW$512, DW_AT_name("PIE_GroupNumber_6")
    4374                      .dwattr $C$DW$512, DW_AT_const_value(0x05)
    4375              
    4376              $C$DW$513       .dwtag  DW_TAG_enumerator
    4377                      .dwattr $C$DW$513, DW_AT_name("PIE_GroupNumber_7")
    4378                      .dwattr $C$DW$513, DW_AT_const_value(0x06)
    4379              
    4380              $C$DW$514       .dwtag  DW_TAG_enumerator
    4381                      .dwattr $C$DW$514, DW_AT_name("PIE_GroupNumber_8")
    4382                      .dwattr $C$DW$514, DW_AT_const_value(0x07)
    4383              
    4384              $C$DW$515       .dwtag  DW_TAG_enumerator
    4385                      .dwattr $C$DW$515, DW_AT_name("PIE_GroupNumber_9")
    4386                      .dwattr $C$DW$515, DW_AT_const_value(0x08)
    4387              
    4388              $C$DW$516       .dwtag  DW_TAG_enumerator
    4389                      .dwattr $C$DW$516, DW_AT_name("PIE_GroupNumber_10")
    4390                      .dwattr $C$DW$516, DW_AT_const_value(0x09)
    4391              
    4392              $C$DW$517       .dwtag  DW_TAG_enumerator
    4393                      .dwattr $C$DW$517, DW_AT_name("PIE_GroupNumber_11")
    4394                      .dwattr $C$DW$517, DW_AT_const_value(0x0a)
    4395              
    4396              $C$DW$518       .dwtag  DW_TAG_enumerator
    4397                      .dwattr $C$DW$518, DW_AT_name("PIE_GroupNumber_12")
    4398                      .dwattr $C$DW$518, DW_AT_const_value(0x0b)
    4399              
    4400                      .dwendtag $C$DW$T$217
    4401              
    4402              $C$DW$T$218     .dwtag  DW_TAG_typedef
    4403                      .dwattr $C$DW$T$218, DW_AT_name("PIE_GroupNumber_e")
    4404                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    4405                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    4406              
    4407              
    4408              $C$DW$T$220     .dwtag  DW_TAG_enumeration_type
    4409                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
    4410              $C$DW$519       .dwtag  DW_TAG_enumerator
    4411                      .dwattr $C$DW$519, DW_AT_name("SCI_FifoStatus_Empty")
    4412                      .dwattr $C$DW$519, DW_AT_const_value(0x00)
    4413              
    4414              $C$DW$520       .dwtag  DW_TAG_enumerator
    4415                      .dwattr $C$DW$520, DW_AT_name("SCI_FifoStatus_1_Word")
    4416                      .dwattr $C$DW$520, DW_AT_const_value(0x100)
    4417              
    4418              $C$DW$521       .dwtag  DW_TAG_enumerator
    4419                      .dwattr $C$DW$521, DW_AT_name("SCI_FifoStatus_2_Words")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   87

    4420                      .dwattr $C$DW$521, DW_AT_const_value(0x200)
    4421              
    4422              $C$DW$522       .dwtag  DW_TAG_enumerator
    4423                      .dwattr $C$DW$522, DW_AT_name("SCI_FifoStatus_3_Words")
    4424                      .dwattr $C$DW$522, DW_AT_const_value(0x300)
    4425              
    4426              $C$DW$523       .dwtag  DW_TAG_enumerator
    4427                      .dwattr $C$DW$523, DW_AT_name("SCI_FifoStatus_4_Words")
    4428                      .dwattr $C$DW$523, DW_AT_const_value(0x400)
    4429              
    4430                      .dwendtag $C$DW$T$220
    4431              
    4432              $C$DW$T$221     .dwtag  DW_TAG_typedef
    4433                      .dwattr $C$DW$T$221, DW_AT_name("SCI_FifoStatus_e")
    4434                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    4435                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    4436              
    4437              
    4438              $C$DW$T$225     .dwtag  DW_TAG_enumeration_type
    4439                      .dwattr $C$DW$T$225, DW_AT_byte_size(0x01)
    4440              $C$DW$524       .dwtag  DW_TAG_enumerator
    4441                      .dwattr $C$DW$524, DW_AT_name("HAL_SensorType_Current")
    4442                      .dwattr $C$DW$524, DW_AT_const_value(0x00)
    4443              
    4444              $C$DW$525       .dwtag  DW_TAG_enumerator
    4445                      .dwattr $C$DW$525, DW_AT_name("HAL_SensorType_Voltage")
    4446                      .dwattr $C$DW$525, DW_AT_const_value(0x01)
    4447              
    4448              $C$DW$526       .dwtag  DW_TAG_enumerator
    4449                      .dwattr $C$DW$526, DW_AT_name("HAL_SensorType_BusCurrent")
    4450                      .dwattr $C$DW$526, DW_AT_const_value(0x02)
    4451              
    4452                      .dwendtag $C$DW$T$225
    4453              
    4454              $C$DW$T$226     .dwtag  DW_TAG_typedef
    4455                      .dwattr $C$DW$T$226, DW_AT_name("HAL_SensorType_e")
    4456                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$225)
    4457                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    4458              
    4459              
    4460              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4461                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    4462                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    4463              $C$DW$527       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$24)
    4465                      .dwattr $C$DW$527, DW_AT_name("ADCRESULT")
    4466                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_ADCRESULT")
    4467                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4468                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4469              
    4470              $C$DW$528       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$25)
    4472                      .dwattr $C$DW$528, DW_AT_name("resvd_1")
    4473                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_resvd_1")
    4474                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   88

    4475                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4476              
    4477              $C$DW$529       .dwtag  DW_TAG_member
    4478                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$23)
    4479                      .dwattr $C$DW$529, DW_AT_name("ADCCTL1")
    4480                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_ADCCTL1")
    4481                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4482                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4483              
    4484              $C$DW$530       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
    4486                      .dwattr $C$DW$530, DW_AT_name("ADCCTL2")
    4487                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCCTL2")
    4488                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4489                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4490              
    4491              $C$DW$531       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$26)
    4493                      .dwattr $C$DW$531, DW_AT_name("rsvd_2")
    4494                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_rsvd_2")
    4495                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4496                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4497              
    4498              $C$DW$532       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$23)
    4500                      .dwattr $C$DW$532, DW_AT_name("ADCINTFLG")
    4501                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_ADCINTFLG")
    4502                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4503                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4504              
    4505              $C$DW$533       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$23)
    4507                      .dwattr $C$DW$533, DW_AT_name("ADCINTFLGCLR")
    4508                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4509                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4510                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4511              
    4512              $C$DW$534       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$23)
    4514                      .dwattr $C$DW$534, DW_AT_name("ADCINTOVF")
    4515                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ADCINTOVF")
    4516                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4517                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4518              
    4519              $C$DW$535       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    4521                      .dwattr $C$DW$535, DW_AT_name("ADCINTOVFCLR")
    4522                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4523                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4524                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4525              
    4526              $C$DW$536       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$27)
    4528                      .dwattr $C$DW$536, DW_AT_name("INTSELxNy")
    4529                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   89

    4530                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4531                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4532              
    4533              $C$DW$537       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$28)
    4535                      .dwattr $C$DW$537, DW_AT_name("rsvd_3")
    4536                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_3")
    4537                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4538                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4539              
    4540              $C$DW$538       .dwtag  DW_TAG_member
    4541                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
    4542                      .dwattr $C$DW$538, DW_AT_name("SOCPRICTRL")
    4543                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4544                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4545                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4546              
    4547              $C$DW$539       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$23)
    4549                      .dwattr $C$DW$539, DW_AT_name("rsvd_4")
    4550                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_rsvd_4")
    4551                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4552                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4553              
    4554              $C$DW$540       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$23)
    4556                      .dwattr $C$DW$540, DW_AT_name("ADCSAMPLEMODE")
    4557                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4558                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4559                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4560              
    4561              $C$DW$541       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
    4563                      .dwattr $C$DW$541, DW_AT_name("rsvd_5")
    4564                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd_5")
    4565                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4566                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4567              
    4568              $C$DW$542       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$23)
    4570                      .dwattr $C$DW$542, DW_AT_name("ADCINTSOCSEL1")
    4571                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4572                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4573                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4574              
    4575              $C$DW$543       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
    4577                      .dwattr $C$DW$543, DW_AT_name("ADCINTSOCSEL2")
    4578                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4579                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4580                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4581              
    4582              $C$DW$544       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$26)
    4584                      .dwattr $C$DW$544, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   90

    4585                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd_6")
    4586                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4587                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4588              
    4589              $C$DW$545       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$23)
    4591                      .dwattr $C$DW$545, DW_AT_name("ADCSOCFLG1")
    4592                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4593                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4594                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4595              
    4596              $C$DW$546       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
    4598                      .dwattr $C$DW$546, DW_AT_name("rsvd_7")
    4599                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_rsvd_7")
    4600                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4601                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4602              
    4603              $C$DW$547       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
    4605                      .dwattr $C$DW$547, DW_AT_name("ADCSOCFRC1")
    4606                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4607                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4608                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4609              
    4610              $C$DW$548       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
    4612                      .dwattr $C$DW$548, DW_AT_name("rsvd_8")
    4613                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_rsvd_8")
    4614                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4615                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4616              
    4617              $C$DW$549       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$23)
    4619                      .dwattr $C$DW$549, DW_AT_name("ADCSOCOVF1")
    4620                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4621                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4622                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4623              
    4624              $C$DW$550       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$23)
    4626                      .dwattr $C$DW$550, DW_AT_name("rsvd_9")
    4627                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_rsvd_9")
    4628                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4629                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4630              
    4631              $C$DW$551       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$23)
    4633                      .dwattr $C$DW$551, DW_AT_name("ADCSOCOVFCLR1")
    4634                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4635                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4636                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$552       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   91

    4640                      .dwattr $C$DW$552, DW_AT_name("rsvd_10")
    4641                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd_10")
    4642                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4643                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645              $C$DW$553       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    4647                      .dwattr $C$DW$553, DW_AT_name("ADCSOCxCTL")
    4648                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4649                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4650                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4651              
    4652              $C$DW$554       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    4654                      .dwattr $C$DW$554, DW_AT_name("rsvd_11")
    4655                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_rsvd_11")
    4656                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4657                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4658              
    4659              $C$DW$555       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$23)
    4661                      .dwattr $C$DW$555, DW_AT_name("ADCREFTRIM")
    4662                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4663                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4664                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4665              
    4666              $C$DW$556       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$23)
    4668                      .dwattr $C$DW$556, DW_AT_name("ADCOFFTRIM")
    4669                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4670                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4671                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4672              
    4673              $C$DW$557       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$29)
    4675                      .dwattr $C$DW$557, DW_AT_name("resvd_12")
    4676                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_resvd_12")
    4677                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4678                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4679              
    4680              $C$DW$558       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$23)
    4682                      .dwattr $C$DW$558, DW_AT_name("ADCREV")
    4683                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCREV")
    4684                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4685                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4686              
    4687                      .dwendtag $C$DW$T$30
    4688              
    4689              $C$DW$T$228     .dwtag  DW_TAG_typedef
    4690                      .dwattr $C$DW$T$228, DW_AT_name("ADC_Obj")
    4691                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$30)
    4692                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    4693              
    4694              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   92

    4695                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$30)
    4696                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    4697              
    4698              $C$DW$T$117     .dwtag  DW_TAG_typedef
    4699                      .dwattr $C$DW$T$117, DW_AT_name("ADC_Handle")
    4700                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    4701                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    4702              
    4703              
    4704              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4705                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    4706                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    4707              $C$DW$559       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$31)
    4709                      .dwattr $C$DW$559, DW_AT_name("alpha_sf")
    4710                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_alpha_sf")
    4711                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4712                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4713              
    4714              $C$DW$560       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$31)
    4716                      .dwattr $C$DW$560, DW_AT_name("beta_sf")
    4717                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_beta_sf")
    4718                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4719                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4720              
    4721              $C$DW$561       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$32)
    4723                      .dwattr $C$DW$561, DW_AT_name("numSensors")
    4724                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_numSensors")
    4725                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4726                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4727              
    4728                      .dwendtag $C$DW$T$33
    4729              
    4730              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4731                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    4732                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    4733                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4734              
    4735              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4736                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    4737                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    4738              
    4739              $C$DW$T$43      .dwtag  DW_TAG_typedef
    4740                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    4741                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4742                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4743              
    4744              
    4745              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4746                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    4747                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    4748              $C$DW$562       .dwtag  DW_TAG_member
    4749                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   93

    4750                      .dwattr $C$DW$562, DW_AT_name("XCLK")
    4751                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_XCLK")
    4752                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4753                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4754              
    4755              $C$DW$563       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$23)
    4757                      .dwattr $C$DW$563, DW_AT_name("rsvd_1")
    4758                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_rsvd_1")
    4759                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4760                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4761              
    4762              $C$DW$564       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$23)
    4764                      .dwattr $C$DW$564, DW_AT_name("CLKCTL")
    4765                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_CLKCTL")
    4766                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4767                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4768              
    4769              $C$DW$565       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$34)
    4771                      .dwattr $C$DW$565, DW_AT_name("rsvd_2")
    4772                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_rsvd_2")
    4773                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4774                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4775              
    4776              $C$DW$566       .dwtag  DW_TAG_member
    4777                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$23)
    4778                      .dwattr $C$DW$566, DW_AT_name("LOSPCP")
    4779                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_LOSPCP")
    4780                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4781                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4782              
    4783              $C$DW$567       .dwtag  DW_TAG_member
    4784                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    4785                      .dwattr $C$DW$567, DW_AT_name("PCLKCR0")
    4786                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_PCLKCR0")
    4787                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4788                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4789              
    4790              $C$DW$568       .dwtag  DW_TAG_member
    4791                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$23)
    4792                      .dwattr $C$DW$568, DW_AT_name("PCLKCR1")
    4793                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_PCLKCR1")
    4794                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4795                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    4796              
    4797              $C$DW$569       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$26)
    4799                      .dwattr $C$DW$569, DW_AT_name("rsvd_3")
    4800                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_3")
    4801                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4802                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4803              
    4804              $C$DW$570       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   94

    4805                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    4806                      .dwattr $C$DW$570, DW_AT_name("PCLKCR3")
    4807                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_PCLKCR3")
    4808                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4809                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4810              
    4811                      .dwendtag $C$DW$T$35
    4812              
    4813              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4814                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$35)
    4815                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4816              
    4817              $C$DW$T$119     .dwtag  DW_TAG_typedef
    4818                      .dwattr $C$DW$T$119, DW_AT_name("CLK_Handle")
    4819                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    4820                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4821              
    4822              
    4823              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4824                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    4825                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4826              $C$DW$571       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    4828                      .dwattr $C$DW$571, DW_AT_name("tmp")
    4829                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_tmp")
    4830                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4831                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4832              
    4833                      .dwendtag $C$DW$T$36
    4834              
    4835              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4836                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$36)
    4837                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    4838              
    4839              $C$DW$T$121     .dwtag  DW_TAG_typedef
    4840                      .dwattr $C$DW$T$121, DW_AT_name("CPU_Handle")
    4841                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4842                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    4843              
    4844              
    4845              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4846                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    4847                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    4848              $C$DW$572       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$37)
    4850                      .dwattr $C$DW$572, DW_AT_name("version")
    4851                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_version")
    4852                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4853                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4854              
    4855              $C$DW$573       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$39)
    4857                      .dwattr $C$DW$573, DW_AT_name("state")
    4858                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_state")
    4859                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   95

    4860                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4861              
    4862              $C$DW$574       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$39)
    4864                      .dwattr $C$DW$574, DW_AT_name("prevState")
    4865                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_prevState")
    4866                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4867                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4868              
    4869              $C$DW$575       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$41)
    4871                      .dwattr $C$DW$575, DW_AT_name("errorCode")
    4872                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_errorCode")
    4873                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4874                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4875              
    4876              $C$DW$576       .dwtag  DW_TAG_member
    4877                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$43)
    4878                      .dwattr $C$DW$576, DW_AT_name("clarkeHandle_I")
    4879                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4880                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4881                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4882              
    4883              $C$DW$577       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$44)
    4885                      .dwattr $C$DW$577, DW_AT_name("clarke_I")
    4886                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_clarke_I")
    4887                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4888                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4889              
    4890              $C$DW$578       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$43)
    4892                      .dwattr $C$DW$578, DW_AT_name("clarkeHandle_V")
    4893                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4894                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4895                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4896              
    4897              $C$DW$579       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$44)
    4899                      .dwattr $C$DW$579, DW_AT_name("clarke_V")
    4900                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_clarke_V")
    4901                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4902                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4903              
    4904              $C$DW$580       .dwtag  DW_TAG_member
    4905                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$46)
    4906                      .dwattr $C$DW$580, DW_AT_name("estHandle")
    4907                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_estHandle")
    4908                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4909                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4910              
    4911              $C$DW$581       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$48)
    4913                      .dwattr $C$DW$581, DW_AT_name("parkHandle")
    4914                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_parkHandle")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   96

    4915                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4916                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4917              
    4918              $C$DW$582       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$49)
    4920                      .dwattr $C$DW$582, DW_AT_name("park")
    4921                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_park")
    4922                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4923                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4924              
    4925              $C$DW$583       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$51)
    4927                      .dwattr $C$DW$583, DW_AT_name("pidHandle_Id")
    4928                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_pidHandle_Id")
    4929                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4930                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4931              
    4932              $C$DW$584       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$52)
    4934                      .dwattr $C$DW$584, DW_AT_name("pid_Id")
    4935                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_pid_Id")
    4936                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4937                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4938              
    4939              $C$DW$585       .dwtag  DW_TAG_member
    4940                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$51)
    4941                      .dwattr $C$DW$585, DW_AT_name("pidHandle_Iq")
    4942                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4943                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4944                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4945              
    4946              $C$DW$586       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$52)
    4948                      .dwattr $C$DW$586, DW_AT_name("pid_Iq")
    4949                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_pid_Iq")
    4950                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4951                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4952              
    4953              $C$DW$587       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$51)
    4955                      .dwattr $C$DW$587, DW_AT_name("pidHandle_spd")
    4956                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_pidHandle_spd")
    4957                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4958                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4959              
    4960              $C$DW$588       .dwtag  DW_TAG_member
    4961                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$52)
    4962                      .dwattr $C$DW$588, DW_AT_name("pid_spd")
    4963                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_pid_spd")
    4964                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4965                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4966              
    4967              $C$DW$589       .dwtag  DW_TAG_member
    4968                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$54)
    4969                      .dwattr $C$DW$589, DW_AT_name("iparkHandle")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   97

    4970                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_iparkHandle")
    4971                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4972                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4973              
    4974              $C$DW$590       .dwtag  DW_TAG_member
    4975                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$55)
    4976                      .dwattr $C$DW$590, DW_AT_name("ipark")
    4977                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ipark")
    4978                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4979                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4980              
    4981              $C$DW$591       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$57)
    4983                      .dwattr $C$DW$591, DW_AT_name("svgenHandle")
    4984                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_svgenHandle")
    4985                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4986                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4987              
    4988              $C$DW$592       .dwtag  DW_TAG_member
    4989                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$58)
    4990                      .dwattr $C$DW$592, DW_AT_name("svgen")
    4991                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_svgen")
    4992                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4993                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4994              
    4995              $C$DW$593       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$60)
    4997                      .dwattr $C$DW$593, DW_AT_name("trajHandle_Id")
    4998                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_trajHandle_Id")
    4999                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5000                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    5001              
    5002              $C$DW$594       .dwtag  DW_TAG_member
    5003                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$61)
    5004                      .dwattr $C$DW$594, DW_AT_name("traj_Id")
    5005                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_traj_Id")
    5006                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5007                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    5008              
    5009              $C$DW$595       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$60)
    5011                      .dwattr $C$DW$595, DW_AT_name("trajHandle_spd")
    5012                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_trajHandle_spd")
    5013                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5014                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    5015              
    5016              $C$DW$596       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$61)
    5018                      .dwattr $C$DW$596, DW_AT_name("traj_spd")
    5019                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_traj_spd")
    5020                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5021                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    5022              
    5023              $C$DW$597       .dwtag  DW_TAG_member
    5024                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$60)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   98

    5025                      .dwattr $C$DW$597, DW_AT_name("trajHandle_spdMax")
    5026                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5027                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5028                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    5029              
    5030              $C$DW$598       .dwtag  DW_TAG_member
    5031                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$61)
    5032                      .dwattr $C$DW$598, DW_AT_name("traj_spdMax")
    5033                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_traj_spdMax")
    5034                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5035                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    5036              
    5037              $C$DW$599       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$62)
    5039                      .dwattr $C$DW$599, DW_AT_name("motorParams")
    5040                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_motorParams")
    5041                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5042                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    5043              
    5044              $C$DW$600       .dwtag  DW_TAG_member
    5045                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$65)
    5046                      .dwattr $C$DW$600, DW_AT_name("waitTimes")
    5047                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_waitTimes")
    5048                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5049                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    5050              
    5051              $C$DW$601       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$64)
    5053                      .dwattr $C$DW$601, DW_AT_name("counter_state")
    5054                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_counter_state")
    5055                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5056                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    5057              
    5058              $C$DW$602       .dwtag  DW_TAG_member
    5059                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$66)
    5060                      .dwattr $C$DW$602, DW_AT_name("numIsrTicksPerCtrlTick")
    5061                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5062                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5063                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    5064              
    5065              $C$DW$603       .dwtag  DW_TAG_member
    5066                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$66)
    5067                      .dwattr $C$DW$603, DW_AT_name("numCtrlTicksPerCurrentTick")
    5068                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5069                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5070                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    5071              
    5072              $C$DW$604       .dwtag  DW_TAG_member
    5073                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$66)
    5074                      .dwattr $C$DW$604, DW_AT_name("numCtrlTicksPerSpeedTick")
    5075                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5076                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5077                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    5078              
    5079              $C$DW$605       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE   99

    5080                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$66)
    5081                      .dwattr $C$DW$605, DW_AT_name("numCtrlTicksPerTrajTick")
    5082                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5083                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5084                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    5085              
    5086              $C$DW$606       .dwtag  DW_TAG_member
    5087                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$64)
    5088                      .dwattr $C$DW$606, DW_AT_name("ctrlFreq_Hz")
    5089                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5090                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5091                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    5092              
    5093              $C$DW$607       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$64)
    5095                      .dwattr $C$DW$607, DW_AT_name("trajFreq_Hz")
    5096                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5097                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5098                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    5099              
    5100              $C$DW$608       .dwtag  DW_TAG_member
    5101                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$31)
    5102                      .dwattr $C$DW$608, DW_AT_name("trajPeriod_sec")
    5103                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5104                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5105                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    5106              
    5107              $C$DW$609       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$67)
    5109                      .dwattr $C$DW$609, DW_AT_name("ctrlPeriod_sec")
    5110                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5111                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5112                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    5113              
    5114              $C$DW$610       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$31)
    5116                      .dwattr $C$DW$610, DW_AT_name("maxVsMag_pu")
    5117                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5118                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5119                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    5120              
    5121              $C$DW$611       .dwtag  DW_TAG_member
    5122                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$68)
    5123                      .dwattr $C$DW$611, DW_AT_name("Iab_in")
    5124                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_Iab_in")
    5125                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5126                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    5127              
    5128              $C$DW$612       .dwtag  DW_TAG_member
    5129                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$68)
    5130                      .dwattr $C$DW$612, DW_AT_name("Iab_filt")
    5131                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_Iab_filt")
    5132                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5133                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    5134              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  100

    5135              $C$DW$613       .dwtag  DW_TAG_member
    5136                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$68)
    5137                      .dwattr $C$DW$613, DW_AT_name("Idq_in")
    5138                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_Idq_in")
    5139                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5140                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    5141              
    5142              $C$DW$614       .dwtag  DW_TAG_member
    5143                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$68)
    5144                      .dwattr $C$DW$614, DW_AT_name("Vab_in")
    5145                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Vab_in")
    5146                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5147                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    5148              
    5149              $C$DW$615       .dwtag  DW_TAG_member
    5150                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$31)
    5151                      .dwattr $C$DW$615, DW_AT_name("spd_out")
    5152                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_spd_out")
    5153                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5154                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    5155              
    5156              $C$DW$616       .dwtag  DW_TAG_member
    5157                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$68)
    5158                      .dwattr $C$DW$616, DW_AT_name("Vab_out")
    5159                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_Vab_out")
    5160                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5161                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    5162              
    5163              $C$DW$617       .dwtag  DW_TAG_member
    5164                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$68)
    5165                      .dwattr $C$DW$617, DW_AT_name("Vdq_out")
    5166                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_Vdq_out")
    5167                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5168                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    5169              
    5170              $C$DW$618       .dwtag  DW_TAG_member
    5171                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$67)
    5172                      .dwattr $C$DW$618, DW_AT_name("Rhf")
    5173                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_Rhf")
    5174                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5175                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    5176              
    5177              $C$DW$619       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$67)
    5179                      .dwattr $C$DW$619, DW_AT_name("Lhf")
    5180                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_Lhf")
    5181                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5182                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    5183              
    5184              $C$DW$620       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$67)
    5186                      .dwattr $C$DW$620, DW_AT_name("RoverL")
    5187                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_RoverL")
    5188                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5189                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  101

    5190              
    5191              $C$DW$621       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$31)
    5193                      .dwattr $C$DW$621, DW_AT_name("Kp_Id")
    5194                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_Kp_Id")
    5195                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5196                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    5197              
    5198              $C$DW$622       .dwtag  DW_TAG_member
    5199                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$31)
    5200                      .dwattr $C$DW$622, DW_AT_name("Kp_Iq")
    5201                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Kp_Iq")
    5202                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5203                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    5204              
    5205              $C$DW$623       .dwtag  DW_TAG_member
    5206                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$31)
    5207                      .dwattr $C$DW$623, DW_AT_name("Kp_spd")
    5208                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_Kp_spd")
    5209                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5210                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    5211              
    5212              $C$DW$624       .dwtag  DW_TAG_member
    5213                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$31)
    5214                      .dwattr $C$DW$624, DW_AT_name("Ki_Id")
    5215                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Ki_Id")
    5216                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5217                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    5218              
    5219              $C$DW$625       .dwtag  DW_TAG_member
    5220                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$31)
    5221                      .dwattr $C$DW$625, DW_AT_name("Ki_Iq")
    5222                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Ki_Iq")
    5223                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5224                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    5225              
    5226              $C$DW$626       .dwtag  DW_TAG_member
    5227                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$31)
    5228                      .dwattr $C$DW$626, DW_AT_name("Ki_spd")
    5229                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Ki_spd")
    5230                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5231                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    5232              
    5233              $C$DW$627       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$31)
    5235                      .dwattr $C$DW$627, DW_AT_name("Kd_Id")
    5236                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Kd_Id")
    5237                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5238                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    5239              
    5240              $C$DW$628       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$31)
    5242                      .dwattr $C$DW$628, DW_AT_name("Kd_Iq")
    5243                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_Kd_Iq")
    5244                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  102

    5245                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    5246              
    5247              $C$DW$629       .dwtag  DW_TAG_member
    5248                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    5249                      .dwattr $C$DW$629, DW_AT_name("Kd_spd")
    5250                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Kd_spd")
    5251                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5252                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    5253              
    5254              $C$DW$630       .dwtag  DW_TAG_member
    5255                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
    5256                      .dwattr $C$DW$630, DW_AT_name("Ui_Id")
    5257                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Ui_Id")
    5258                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5259                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    5260              
    5261              $C$DW$631       .dwtag  DW_TAG_member
    5262                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$31)
    5263                      .dwattr $C$DW$631, DW_AT_name("Ui_Iq")
    5264                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Ui_Iq")
    5265                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5266                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    5267              
    5268              $C$DW$632       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$31)
    5270                      .dwattr $C$DW$632, DW_AT_name("Ui_spd")
    5271                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Ui_spd")
    5272                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5273                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    5274              
    5275              $C$DW$633       .dwtag  DW_TAG_member
    5276                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$68)
    5277                      .dwattr $C$DW$633, DW_AT_name("Idq_ref")
    5278                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Idq_ref")
    5279                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5280                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    5281              
    5282              $C$DW$634       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$31)
    5284                      .dwattr $C$DW$634, DW_AT_name("IdRated")
    5285                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_IdRated")
    5286                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5287                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    5288              
    5289              $C$DW$635       .dwtag  DW_TAG_member
    5290                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$31)
    5291                      .dwattr $C$DW$635, DW_AT_name("spd_ref")
    5292                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_spd_ref")
    5293                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5294                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    5295              
    5296              $C$DW$636       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$31)
    5298                      .dwattr $C$DW$636, DW_AT_name("spd_max")
    5299                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_spd_max")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  103

    5300                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5301                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    5302              
    5303              $C$DW$637       .dwtag  DW_TAG_member
    5304                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$66)
    5305                      .dwattr $C$DW$637, DW_AT_name("counter_current")
    5306                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_counter_current")
    5307                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5308                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    5309              
    5310              $C$DW$638       .dwtag  DW_TAG_member
    5311                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$66)
    5312                      .dwattr $C$DW$638, DW_AT_name("counter_isr")
    5313                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_counter_isr")
    5314                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5315                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    5316              
    5317              $C$DW$639       .dwtag  DW_TAG_member
    5318                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$66)
    5319                      .dwattr $C$DW$639, DW_AT_name("counter_speed")
    5320                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_counter_speed")
    5321                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5322                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    5323              
    5324              $C$DW$640       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$66)
    5326                      .dwattr $C$DW$640, DW_AT_name("counter_traj")
    5327                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_counter_traj")
    5328                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5329                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    5330              
    5331              $C$DW$641       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$69)
    5333                      .dwattr $C$DW$641, DW_AT_name("flag_enableCtrl")
    5334                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5335                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5336                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    5337              
    5338              $C$DW$642       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$69)
    5340                      .dwattr $C$DW$642, DW_AT_name("flag_enableDcBusComp")
    5341                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5342                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5343                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    5344              
    5345              $C$DW$643       .dwtag  DW_TAG_member
    5346                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$69)
    5347                      .dwattr $C$DW$643, DW_AT_name("flag_enablePowerWarp")
    5348                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5349                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5350                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    5351              
    5352              $C$DW$644       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$69)
    5354                      .dwattr $C$DW$644, DW_AT_name("flag_enableOffset")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  104

    5355                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_flag_enableOffset")
    5356                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5357                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    5358              
    5359              $C$DW$645       .dwtag  DW_TAG_member
    5360                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$69)
    5361                      .dwattr $C$DW$645, DW_AT_name("flag_enableSpeedCtrl")
    5362                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5363                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5364                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    5365              
    5366              $C$DW$646       .dwtag  DW_TAG_member
    5367                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$69)
    5368                      .dwattr $C$DW$646, DW_AT_name("flag_enableUserMotorParams")
    5369                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5370                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5371                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    5372              
    5373              $C$DW$647       .dwtag  DW_TAG_member
    5374                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$68)
    5375                      .dwattr $C$DW$647, DW_AT_name("Idq_offset_pu")
    5376                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5377                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5378                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    5379              
    5380              $C$DW$648       .dwtag  DW_TAG_member
    5381                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$68)
    5382                      .dwattr $C$DW$648, DW_AT_name("Vdq_offset_pu")
    5383                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5384                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5385                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    5386              
    5387              $C$DW$649       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$31)
    5389                      .dwattr $C$DW$649, DW_AT_name("angle_pu")
    5390                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_angle_pu")
    5391                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5392                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    5393              
    5394              $C$DW$650       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$31)
    5396                      .dwattr $C$DW$650, DW_AT_name("speed_ref_pu")
    5397                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_speed_ref_pu")
    5398                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5399                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    5400              
    5401              $C$DW$651       .dwtag  DW_TAG_member
    5402                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$31)
    5403                      .dwattr $C$DW$651, DW_AT_name("speed_fb_pu")
    5404                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_speed_fb_pu")
    5405                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5406                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    5407              
    5408              $C$DW$652       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  105

    5410                      .dwattr $C$DW$652, DW_AT_name("speed_outMax_pu")
    5411                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5412                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5413                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    5414              
    5415              $C$DW$653       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$69)
    5417                      .dwattr $C$DW$653, DW_AT_name("flag_enableCurrentCtrl")
    5418                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5419                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5420                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    5421              
    5422                      .dwendtag $C$DW$T$70
    5423              
    5424              $C$DW$T$229     .dwtag  DW_TAG_typedef
    5425                      .dwattr $C$DW$T$229, DW_AT_name("CTRL_Obj")
    5426                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$70)
    5427                      .dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
    5428              
    5429              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
    5430                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
    5431                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    5432              
    5433              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    5434                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$70)
    5435                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    5436              
    5437              $C$DW$T$201     .dwtag  DW_TAG_typedef
    5438                      .dwattr $C$DW$T$201, DW_AT_name("CTRL_Handle")
    5439                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    5440                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    5441              
    5442              $C$DW$654       .dwtag  DW_TAG_TI_far_type
    5443                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$201)
    5444              
    5445              $C$DW$T$231     .dwtag  DW_TAG_const_type
    5446                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$654)
    5447              
    5448              
    5449              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    5450                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    5451                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    5452              $C$DW$655       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$22)
    5454                      .dwattr $C$DW$655, DW_AT_name("rsvd")
    5455                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd")
    5456                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5457                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    5458              
    5459              $C$DW$656       .dwtag  DW_TAG_member
    5460                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$72)
    5461                      .dwattr $C$DW$656, DW_AT_name("targetProc")
    5462                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_targetProc")
    5463                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5464                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  106

    5465              
    5466              $C$DW$657       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$22)
    5468                      .dwattr $C$DW$657, DW_AT_name("major")
    5469                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_major")
    5470                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5471                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5472              
    5473              $C$DW$658       .dwtag  DW_TAG_member
    5474                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
    5475                      .dwattr $C$DW$658, DW_AT_name("minor")
    5476                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_minor")
    5477                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5478                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5479              
    5480                      .dwendtag $C$DW$T$73
    5481              
    5482              $C$DW$T$37      .dwtag  DW_TAG_typedef
    5483                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    5484                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    5485                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    5486              
    5487              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    5488                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$37)
    5489                      .dwattr $C$DW$T$239, DW_AT_address_class(0x20)
    5490              
    5491              
    5492              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    5493                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    5494                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    5495              $C$DW$659       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$75)
    5497                      .dwattr $C$DW$659, DW_AT_name("spiHandle")
    5498                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_spiHandle")
    5499                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5500                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5501              
    5502              $C$DW$660       .dwtag  DW_TAG_member
    5503                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$77)
    5504                      .dwattr $C$DW$660, DW_AT_name("gpioHandle")
    5505                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_gpioHandle")
    5506                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5507                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5508              
    5509              $C$DW$661       .dwtag  DW_TAG_member
    5510                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$79)
    5511                      .dwattr $C$DW$661, DW_AT_name("gpioNumber")
    5512                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_gpioNumber")
    5513                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5514                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5515              
    5516              $C$DW$662       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$69)
    5518                      .dwattr $C$DW$662, DW_AT_name("RxTimeOut")
    5519                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_RxTimeOut")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  107

    5520                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5521                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5522              
    5523              $C$DW$663       .dwtag  DW_TAG_member
    5524                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$69)
    5525                      .dwattr $C$DW$663, DW_AT_name("enableTimeOut")
    5526                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_enableTimeOut")
    5527                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5528                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    5529              
    5530                      .dwendtag $C$DW$T$80
    5531              
    5532              $C$DW$T$149     .dwtag  DW_TAG_typedef
    5533                      .dwattr $C$DW$T$149, DW_AT_name("DRV8301_Obj")
    5534                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$80)
    5535                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5536              
    5537              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    5538                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$80)
    5539                      .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    5540              
    5541              $C$DW$T$148     .dwtag  DW_TAG_typedef
    5542                      .dwattr $C$DW$T$148, DW_AT_name("DRV8301_Handle")
    5543                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    5544                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    5545              
    5546              
    5547              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    5548                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5549                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
    5550              $C$DW$664       .dwtag  DW_TAG_member
    5551                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$82)
    5552                      .dwattr $C$DW$664, DW_AT_name("DRV8301_CURRENT")
    5553                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5554                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5555                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5556              
    5557              $C$DW$665       .dwtag  DW_TAG_member
    5558                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$84)
    5559                      .dwattr $C$DW$665, DW_AT_name("DRV8301_RESET")
    5560                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5561                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5562                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5563              
    5564              $C$DW$666       .dwtag  DW_TAG_member
    5565                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$86)
    5566                      .dwattr $C$DW$666, DW_AT_name("PWM_MODE")
    5567                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_PWM_MODE")
    5568                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5569                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5570              
    5571              $C$DW$667       .dwtag  DW_TAG_member
    5572                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$88)
    5573                      .dwattr $C$DW$667, DW_AT_name("OC_MODE")
    5574                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_OC_MODE")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  108

    5575                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5576                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5577              
    5578              $C$DW$668       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$90)
    5580                      .dwattr $C$DW$668, DW_AT_name("OC_ADJ_SET")
    5581                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5582                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5583                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5584              
    5585                      .dwendtag $C$DW$T$91
    5586              
    5587              $C$DW$T$105     .dwtag  DW_TAG_typedef
    5588                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5589                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$91)
    5590                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    5591              
    5592              
    5593              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    5594                      .dwattr $C$DW$T$100, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5595                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    5596              $C$DW$669       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$93)
    5598                      .dwattr $C$DW$669, DW_AT_name("OCTW_SET")
    5599                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_OCTW_SET")
    5600                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5601                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5602              
    5603              $C$DW$670       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$95)
    5605                      .dwattr $C$DW$670, DW_AT_name("GAIN")
    5606                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_GAIN")
    5607                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5608                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5609              
    5610              $C$DW$671       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$97)
    5612                      .dwattr $C$DW$671, DW_AT_name("DC_CAL_CH1p2")
    5613                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5614                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5615                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5616              
    5617              $C$DW$672       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$99)
    5619                      .dwattr $C$DW$672, DW_AT_name("OC_TOFF")
    5620                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_OC_TOFF")
    5621                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5622                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5623              
    5624                      .dwendtag $C$DW$T$100
    5625              
    5626              $C$DW$T$106     .dwtag  DW_TAG_typedef
    5627                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5628                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$100)
    5629                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  109

    5630              
    5631              
    5632              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    5633                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5634                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x0b)
    5635              $C$DW$673       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$69)
    5637                      .dwattr $C$DW$673, DW_AT_name("FAULT")
    5638                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_FAULT")
    5639                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5640                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5641              
    5642              $C$DW$674       .dwtag  DW_TAG_member
    5643                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$69)
    5644                      .dwattr $C$DW$674, DW_AT_name("GVDD_UV")
    5645                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_GVDD_UV")
    5646                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5647                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5648              
    5649              $C$DW$675       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$69)
    5651                      .dwattr $C$DW$675, DW_AT_name("PVDD_UV")
    5652                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_PVDD_UV")
    5653                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5654                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5655              
    5656              $C$DW$676       .dwtag  DW_TAG_member
    5657                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$69)
    5658                      .dwattr $C$DW$676, DW_AT_name("OTSD")
    5659                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_OTSD")
    5660                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5661                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5662              
    5663              $C$DW$677       .dwtag  DW_TAG_member
    5664                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$69)
    5665                      .dwattr $C$DW$677, DW_AT_name("OTW")
    5666                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_OTW")
    5667                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5668                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5669              
    5670              $C$DW$678       .dwtag  DW_TAG_member
    5671                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$69)
    5672                      .dwattr $C$DW$678, DW_AT_name("FETHA_OC")
    5673                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_FETHA_OC")
    5674                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5675                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5676              
    5677              $C$DW$679       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$69)
    5679                      .dwattr $C$DW$679, DW_AT_name("FETLA_OC")
    5680                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_FETLA_OC")
    5681                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5682                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5683              
    5684              $C$DW$680       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0057210                          PAGE  110

    5685                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$69)
    5686                      .dwattr $C$DW$680, DW_AT_name("FETHB_OC")
    5687                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_FETHB_OC")
    5688                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5689                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5690              
    5691              $C$DW$681       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$69)
    5693                      .dwattr $C$DW$681, DW_AT_name("FETLB_OC")
    5694                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_FETLB_OC")
    5695                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5696                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5697              
    5698              $C$DW$682       .dwtag  DW_TAG_member
    5699                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    5700                      .dwattr $C$DW$682, DW_AT_name("FETHC_OC")
    5701                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_FETHC_OC")
    5702                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5703                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5704              
    5705              $C$DW$683       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$69)
    5707                      .dwattr $C$DW$683, DW_AT_name("FETLC_OC")
    5708                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_FETLC_OC")
    5709                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5710                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5711              
    5712                      .dwendtag $C$DW$T$101
    5713              
    5714              $C$DW$T$103     .dwtag  DW_TAG_typedef
    5715                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5716                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    5717                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    5718              
    5719              
    5720              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5721                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5722                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    5723              $C$DW$684       .dwtag  DW_TAG_member
    5724                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    5725                      .dwattr $C$DW$684, DW_AT_name("GVDD_OV")
