TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:02:04 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../modules/source/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *
      16              ;**************************************************************

    7871                      .dwattr $C$DW$662, DW_AT_name("EST_State_RoverL")
    7872                      .dwattr $C$DW$662, DW_AT_const_value(0x02)
    7873              
    7874              $C$DW$663       .dwtag  DW_TAG_enumerator
    7875                      .dwattr $C$DW$663, DW_AT_name("EST_State_Rs")
    7876                      .dwattr $C$DW$663, DW_AT_const_value(0x03)
    7877              
    7878              $C$DW$664       .dwtag  DW_TAG_enumerator
    7879                      .dwattr $C$DW$664, DW_AT_name("EST_State_RampUp")
    7880                      .dwattr $C$DW$664, DW_AT_const_value(0x04)
    7881              
    7882              $C$DW$665       .dwtag  DW_TAG_enumerator
    7883                      .dwattr $C$DW$665, DW_AT_name("EST_State_IdRated")
    7884                      .dwattr $C$DW$665, DW_AT_const_value(0x05)
    7885              
    7886              $C$DW$666       .dwtag  DW_TAG_enumerator
    7887                      .dwattr $C$DW$666, DW_AT_name("EST_State_RatedFlux_OL")
    7888                      .dwattr $C$DW$666, DW_AT_const_value(0x06)
    7889              
    7890              $C$DW$667       .dwtag  DW_TAG_enumerator
    7891                      .dwattr $C$DW$667, DW_AT_name("EST_State_RatedFlux")
    7892                      .dwattr $C$DW$667, DW_AT_const_value(0x07)
    7893              
    7894              $C$DW$668       .dwtag  DW_TAG_enumerator
    7895                      .dwattr $C$DW$668, DW_AT_name("EST_State_RampDown")
    7896                      .dwattr $C$DW$668, DW_AT_const_value(0x08)
    7897              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  151

    7898              $C$DW$669       .dwtag  DW_TAG_enumerator
    7899                      .dwattr $C$DW$669, DW_AT_name("EST_State_LockRotor")
    7900                      .dwattr $C$DW$669, DW_AT_const_value(0x09)
    7901              
    7902              $C$DW$670       .dwtag  DW_TAG_enumerator
    7903                      .dwattr $C$DW$670, DW_AT_name("EST_State_Ls")
    7904                      .dwattr $C$DW$670, DW_AT_const_value(0x0a)
    7905              
    7906              $C$DW$671       .dwtag  DW_TAG_enumerator
    7907                      .dwattr $C$DW$671, DW_AT_name("EST_State_Rr")
    7908                      .dwattr $C$DW$671, DW_AT_const_value(0x0b)
    7909              
    7910              $C$DW$672       .dwtag  DW_TAG_enumerator
    7911                      .dwattr $C$DW$672, DW_AT_name("EST_State_MotorIdentified")
    7912                      .dwattr $C$DW$672, DW_AT_const_value(0x0c)
    7913              
    7914              $C$DW$673       .dwtag  DW_TAG_enumerator
    7915                      .dwattr $C$DW$673, DW_AT_name("EST_State_OnLine")
    7916                      .dwattr $C$DW$673, DW_AT_const_value(0x0d)
    7917              
    7918              $C$DW$674       .dwtag  DW_TAG_enumerator
    7919                      .dwattr $C$DW$674, DW_AT_name("EST_numStates")
    7920                      .dwattr $C$DW$674, DW_AT_const_value(0x0e)
    7921              
    7922                      .dwendtag $C$DW$T$176
    7923              
    7924              $C$DW$T$177     .dwtag  DW_TAG_typedef
    7925                      .dwattr $C$DW$T$177, DW_AT_name("EST_State_e")
    7926                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    7927                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    7928              
    7929              
    7930              $C$DW$T$181     .dwtag  DW_TAG_enumeration_type
    7931                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x01)
    7932              $C$DW$675       .dwtag  DW_TAG_enumerator
    7933                      .dwattr $C$DW$675, DW_AT_name("CTRL_Type_PID_spd")
    7934                      .dwattr $C$DW$675, DW_AT_const_value(0x00)
    7935              
    7936              $C$DW$676       .dwtag  DW_TAG_enumerator
    7937                      .dwattr $C$DW$676, DW_AT_name("CTRL_Type_PID_Id")
    7938                      .dwattr $C$DW$676, DW_AT_const_value(0x01)
    7939              
    7940              $C$DW$677       .dwtag  DW_TAG_enumerator
    7941                      .dwattr $C$DW$677, DW_AT_name("CTRL_Type_PID_Iq")
    7942                      .dwattr $C$DW$677, DW_AT_const_value(0x02)
    7943              
    7944                      .dwendtag $C$DW$T$181
    7945              
    7946              $C$DW$T$182     .dwtag  DW_TAG_typedef
    7947                      .dwattr $C$DW$T$182, DW_AT_name("CTRL_Type_e")
    7948                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    7949                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    7950              
    7951              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    7952                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$182)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  152

    7953              
    7954              $C$DW$T$183     .dwtag  DW_TAG_const_type
    7955                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$678)
    7956              
    7957              
    7958              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7959                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7960                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7961              $C$DW$679       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    7963                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    7964                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    7965                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7966                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7967              
    7968              $C$DW$680       .dwtag  DW_TAG_member
    7969                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    7970                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    7971                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    7972                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7973                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7974              
    7975              $C$DW$681       .dwtag  DW_TAG_member
    7976                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$23)
    7977                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    7978                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
    7979                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7980                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7981              
    7982              $C$DW$682       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    7984                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    7985                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    7986                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7987                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7988              
    7989              $C$DW$683       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    7991                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    7992                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    7993                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7994                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7995              
    7996              $C$DW$684       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    7998                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    7999                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    8000                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8001                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8002              
    8003              $C$DW$685       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    8005                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    8006                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8007                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  153

    8008                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8009              
    8010              $C$DW$686       .dwtag  DW_TAG_member
    8011                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    8012                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    8013                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    8014                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8015                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8016              
    8017              $C$DW$687       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    8019                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    8020                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8021                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8022                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8023              
    8024              $C$DW$688       .dwtag  DW_TAG_member
    8025                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    8026                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    8027                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    8028                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8029                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8030              
    8031              $C$DW$689       .dwtag  DW_TAG_member
    8032                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    8033                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    8034                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    8035                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8036                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8037              
    8038              $C$DW$690       .dwtag  DW_TAG_member
    8039                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    8040                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    8041                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8042                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8043                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8044              
    8045              $C$DW$691       .dwtag  DW_TAG_member
    8046                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    8047                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    8048                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    8049                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8050                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8051              
    8052              $C$DW$692       .dwtag  DW_TAG_member
    8053                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    8054                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    8055                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8056                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8057                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8058              
    8059              $C$DW$693       .dwtag  DW_TAG_member
    8060                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    8061                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    8062                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  154

    8063                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8064                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8065              
    8066              $C$DW$694       .dwtag  DW_TAG_member
    8067                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    8068                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    8069                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8070                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8071                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8072              
    8073              $C$DW$695       .dwtag  DW_TAG_member
    8074                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    8075                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
    8076                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8077                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8078                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8079              
    8080              $C$DW$696       .dwtag  DW_TAG_member
    8081                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    8082                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    8083                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    8084                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8085                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8086              
    8087              $C$DW$697       .dwtag  DW_TAG_member
    8088                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    8089                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    8090                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8091                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8092                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8093              
    8094              $C$DW$698       .dwtag  DW_TAG_member
    8095                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    8096                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
    8097                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    8098                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8099                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8100              
    8101              $C$DW$699       .dwtag  DW_TAG_member
    8102                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    8103                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    8104                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8105                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8106                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8107              
    8108              $C$DW$700       .dwtag  DW_TAG_member
    8109                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    8110                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    8111                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    8112                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8113                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8114              
    8115              $C$DW$701       .dwtag  DW_TAG_member
    8116                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    8117                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  155

    8118                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8119                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8120                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8121              
    8122              $C$DW$702       .dwtag  DW_TAG_member
    8123                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    8124                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    8125                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    8126                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8127                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8128              
    8129              $C$DW$703       .dwtag  DW_TAG_member
    8130                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    8131                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    8132                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8133                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8134                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8135              
    8136              $C$DW$704       .dwtag  DW_TAG_member
    8137                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    8138                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    8139                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
    8140                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8141                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8142              
    8143              $C$DW$705       .dwtag  DW_TAG_member
    8144                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8145                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    8146                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8147                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8148                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8149              
    8150              $C$DW$706       .dwtag  DW_TAG_member
    8151                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    8152                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    8153                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    8154                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8155                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8156              
    8157              $C$DW$707       .dwtag  DW_TAG_member
    8158                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    8159                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    8160                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8161                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8162                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8163              
    8164              $C$DW$708       .dwtag  DW_TAG_member
    8165                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    8166                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    8167                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8168                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8169                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8170              
    8171              $C$DW$709       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  156

    8173                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    8174                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    8175                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8176                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8177              
    8178              $C$DW$710       .dwtag  DW_TAG_member
    8179                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    8180                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    8181                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    8182                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8183                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8184              
    8185                      .dwendtag $C$DW$T$30
    8186              
    8187              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8188                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    8189                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8190              
    8191              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8192                      .dwattr $C$DW$T$90, DW_AT_name("ADC_Handle")
    8193                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8194                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8195              
    8196              
    8197              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8198                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    8199                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    8200              $C$DW$711       .dwtag  DW_TAG_member
    8201                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$31)
    8202                      .dwattr $C$DW$711, DW_AT_name("alpha_sf")
    8203                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_alpha_sf")
    8204                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8205                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8206              
    8207              $C$DW$712       .dwtag  DW_TAG_member
    8208                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$31)
    8209                      .dwattr $C$DW$712, DW_AT_name("beta_sf")
    8210                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_beta_sf")
    8211                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8212                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8213              
    8214              $C$DW$713       .dwtag  DW_TAG_member
    8215                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    8216                      .dwattr $C$DW$713, DW_AT_name("numSensors")
    8217                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numSensors")
    8218                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8219                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8220              
    8221                      .dwendtag $C$DW$T$33
    8222              
    8223              $C$DW$T$44      .dwtag  DW_TAG_typedef
    8224                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    8225                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    8226                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    8227              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  157

    8228              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    8229                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$44)
    8230                      .dwattr $C$DW$T$184, DW_AT_address_class(0x20)
    8231              
    8232              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    8233                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    8234                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    8235              
    8236              $C$DW$T$43      .dwtag  DW_TAG_typedef
    8237                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    8238                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    8239                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    8240              
    8241              
    8242              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8243                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    8244                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    8245              $C$DW$714       .dwtag  DW_TAG_member
    8246                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    8247                      .dwattr $C$DW$714, DW_AT_name("XCLK")
    8248                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_XCLK")
    8249                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8250                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8251              
    8252              $C$DW$715       .dwtag  DW_TAG_member
    8253                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    8254                      .dwattr $C$DW$715, DW_AT_name("rsvd_1")
    8255                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_1")
    8256                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8257                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8258              
    8259              $C$DW$716       .dwtag  DW_TAG_member
    8260                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    8261                      .dwattr $C$DW$716, DW_AT_name("CLKCTL")
    8262                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_CLKCTL")
    8263                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8264                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8265              
    8266              $C$DW$717       .dwtag  DW_TAG_member
    8267                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$34)
    8268                      .dwattr $C$DW$717, DW_AT_name("rsvd_2")
    8269                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_rsvd_2")
    8270                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8271                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8272              
    8273              $C$DW$718       .dwtag  DW_TAG_member
    8274                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    8275                      .dwattr $C$DW$718, DW_AT_name("LOSPCP")
    8276                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_LOSPCP")
    8277                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8278                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8279              
    8280              $C$DW$719       .dwtag  DW_TAG_member
    8281                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    8282                      .dwattr $C$DW$719, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  158

    8283                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_PCLKCR0")
    8284                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8285                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8286              
    8287              $C$DW$720       .dwtag  DW_TAG_member
    8288                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    8289                      .dwattr $C$DW$720, DW_AT_name("PCLKCR1")
    8290                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR1")
    8291                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8292                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8293              
    8294              $C$DW$721       .dwtag  DW_TAG_member
    8295                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$26)
    8296                      .dwattr $C$DW$721, DW_AT_name("rsvd_3")
    8297                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_3")
    8298                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8299                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8300              
    8301              $C$DW$722       .dwtag  DW_TAG_member
    8302                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    8303                      .dwattr $C$DW$722, DW_AT_name("PCLKCR3")
    8304                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_PCLKCR3")
    8305                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8306                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8307              
    8308                      .dwendtag $C$DW$T$35
    8309              
    8310              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    8311                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    8312                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    8313              
    8314              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8315                      .dwattr $C$DW$T$92, DW_AT_name("CLK_Handle")
    8316                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    8317                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8318              
    8319              
    8320              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8321                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    8322                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8323              $C$DW$723       .dwtag  DW_TAG_member
    8324                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$32)
    8325                      .dwattr $C$DW$723, DW_AT_name("tmp")
    8326                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_tmp")
    8327                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8328                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8329              
    8330                      .dwendtag $C$DW$T$36
    8331              
    8332              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8333                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    8334                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    8335              
    8336              $C$DW$T$94      .dwtag  DW_TAG_typedef
    8337                      .dwattr $C$DW$T$94, DW_AT_name("CPU_Handle")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  159

    8338                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8339                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    8340              
    8341              
    8342              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8343                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    8344                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    8345              $C$DW$724       .dwtag  DW_TAG_member
    8346                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$37)
    8347                      .dwattr $C$DW$724, DW_AT_name("version")
    8348                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_version")
    8349                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8350                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8351              
    8352              $C$DW$725       .dwtag  DW_TAG_member
    8353                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$39)
    8354                      .dwattr $C$DW$725, DW_AT_name("state")
    8355                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_state")
    8356                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8357                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8358              
    8359              $C$DW$726       .dwtag  DW_TAG_member
    8360                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    8361                      .dwattr $C$DW$726, DW_AT_name("prevState")
    8362                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_prevState")
    8363                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8364                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8365              
    8366              $C$DW$727       .dwtag  DW_TAG_member
    8367                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$41)
    8368                      .dwattr $C$DW$727, DW_AT_name("errorCode")
    8369                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_errorCode")
    8370                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8371                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8372              
    8373              $C$DW$728       .dwtag  DW_TAG_member
    8374                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$43)
    8375                      .dwattr $C$DW$728, DW_AT_name("clarkeHandle_I")
    8376                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8377                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8378                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8379              
    8380              $C$DW$729       .dwtag  DW_TAG_member
    8381                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$44)
    8382                      .dwattr $C$DW$729, DW_AT_name("clarke_I")
    8383                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_clarke_I")
    8384                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8385                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8386              
    8387              $C$DW$730       .dwtag  DW_TAG_member
    8388                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$43)
    8389                      .dwattr $C$DW$730, DW_AT_name("clarkeHandle_V")
    8390                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8391                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8392                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  160

    8393              
    8394              $C$DW$731       .dwtag  DW_TAG_member
    8395                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$44)
    8396                      .dwattr $C$DW$731, DW_AT_name("clarke_V")
    8397                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarke_V")
    8398                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8399                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8400              
    8401              $C$DW$732       .dwtag  DW_TAG_member
    8402                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$46)
    8403                      .dwattr $C$DW$732, DW_AT_name("estHandle")
    8404                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_estHandle")
    8405                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8406                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8407              
    8408              $C$DW$733       .dwtag  DW_TAG_member
    8409                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$48)
    8410                      .dwattr $C$DW$733, DW_AT_name("parkHandle")
    8411                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_parkHandle")
    8412                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8413                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8414              
    8415              $C$DW$734       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$49)
    8417                      .dwattr $C$DW$734, DW_AT_name("park")
    8418                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_park")
    8419                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8420                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8421              
    8422              $C$DW$735       .dwtag  DW_TAG_member
    8423                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$51)
    8424                      .dwattr $C$DW$735, DW_AT_name("pidHandle_Id")
    8425                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_pidHandle_Id")
    8426                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8427                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8428              
    8429              $C$DW$736       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$52)
    8431                      .dwattr $C$DW$736, DW_AT_name("pid_Id")
    8432                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pid_Id")
    8433                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8434                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8435              
    8436              $C$DW$737       .dwtag  DW_TAG_member
    8437                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$51)
    8438                      .dwattr $C$DW$737, DW_AT_name("pidHandle_Iq")
    8439                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8440                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8441                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8442              
    8443              $C$DW$738       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$52)
    8445                      .dwattr $C$DW$738, DW_AT_name("pid_Iq")
    8446                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pid_Iq")
    8447                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  161

    8448                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8449              
    8450              $C$DW$739       .dwtag  DW_TAG_member
    8451                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$51)
    8452                      .dwattr $C$DW$739, DW_AT_name("pidHandle_spd")
    8453                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pidHandle_spd")
    8454                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8455                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8456              
    8457              $C$DW$740       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$52)
    8459                      .dwattr $C$DW$740, DW_AT_name("pid_spd")
    8460                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pid_spd")
    8461                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8462                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8463              
    8464              $C$DW$741       .dwtag  DW_TAG_member
    8465                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$54)
    8466                      .dwattr $C$DW$741, DW_AT_name("iparkHandle")
    8467                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_iparkHandle")
    8468                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8469                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8470              
    8471              $C$DW$742       .dwtag  DW_TAG_member
    8472                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$55)
    8473                      .dwattr $C$DW$742, DW_AT_name("ipark")
    8474                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ipark")
    8475                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8476                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8477              
    8478              $C$DW$743       .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$57)
    8480                      .dwattr $C$DW$743, DW_AT_name("svgenHandle")
    8481                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_svgenHandle")
    8482                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8483                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8484              
    8485              $C$DW$744       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$58)
    8487                      .dwattr $C$DW$744, DW_AT_name("svgen")
    8488                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_svgen")
    8489                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8490                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8491              
    8492              $C$DW$745       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$60)
    8494                      .dwattr $C$DW$745, DW_AT_name("trajHandle_Id")
    8495                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_trajHandle_Id")
    8496                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8497                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8498              
    8499              $C$DW$746       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$61)
    8501                      .dwattr $C$DW$746, DW_AT_name("traj_Id")
    8502                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_traj_Id")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  162

    8503                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8504                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8505              
    8506              $C$DW$747       .dwtag  DW_TAG_member
    8507                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$60)
    8508                      .dwattr $C$DW$747, DW_AT_name("trajHandle_spd")
    8509                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajHandle_spd")
    8510                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8511                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8512              
    8513              $C$DW$748       .dwtag  DW_TAG_member
    8514                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$61)
    8515                      .dwattr $C$DW$748, DW_AT_name("traj_spd")
    8516                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_traj_spd")
    8517                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8518                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8519              
    8520              $C$DW$749       .dwtag  DW_TAG_member
    8521                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$60)
    8522                      .dwattr $C$DW$749, DW_AT_name("trajHandle_spdMax")
    8523                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8524                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8525                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8526              
    8527              $C$DW$750       .dwtag  DW_TAG_member
    8528                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$61)
    8529                      .dwattr $C$DW$750, DW_AT_name("traj_spdMax")
    8530                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_traj_spdMax")
    8531                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8532                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8533              
    8534              $C$DW$751       .dwtag  DW_TAG_member
    8535                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$62)
    8536                      .dwattr $C$DW$751, DW_AT_name("motorParams")
    8537                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motorParams")
    8538                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8539                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8540              
    8541              $C$DW$752       .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$65)
    8543                      .dwattr $C$DW$752, DW_AT_name("waitTimes")
    8544                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_waitTimes")
    8545                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8546                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8547              
    8548              $C$DW$753       .dwtag  DW_TAG_member
    8549                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$64)
    8550                      .dwattr $C$DW$753, DW_AT_name("counter_state")
    8551                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_counter_state")
    8552                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8553                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8554              
    8555              $C$DW$754       .dwtag  DW_TAG_member
    8556                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$66)
    8557                      .dwattr $C$DW$754, DW_AT_name("numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  163

    8558                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8559                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8560                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8561              
    8562              $C$DW$755       .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$66)
    8564                      .dwattr $C$DW$755, DW_AT_name("numCtrlTicksPerCurrentTick")
    8565                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8566                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8567                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8568              
    8569              $C$DW$756       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$66)
    8571                      .dwattr $C$DW$756, DW_AT_name("numCtrlTicksPerSpeedTick")
    8572                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8573                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8574                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8575              
    8576              $C$DW$757       .dwtag  DW_TAG_member
    8577                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$66)
    8578                      .dwattr $C$DW$757, DW_AT_name("numCtrlTicksPerTrajTick")
    8579                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8580                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8581                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8582              
    8583              $C$DW$758       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$64)
    8585                      .dwattr $C$DW$758, DW_AT_name("ctrlFreq_Hz")
    8586                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8587                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8588                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8589              
    8590              $C$DW$759       .dwtag  DW_TAG_member
    8591                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
    8592                      .dwattr $C$DW$759, DW_AT_name("trajFreq_Hz")
    8593                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8594                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8595                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8596              
    8597              $C$DW$760       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$31)
    8599                      .dwattr $C$DW$760, DW_AT_name("trajPeriod_sec")
    8600                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8601                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8602                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8603              
    8604              $C$DW$761       .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$67)
    8606                      .dwattr $C$DW$761, DW_AT_name("ctrlPeriod_sec")
    8607                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8608                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8609                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8610              
    8611              $C$DW$762       .dwtag  DW_TAG_member
    8612                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  164

    8613                      .dwattr $C$DW$762, DW_AT_name("maxVsMag_pu")
    8614                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8615                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8616                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8617              
    8618              $C$DW$763       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$68)
    8620                      .dwattr $C$DW$763, DW_AT_name("Iab_in")
    8621                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Iab_in")
    8622                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8623                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8624              
    8625              $C$DW$764       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$68)
    8627                      .dwattr $C$DW$764, DW_AT_name("Iab_filt")
    8628                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Iab_filt")
    8629                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8630                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8631              
    8632              $C$DW$765       .dwtag  DW_TAG_member
    8633                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$68)
    8634                      .dwattr $C$DW$765, DW_AT_name("Idq_in")
    8635                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Idq_in")
    8636                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8637                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8638              
    8639              $C$DW$766       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    8641                      .dwattr $C$DW$766, DW_AT_name("Vab_in")
    8642                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Vab_in")
    8643                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8644                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8645              
    8646              $C$DW$767       .dwtag  DW_TAG_member
    8647                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$31)
    8648                      .dwattr $C$DW$767, DW_AT_name("spd_out")
    8649                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_spd_out")
    8650                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8651                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8652              
    8653              $C$DW$768       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    8655                      .dwattr $C$DW$768, DW_AT_name("Vab_out")
    8656                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Vab_out")
    8657                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8658                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8659              
    8660              $C$DW$769       .dwtag  DW_TAG_member
    8661                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    8662                      .dwattr $C$DW$769, DW_AT_name("Vdq_out")
    8663                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vdq_out")
    8664                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8665                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8666              
    8667              $C$DW$770       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  165

    8668                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$67)
    8669                      .dwattr $C$DW$770, DW_AT_name("Rhf")
    8670                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Rhf")
    8671                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8672                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8673              
    8674              $C$DW$771       .dwtag  DW_TAG_member
    8675                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$67)
    8676                      .dwattr $C$DW$771, DW_AT_name("Lhf")
    8677                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Lhf")
    8678                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8679                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8680              
    8681              $C$DW$772       .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$67)
    8683                      .dwattr $C$DW$772, DW_AT_name("RoverL")
    8684                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_RoverL")
    8685                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8686                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8687              
    8688              $C$DW$773       .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
    8690                      .dwattr $C$DW$773, DW_AT_name("Kp_Id")
    8691                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Kp_Id")
    8692                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8693                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8694              
    8695              $C$DW$774       .dwtag  DW_TAG_member
    8696                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    8697                      .dwattr $C$DW$774, DW_AT_name("Kp_Iq")
    8698                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kp_Iq")
    8699                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8700                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8701              
    8702              $C$DW$775       .dwtag  DW_TAG_member
    8703                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    8704                      .dwattr $C$DW$775, DW_AT_name("Kp_spd")
    8705                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kp_spd")
    8706                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8707                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8708              
    8709              $C$DW$776       .dwtag  DW_TAG_member
    8710                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    8711                      .dwattr $C$DW$776, DW_AT_name("Ki_Id")
    8712                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ki_Id")
    8713                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8714                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8715              
    8716              $C$DW$777       .dwtag  DW_TAG_member
    8717                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    8718                      .dwattr $C$DW$777, DW_AT_name("Ki_Iq")
    8719                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ki_Iq")
    8720                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8721                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8722              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  166

    8723              $C$DW$778       .dwtag  DW_TAG_member
    8724                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    8725                      .dwattr $C$DW$778, DW_AT_name("Ki_spd")
    8726                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ki_spd")
    8727                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8728                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8729              
    8730              $C$DW$779       .dwtag  DW_TAG_member
    8731                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    8732                      .dwattr $C$DW$779, DW_AT_name("Kd_Id")
    8733                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Kd_Id")
    8734                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8735                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8736              
    8737              $C$DW$780       .dwtag  DW_TAG_member
    8738                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    8739                      .dwattr $C$DW$780, DW_AT_name("Kd_Iq")
    8740                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kd_Iq")
    8741                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8742                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8743              
    8744              $C$DW$781       .dwtag  DW_TAG_member
    8745                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    8746                      .dwattr $C$DW$781, DW_AT_name("Kd_spd")
    8747                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kd_spd")
    8748                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8749                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8750              
    8751              $C$DW$782       .dwtag  DW_TAG_member
    8752                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    8753                      .dwattr $C$DW$782, DW_AT_name("Ui_Id")
    8754                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ui_Id")
    8755                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8756                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8757              
    8758              $C$DW$783       .dwtag  DW_TAG_member
    8759                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    8760                      .dwattr $C$DW$783, DW_AT_name("Ui_Iq")
    8761                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ui_Iq")
    8762                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8763                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8764              
    8765              $C$DW$784       .dwtag  DW_TAG_member
    8766                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    8767                      .dwattr $C$DW$784, DW_AT_name("Ui_spd")
    8768                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ui_spd")
    8769                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8770                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8771              
    8772              $C$DW$785       .dwtag  DW_TAG_member
    8773                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$68)
    8774                      .dwattr $C$DW$785, DW_AT_name("Idq_ref")
    8775                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Idq_ref")
    8776                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8777                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  167

    8778              
    8779              $C$DW$786       .dwtag  DW_TAG_member
    8780                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    8781                      .dwattr $C$DW$786, DW_AT_name("IdRated")
    8782                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_IdRated")
    8783                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8784                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8785              
    8786              $C$DW$787       .dwtag  DW_TAG_member
    8787                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    8788                      .dwattr $C$DW$787, DW_AT_name("spd_ref")
    8789                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_spd_ref")
    8790                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8791                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8792              
    8793              $C$DW$788       .dwtag  DW_TAG_member
    8794                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    8795                      .dwattr $C$DW$788, DW_AT_name("spd_max")
    8796                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_spd_max")
    8797                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8798                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8799              
    8800              $C$DW$789       .dwtag  DW_TAG_member
    8801                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$66)
    8802                      .dwattr $C$DW$789, DW_AT_name("counter_current")
    8803                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_counter_current")
    8804                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8805                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8806              
    8807              $C$DW$790       .dwtag  DW_TAG_member
    8808                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$66)
    8809                      .dwattr $C$DW$790, DW_AT_name("counter_isr")
    8810                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_counter_isr")
    8811                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8812                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8813              
    8814              $C$DW$791       .dwtag  DW_TAG_member
    8815                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$66)
    8816                      .dwattr $C$DW$791, DW_AT_name("counter_speed")
    8817                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_counter_speed")
    8818                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8819                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8820              
    8821              $C$DW$792       .dwtag  DW_TAG_member
    8822                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$66)
    8823                      .dwattr $C$DW$792, DW_AT_name("counter_traj")
    8824                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_traj")
    8825                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8826                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8827              
    8828              $C$DW$793       .dwtag  DW_TAG_member
    8829                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$69)
    8830                      .dwattr $C$DW$793, DW_AT_name("flag_enableCtrl")
    8831                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8832                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  168

    8833                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8834              
    8835              $C$DW$794       .dwtag  DW_TAG_member
    8836                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$69)
    8837                      .dwattr $C$DW$794, DW_AT_name("flag_enableDcBusComp")
    8838                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8839                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8840                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8841              
    8842              $C$DW$795       .dwtag  DW_TAG_member
    8843                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$69)
    8844                      .dwattr $C$DW$795, DW_AT_name("flag_enablePowerWarp")
    8845                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8846                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8847                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8848              
    8849              $C$DW$796       .dwtag  DW_TAG_member
    8850                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$69)
    8851                      .dwattr $C$DW$796, DW_AT_name("flag_enableOffset")
    8852                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enableOffset")
    8853                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8854                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8855              
    8856              $C$DW$797       .dwtag  DW_TAG_member
    8857                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$69)
    8858                      .dwattr $C$DW$797, DW_AT_name("flag_enableSpeedCtrl")
    8859                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8860                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8861                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8862              
    8863              $C$DW$798       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    8865                      .dwattr $C$DW$798, DW_AT_name("flag_enableUserMotorParams")
    8866                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8867                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8868                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8869              
    8870              $C$DW$799       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$68)
    8872                      .dwattr $C$DW$799, DW_AT_name("Idq_offset_pu")
    8873                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8874                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8875                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8876              
    8877              $C$DW$800       .dwtag  DW_TAG_member
    8878                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$68)
    8879                      .dwattr $C$DW$800, DW_AT_name("Vdq_offset_pu")
    8880                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8881                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8882                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8883              
    8884              $C$DW$801       .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$31)
    8886                      .dwattr $C$DW$801, DW_AT_name("angle_pu")
    8887                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_angle_pu")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  169

    8888                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8889                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8890              
    8891              $C$DW$802       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$31)
    8893                      .dwattr $C$DW$802, DW_AT_name("speed_ref_pu")
    8894                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_speed_ref_pu")
    8895                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8896                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8897              
    8898              $C$DW$803       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$31)
    8900                      .dwattr $C$DW$803, DW_AT_name("speed_fb_pu")
    8901                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_speed_fb_pu")
    8902                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8903                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8904              
    8905              $C$DW$804       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$31)
    8907                      .dwattr $C$DW$804, DW_AT_name("speed_outMax_pu")
    8908                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8909                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8910                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8911              
    8912              $C$DW$805       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$69)
    8914                      .dwattr $C$DW$805, DW_AT_name("flag_enableCurrentCtrl")
    8915                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8916                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8917                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8918              
    8919                      .dwendtag $C$DW$T$70
    8920              
    8921              $C$DW$T$185     .dwtag  DW_TAG_typedef
    8922                      .dwattr $C$DW$T$185, DW_AT_name("CTRL_Obj")
    8923                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$70)
    8924                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    8925              
    8926              $C$DW$T$171     .dwtag  DW_TAG_pointer_type
    8927                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$70)
    8928                      .dwattr $C$DW$T$171, DW_AT_address_class(0x20)
    8929              
    8930              $C$DW$T$172     .dwtag  DW_TAG_typedef
    8931                      .dwattr $C$DW$T$172, DW_AT_name("CTRL_Handle")
    8932                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    8933                      .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    8934              
    8935              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    8936                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$172)
    8937              
    8938              $C$DW$T$186     .dwtag  DW_TAG_const_type
    8939                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$806)
    8940              
    8941              
    8942              $C$DW$T$73      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  170

    8943                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    8944                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    8945              $C$DW$807       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$22)
    8947                      .dwattr $C$DW$807, DW_AT_name("rsvd")
    8948                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd")
    8949                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8950                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$808       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$72)
    8954                      .dwattr $C$DW$808, DW_AT_name("targetProc")
    8955                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_targetProc")
    8956                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8957                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$809       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
    8961                      .dwattr $C$DW$809, DW_AT_name("major")
    8962                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_major")
    8963                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8964                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    8965              
    8966              $C$DW$810       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    8968                      .dwattr $C$DW$810, DW_AT_name("minor")
    8969                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_minor")
    8970                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8971                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8972              
    8973                      .dwendtag $C$DW$T$73
    8974              
    8975              $C$DW$T$37      .dwtag  DW_TAG_typedef
    8976                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    8977                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    8978                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    8979              
    8980              
    8981              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8982                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    8983                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    8984              $C$DW$811       .dwtag  DW_TAG_member
    8985                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$75)
    8986                      .dwattr $C$DW$811, DW_AT_name("spiHandle")
    8987                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_spiHandle")
    8988                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8989                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8990              
    8991              $C$DW$812       .dwtag  DW_TAG_member
    8992                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$77)
    8993                      .dwattr $C$DW$812, DW_AT_name("gpioHandle")
    8994                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_gpioHandle")
    8995                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8996                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8997              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  171

    8998              $C$DW$813       .dwtag  DW_TAG_member
    8999                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$79)
    9000                      .dwattr $C$DW$813, DW_AT_name("gpioNumber")
    9001                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_gpioNumber")
    9002                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9003                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9004              
    9005              $C$DW$814       .dwtag  DW_TAG_member
    9006                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$69)
    9007                      .dwattr $C$DW$814, DW_AT_name("RxTimeOut")
    9008                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_RxTimeOut")
    9009                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9010                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9011              
    9012              $C$DW$815       .dwtag  DW_TAG_member
    9013                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$69)
    9014                      .dwattr $C$DW$815, DW_AT_name("enableTimeOut")
    9015                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_enableTimeOut")
    9016                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9017                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9018              
    9019                      .dwendtag $C$DW$T$80
    9020              
    9021              $C$DW$T$122     .dwtag  DW_TAG_typedef
    9022                      .dwattr $C$DW$T$122, DW_AT_name("DRV8301_Obj")
    9023                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    9024                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    9025              
    9026              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    9027                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    9028                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    9029              
    9030              $C$DW$T$121     .dwtag  DW_TAG_typedef
    9031                      .dwattr $C$DW$T$121, DW_AT_name("DRV8301_Handle")
    9032                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    9033                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    9034              
    9035              
    9036              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9037                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9038                      .dwattr $C$DW$T$19, DW_AT_declaration
    9039                      .dwendtag $C$DW$T$19
    9040              
    9041              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    9042                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    9043                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    9044              
    9045              $C$DW$T$46      .dwtag  DW_TAG_typedef
    9046                      .dwattr $C$DW$T$46, DW_AT_name("EST_Handle")
    9047                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    9048                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    9049              
    9050              
    9051              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    9052                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  172

    9053                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    9054              $C$DW$816       .dwtag  DW_TAG_member
    9055                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$31)
    9056                      .dwattr $C$DW$816, DW_AT_name("a1")
    9057                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_a1")
    9058                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9059                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9060              
    9061              $C$DW$817       .dwtag  DW_TAG_member
    9062                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$31)
    9063                      .dwattr $C$DW$817, DW_AT_name("b0")
    9064                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_b0")
    9065                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9066                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9067              
    9068              $C$DW$818       .dwtag  DW_TAG_member
    9069                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    9070                      .dwattr $C$DW$818, DW_AT_name("b1")
    9071                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_b1")
    9072                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9073                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9074              
    9075              $C$DW$819       .dwtag  DW_TAG_member
    9076                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    9077                      .dwattr $C$DW$819, DW_AT_name("x1")
    9078                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_x1")
    9079                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9080                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9081              
    9082              $C$DW$820       .dwtag  DW_TAG_member
    9083                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$31)
    9084                      .dwattr $C$DW$820, DW_AT_name("y1")
    9085                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_y1")
    9086                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9087                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9088              
    9089                      .dwendtag $C$DW$T$81
    9090              
    9091              $C$DW$T$136     .dwtag  DW_TAG_typedef
    9092                      .dwattr $C$DW$T$136, DW_AT_name("FILTER_FO_Obj")
    9093                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$81)
    9094                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    9095              
    9096              $C$DW$T$188     .dwtag  DW_TAG_pointer_type
    9097                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$136)
    9098                      .dwattr $C$DW$T$188, DW_AT_address_class(0x20)
    9099              
    9100              
    9101              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9102                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9103                      .dwattr $C$DW$T$20, DW_AT_declaration
    9104                      .dwendtag $C$DW$T$20
    9105              
    9106              $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    9107                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  173

    9108                      .dwattr $C$DW$T$137, DW_AT_address_class(0x20)
    9109              
    9110              $C$DW$T$138     .dwtag  DW_TAG_typedef
    9111                      .dwattr $C$DW$T$138, DW_AT_name("FILTER_FO_Handle")
    9112                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    9113                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    9114              
    9115              
    9116              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    9117                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    9118                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    9119              $C$DW$821       .dwtag  DW_TAG_member
    9120                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$23)
    9121                      .dwattr $C$DW$821, DW_AT_name("FOPT")
    9122                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_FOPT")
    9123                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9124                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9125              
    9126              $C$DW$822       .dwtag  DW_TAG_member
    9127                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$23)
    9128                      .dwattr $C$DW$822, DW_AT_name("rsvd_1")
    9129                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd_1")
    9130                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9131                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9132              
    9133              $C$DW$823       .dwtag  DW_TAG_member
    9134                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$23)
    9135                      .dwattr $C$DW$823, DW_AT_name("FPWR")
    9136                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_FPWR")
    9137                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9138                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9139              
    9140              $C$DW$824       .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$23)
    9142                      .dwattr $C$DW$824, DW_AT_name("FSTATUS")
    9143                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_FSTATUS")
    9144                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9145                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9146              
    9147              $C$DW$825       .dwtag  DW_TAG_member
    9148                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$23)
    9149                      .dwattr $C$DW$825, DW_AT_name("FSTDBYWAIT")
    9150                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9151                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9152                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9153              
    9154              $C$DW$826       .dwtag  DW_TAG_member
    9155                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$23)
    9156                      .dwattr $C$DW$826, DW_AT_name("FACTIVEWAIT")
    9157                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9158                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9159                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9160              
    9161              $C$DW$827       .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  174

    9163                      .dwattr $C$DW$827, DW_AT_name("FBANKWAIT")
    9164                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FBANKWAIT")
    9165                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9166                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9167              
    9168              $C$DW$828       .dwtag  DW_TAG_member
    9169                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$23)
    9170                      .dwattr $C$DW$828, DW_AT_name("FOTPWAIT")
    9171                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FOTPWAIT")
    9172                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9173                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9174              
    9175                      .dwendtag $C$DW$T$82
    9176              
    9177              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    9178                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    9179                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    9180              
    9181              $C$DW$T$96      .dwtag  DW_TAG_typedef
    9182                      .dwattr $C$DW$T$96, DW_AT_name("FLASH_Handle")
    9183                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    9184                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9185              
    9186              
    9187              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9188                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    9189                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    9190              $C$DW$829       .dwtag  DW_TAG_member
    9191                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$83)
    9192                      .dwattr $C$DW$829, DW_AT_name("GPACTRL")
    9193                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_GPACTRL")
    9194                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9195                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9196              
    9197              $C$DW$830       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$83)
    9199                      .dwattr $C$DW$830, DW_AT_name("GPAQSEL1")
    9200                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_GPAQSEL1")
    9201                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9202                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9203              
    9204              $C$DW$831       .dwtag  DW_TAG_member
    9205                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$83)
    9206                      .dwattr $C$DW$831, DW_AT_name("GPAQSEL2")
    9207                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_GPAQSEL2")
    9208                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9209                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9210              
    9211              $C$DW$832       .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$83)
    9213                      .dwattr $C$DW$832, DW_AT_name("GPAMUX1")
    9214                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPAMUX1")
    9215                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9216                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9217              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4644010                          PAGE  175

    9218              $C$DW$833       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$83)
    9220                      .dwattr $C$DW$833, DW_AT_name("GPAMUX2")
    9221                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPAMUX2")
    9222                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9223                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9224              
    9225              $C$DW$834       .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$83)
    9227                      .dwattr $C$DW$834, DW_AT_name("GPADIR")
    9228                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_GPADIR")
