TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:20 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../modules/source/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setMode")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setMode")

   13477                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   13478              
   13479              $C$DW$1777      .dwtag  DW_TAG_TI_far_type
   13480                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$335)
   13481              
   13482              $C$DW$T$336     .dwtag  DW_TAG_const_type
   13483                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$1777)
   13484              
   13485              
   13486              $C$DW$T$337     .dwtag  DW_TAG_enumeration_type
   13487                      .dwattr $C$DW$T$337, DW_AT_byte_size(0x01)
   13488              $C$DW$1778      .dwtag  DW_TAG_enumerator
   13489                      .dwattr $C$DW$1778, DW_AT_name("SCI_NumStopBits_One")
   13490                      .dwattr $C$DW$1778, DW_AT_const_value(0x00)
   13491              
   13492              $C$DW$1779      .dwtag  DW_TAG_enumerator
   13493                      .dwattr $C$DW$1779, DW_AT_name("SCI_NumStopBits_Two")
   13494                      .dwattr $C$DW$1779, DW_AT_const_value(0x80)
   13495              
   13496                      .dwendtag $C$DW$T$337
   13497              
   13498              $C$DW$T$338     .dwtag  DW_TAG_typedef
   13499                      .dwattr $C$DW$T$338, DW_AT_name("SCI_NumStopBits_e")
   13500                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$337)
   13501                      .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   13502              
   13503              $C$DW$1780      .dwtag  DW_TAG_TI_far_type
   13504                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$338)
   13505              
   13506              $C$DW$T$339     .dwtag  DW_TAG_const_type
   13507                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$1780)
   13508              
   13509              
   13510              $C$DW$T$340     .dwtag  DW_TAG_enumeration_type
   13511                      .dwattr $C$DW$T$340, DW_AT_byte_size(0x01)
   13512              $C$DW$1781      .dwtag  DW_TAG_enumerator
   13513                      .dwattr $C$DW$1781, DW_AT_name("SCI_FifoLevel_Empty")
   13514                      .dwattr $C$DW$1781, DW_AT_const_value(0x00)
   13515              
   13516              $C$DW$1782      .dwtag  DW_TAG_enumerator
   13517                      .dwattr $C$DW$1782, DW_AT_name("SCI_FifoLevel_1_Word")
   13518                      .dwattr $C$DW$1782, DW_AT_const_value(0x01)
   13519              
   13520              $C$DW$1783      .dwtag  DW_TAG_enumerator
   13521                      .dwattr $C$DW$1783, DW_AT_name("SCI_FifoLevel_2_Words")
   13522                      .dwattr $C$DW$1783, DW_AT_const_value(0x02)
   13523              
   13524              $C$DW$1784      .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  256

   13525                      .dwattr $C$DW$1784, DW_AT_name("SCI_FifoLevel_3_Words")
   13526                      .dwattr $C$DW$1784, DW_AT_const_value(0x03)
   13527              
   13528              $C$DW$1785      .dwtag  DW_TAG_enumerator
   13529                      .dwattr $C$DW$1785, DW_AT_name("SCI_FifoLevel_4_Words")
   13530                      .dwattr $C$DW$1785, DW_AT_const_value(0x04)
   13531              
   13532                      .dwendtag $C$DW$T$340
   13533              
   13534              $C$DW$T$341     .dwtag  DW_TAG_typedef
   13535                      .dwattr $C$DW$T$341, DW_AT_name("SCI_FifoLevel_e")
   13536                      .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$340)
   13537                      .dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
   13538              
   13539              $C$DW$1786      .dwtag  DW_TAG_TI_far_type
   13540                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$341)
   13541              
   13542              $C$DW$T$342     .dwtag  DW_TAG_const_type
   13543                      .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$1786)
   13544              
   13545              
   13546              $C$DW$T$343     .dwtag  DW_TAG_enumeration_type
   13547                      .dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
   13548              $C$DW$1787      .dwtag  DW_TAG_enumerator
   13549                      .dwattr $C$DW$1787, DW_AT_name("HAL_SensorType_Current")
   13550                      .dwattr $C$DW$1787, DW_AT_const_value(0x00)
   13551              
   13552              $C$DW$1788      .dwtag  DW_TAG_enumerator
   13553                      .dwattr $C$DW$1788, DW_AT_name("HAL_SensorType_Voltage")
   13554                      .dwattr $C$DW$1788, DW_AT_const_value(0x01)
   13555              
   13556              $C$DW$1789      .dwtag  DW_TAG_enumerator
   13557                      .dwattr $C$DW$1789, DW_AT_name("HAL_SensorType_BusCurrent")
   13558                      .dwattr $C$DW$1789, DW_AT_const_value(0x02)
   13559              
   13560                      .dwendtag $C$DW$T$343
   13561              
   13562              $C$DW$T$344     .dwtag  DW_TAG_typedef
   13563                      .dwattr $C$DW$T$344, DW_AT_name("HAL_SensorType_e")
   13564                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
   13565                      .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   13566              
   13567              
   13568              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13569                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13570                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13571              $C$DW$1790      .dwtag  DW_TAG_member
   13572                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$23)
   13573                      .dwattr $C$DW$1790, DW_AT_name("ADCRESULT")
   13574                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_ADCRESULT")
   13575                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13576                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13577              
   13578              $C$DW$1791      .dwtag  DW_TAG_member
   13579                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  257

   13580                      .dwattr $C$DW$1791, DW_AT_name("resvd_1")
   13581                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_resvd_1")
   13582                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13583                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13584              
   13585              $C$DW$1792      .dwtag  DW_TAG_member
   13586                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$22)
   13587                      .dwattr $C$DW$1792, DW_AT_name("ADCCTL1")
   13588                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_ADCCTL1")
   13589                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13590                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13591              
   13592              $C$DW$1793      .dwtag  DW_TAG_member
   13593                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$22)
   13594                      .dwattr $C$DW$1793, DW_AT_name("ADCCTL2")
   13595                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ADCCTL2")
   13596                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13597                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13598              
   13599              $C$DW$1794      .dwtag  DW_TAG_member
   13600                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$25)
   13601                      .dwattr $C$DW$1794, DW_AT_name("rsvd_2")
   13602                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_rsvd_2")
   13603                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13604                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13605              
   13606              $C$DW$1795      .dwtag  DW_TAG_member
   13607                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$22)
   13608                      .dwattr $C$DW$1795, DW_AT_name("ADCINTFLG")
   13609                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_ADCINTFLG")
   13610                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13611                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13612              
   13613              $C$DW$1796      .dwtag  DW_TAG_member
   13614                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$22)
   13615                      .dwattr $C$DW$1796, DW_AT_name("ADCINTFLGCLR")
   13616                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13617                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13618                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13619              
   13620              $C$DW$1797      .dwtag  DW_TAG_member
   13621                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$22)
   13622                      .dwattr $C$DW$1797, DW_AT_name("ADCINTOVF")
   13623                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_ADCINTOVF")
   13624                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13625                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13626              
   13627              $C$DW$1798      .dwtag  DW_TAG_member
   13628                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$22)
   13629                      .dwattr $C$DW$1798, DW_AT_name("ADCINTOVFCLR")
   13630                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13631                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13632                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13633              
   13634              $C$DW$1799      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  258

   13635                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$26)
   13636                      .dwattr $C$DW$1799, DW_AT_name("INTSELxNy")
   13637                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_INTSELxNy")
   13638                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13639                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13640              
   13641              $C$DW$1800      .dwtag  DW_TAG_member
   13642                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$27)
   13643                      .dwattr $C$DW$1800, DW_AT_name("rsvd_3")
   13644                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_rsvd_3")
   13645                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13646                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13647              
   13648              $C$DW$1801      .dwtag  DW_TAG_member
   13649                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$22)
   13650                      .dwattr $C$DW$1801, DW_AT_name("SOCPRICTRL")
   13651                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13652                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13653                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13654              
   13655              $C$DW$1802      .dwtag  DW_TAG_member
   13656                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$22)
   13657                      .dwattr $C$DW$1802, DW_AT_name("rsvd_4")
   13658                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_rsvd_4")
   13659                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13660                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13661              
   13662              $C$DW$1803      .dwtag  DW_TAG_member
   13663                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$22)
   13664                      .dwattr $C$DW$1803, DW_AT_name("ADCSAMPLEMODE")
   13665                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13666                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13667                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13668              
   13669              $C$DW$1804      .dwtag  DW_TAG_member
   13670                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$22)
   13671                      .dwattr $C$DW$1804, DW_AT_name("rsvd_5")
   13672                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_rsvd_5")
   13673                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13674                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13675              
   13676              $C$DW$1805      .dwtag  DW_TAG_member
   13677                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$22)
   13678                      .dwattr $C$DW$1805, DW_AT_name("ADCINTSOCSEL1")
   13679                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13680                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13681                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13682              
   13683              $C$DW$1806      .dwtag  DW_TAG_member
   13684                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$22)
   13685                      .dwattr $C$DW$1806, DW_AT_name("ADCINTSOCSEL2")
   13686                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13687                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13688                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13689              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  259

   13690              $C$DW$1807      .dwtag  DW_TAG_member
   13691                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$25)
   13692                      .dwattr $C$DW$1807, DW_AT_name("rsvd_6")
   13693                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_rsvd_6")
   13694                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13695                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13696              
   13697              $C$DW$1808      .dwtag  DW_TAG_member
   13698                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$22)
   13699                      .dwattr $C$DW$1808, DW_AT_name("ADCSOCFLG1")
   13700                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13701                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13702                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13703              
   13704              $C$DW$1809      .dwtag  DW_TAG_member
   13705                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$22)
   13706                      .dwattr $C$DW$1809, DW_AT_name("rsvd_7")
   13707                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_rsvd_7")
   13708                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13709                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13710              
   13711              $C$DW$1810      .dwtag  DW_TAG_member
   13712                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$22)
   13713                      .dwattr $C$DW$1810, DW_AT_name("ADCSOCFRC1")
   13714                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13715                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13716                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13717              
   13718              $C$DW$1811      .dwtag  DW_TAG_member
   13719                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$22)
   13720                      .dwattr $C$DW$1811, DW_AT_name("rsvd_8")
   13721                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_rsvd_8")
   13722                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13723                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13724              
   13725              $C$DW$1812      .dwtag  DW_TAG_member
   13726                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$22)
   13727                      .dwattr $C$DW$1812, DW_AT_name("ADCSOCOVF1")
   13728                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13729                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13730                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13731              
   13732              $C$DW$1813      .dwtag  DW_TAG_member
   13733                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$22)
   13734                      .dwattr $C$DW$1813, DW_AT_name("rsvd_9")
   13735                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_rsvd_9")
   13736                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13737                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13738              
   13739              $C$DW$1814      .dwtag  DW_TAG_member
   13740                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$22)
   13741                      .dwattr $C$DW$1814, DW_AT_name("ADCSOCOVFCLR1")
   13742                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13743                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13744                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  260

   13745              
   13746              $C$DW$1815      .dwtag  DW_TAG_member
   13747                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$22)
   13748                      .dwattr $C$DW$1815, DW_AT_name("rsvd_10")
   13749                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_rsvd_10")
   13750                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13751                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13752              
   13753              $C$DW$1816      .dwtag  DW_TAG_member
   13754                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$23)
   13755                      .dwattr $C$DW$1816, DW_AT_name("ADCSOCxCTL")
   13756                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13757                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13758                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13759              
   13760              $C$DW$1817      .dwtag  DW_TAG_member
   13761                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$23)
   13762                      .dwattr $C$DW$1817, DW_AT_name("rsvd_11")
   13763                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_rsvd_11")
   13764                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13765                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13766              
   13767              $C$DW$1818      .dwtag  DW_TAG_member
   13768                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$22)
   13769                      .dwattr $C$DW$1818, DW_AT_name("ADCREFTRIM")
   13770                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13771                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13772                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13773              
   13774              $C$DW$1819      .dwtag  DW_TAG_member
   13775                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$22)
   13776                      .dwattr $C$DW$1819, DW_AT_name("ADCOFFTRIM")
   13777                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13778                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13779                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   13780              
   13781              $C$DW$1820      .dwtag  DW_TAG_member
   13782                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$28)
   13783                      .dwattr $C$DW$1820, DW_AT_name("resvd_12")
   13784                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_resvd_12")
   13785                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13786                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13787              
   13788              $C$DW$1821      .dwtag  DW_TAG_member
   13789                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$22)
   13790                      .dwattr $C$DW$1821, DW_AT_name("ADCREV")
   13791                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_ADCREV")
   13792                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13793                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13794              
   13795                      .dwendtag $C$DW$T$29
   13796              
   13797              $C$DW$T$346     .dwtag  DW_TAG_typedef
   13798                      .dwattr $C$DW$T$346, DW_AT_name("ADC_Obj")
   13799                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  261

   13800                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   13801              
   13802              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   13803                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
   13804                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   13805              
   13806              $C$DW$T$80      .dwtag  DW_TAG_typedef
   13807                      .dwattr $C$DW$T$80, DW_AT_name("ADC_Handle")
   13808                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   13809                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   13810              
   13811              
   13812              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13813                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13814                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13815              $C$DW$1822      .dwtag  DW_TAG_member
   13816                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$22)
   13817                      .dwattr $C$DW$1822, DW_AT_name("XCLK")
   13818                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_XCLK")
   13819                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13820                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13821              
   13822              $C$DW$1823      .dwtag  DW_TAG_member
   13823                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$22)
   13824                      .dwattr $C$DW$1823, DW_AT_name("rsvd_1")
   13825                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_rsvd_1")
   13826                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13827                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13828              
   13829              $C$DW$1824      .dwtag  DW_TAG_member
   13830                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$22)
   13831                      .dwattr $C$DW$1824, DW_AT_name("CLKCTL")
   13832                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_CLKCTL")
   13833                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13834                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13835              
   13836              $C$DW$1825      .dwtag  DW_TAG_member
   13837                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$30)
   13838                      .dwattr $C$DW$1825, DW_AT_name("rsvd_2")
   13839                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_rsvd_2")
   13840                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13841                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13842              
   13843              $C$DW$1826      .dwtag  DW_TAG_member
   13844                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$22)
   13845                      .dwattr $C$DW$1826, DW_AT_name("LOSPCP")
   13846                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_LOSPCP")
   13847                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13848                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13849              
   13850              $C$DW$1827      .dwtag  DW_TAG_member
   13851                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$22)
   13852                      .dwattr $C$DW$1827, DW_AT_name("PCLKCR0")
   13853                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_PCLKCR0")
   13854                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  262

   13855                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13856              
   13857              $C$DW$1828      .dwtag  DW_TAG_member
   13858                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$22)
   13859                      .dwattr $C$DW$1828, DW_AT_name("PCLKCR1")
   13860                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_PCLKCR1")
   13861                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13862                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13863              
   13864              $C$DW$1829      .dwtag  DW_TAG_member
   13865                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$25)
   13866                      .dwattr $C$DW$1829, DW_AT_name("rsvd_3")
   13867                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_3")
   13868                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13869                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13870              
   13871              $C$DW$1830      .dwtag  DW_TAG_member
   13872                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$22)
   13873                      .dwattr $C$DW$1830, DW_AT_name("PCLKCR3")
   13874                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_PCLKCR3")
   13875                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13876                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13877              
   13878                      .dwendtag $C$DW$T$31
   13879              
   13880              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   13881                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
   13882                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   13883              
   13884              $C$DW$T$82      .dwtag  DW_TAG_typedef
   13885                      .dwattr $C$DW$T$82, DW_AT_name("CLK_Handle")
   13886                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   13887                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   13888              
   13889              
   13890              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13891                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13892                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13893              $C$DW$1831      .dwtag  DW_TAG_member
   13894                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$32)
   13895                      .dwattr $C$DW$1831, DW_AT_name("tmp")
   13896                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_tmp")
   13897                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13898                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13899              
   13900                      .dwendtag $C$DW$T$33
   13901              
   13902              $C$DW$T$355     .dwtag  DW_TAG_typedef
   13903                      .dwattr $C$DW$T$355, DW_AT_name("CPU_Obj")
   13904                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$33)
   13905                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   13906              
   13907              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   13908                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
   13909                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  263

   13910              
   13911              $C$DW$T$84      .dwtag  DW_TAG_typedef
   13912                      .dwattr $C$DW$T$84, DW_AT_name("CPU_Handle")
   13913                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   13914                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   13915              
   13916              
   13917              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13918                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   13919                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13920              $C$DW$1832      .dwtag  DW_TAG_member
   13921                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$35)
   13922                      .dwattr $C$DW$1832, DW_AT_name("spiHandle")
   13923                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_spiHandle")
   13924                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13925                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13926              
   13927              $C$DW$1833      .dwtag  DW_TAG_member
   13928                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$37)
   13929                      .dwattr $C$DW$1833, DW_AT_name("gpioHandle")
   13930                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_gpioHandle")
   13931                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13932                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13933              
   13934              $C$DW$1834      .dwtag  DW_TAG_member
   13935                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$39)
   13936                      .dwattr $C$DW$1834, DW_AT_name("gpioNumber")
   13937                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_gpioNumber")
   13938                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13939                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13940              
   13941              $C$DW$1835      .dwtag  DW_TAG_member
   13942                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$40)
   13943                      .dwattr $C$DW$1835, DW_AT_name("RxTimeOut")
   13944                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_RxTimeOut")
   13945                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13946                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13947              
   13948              $C$DW$1836      .dwtag  DW_TAG_member
   13949                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$40)
   13950                      .dwattr $C$DW$1836, DW_AT_name("enableTimeOut")
   13951                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_enableTimeOut")
   13952                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13953                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13954              
   13955                      .dwendtag $C$DW$T$41
   13956              
   13957              $C$DW$T$112     .dwtag  DW_TAG_typedef
   13958                      .dwattr $C$DW$T$112, DW_AT_name("DRV8301_Obj")
   13959                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
   13960                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   13961              
   13962              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
   13963                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$41)
   13964                      .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  264

   13965              
   13966              $C$DW$T$111     .dwtag  DW_TAG_typedef
   13967                      .dwattr $C$DW$T$111, DW_AT_name("DRV8301_Handle")
   13968                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   13969                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
   13970              
   13971              
   13972              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   13973                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   13974                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   13975              $C$DW$1837      .dwtag  DW_TAG_member
   13976                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$43)
   13977                      .dwattr $C$DW$1837, DW_AT_name("DRV8301_CURRENT")
   13978                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   13979                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13980                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13981              
   13982              $C$DW$1838      .dwtag  DW_TAG_member
   13983                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$45)
   13984                      .dwattr $C$DW$1838, DW_AT_name("DRV8301_RESET")
   13985                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_DRV8301_RESET")
   13986                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13987                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13988              
   13989              $C$DW$1839      .dwtag  DW_TAG_member
   13990                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$47)
   13991                      .dwattr $C$DW$1839, DW_AT_name("PWM_MODE")
   13992                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_PWM_MODE")
   13993                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13994                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13995              
   13996              $C$DW$1840      .dwtag  DW_TAG_member
   13997                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$49)
   13998                      .dwattr $C$DW$1840, DW_AT_name("OC_MODE")
   13999                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_OC_MODE")
   14000                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14001                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   14002              
   14003              $C$DW$1841      .dwtag  DW_TAG_member
   14004                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$51)
   14005                      .dwattr $C$DW$1841, DW_AT_name("OC_ADJ_SET")
   14006                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   14007                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14008                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   14009              
   14010                      .dwendtag $C$DW$T$52
   14011              
   14012              $C$DW$T$66      .dwtag  DW_TAG_typedef
   14013                      .dwattr $C$DW$T$66, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   14014                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   14015                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   14016              
   14017              
   14018              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   14019                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  265

   14020                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   14021              $C$DW$1842      .dwtag  DW_TAG_member
   14022                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$54)
   14023                      .dwattr $C$DW$1842, DW_AT_name("OCTW_SET")
   14024                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_OCTW_SET")
   14025                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14026                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   14027              
   14028              $C$DW$1843      .dwtag  DW_TAG_member
   14029                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$56)
   14030                      .dwattr $C$DW$1843, DW_AT_name("GAIN")
   14031                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_GAIN")
   14032                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14033                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   14034              
   14035              $C$DW$1844      .dwtag  DW_TAG_member
   14036                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$58)
   14037                      .dwattr $C$DW$1844, DW_AT_name("DC_CAL_CH1p2")
   14038                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   14039                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14040                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   14041              
   14042              $C$DW$1845      .dwtag  DW_TAG_member
   14043                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$60)
   14044                      .dwattr $C$DW$1845, DW_AT_name("OC_TOFF")
   14045                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_OC_TOFF")
   14046                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14047                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   14048              
   14049                      .dwendtag $C$DW$T$61
   14050              
   14051              $C$DW$T$67      .dwtag  DW_TAG_typedef
   14052                      .dwattr $C$DW$T$67, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   14053                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   14054                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   14055              
   14056              
   14057              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   14058                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   14059                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   14060              $C$DW$1846      .dwtag  DW_TAG_member
   14061                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$40)
   14062                      .dwattr $C$DW$1846, DW_AT_name("FAULT")
   14063                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_FAULT")
   14064                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14065                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   14066              
   14067              $C$DW$1847      .dwtag  DW_TAG_member
   14068                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$40)
   14069                      .dwattr $C$DW$1847, DW_AT_name("GVDD_UV")
   14070                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_GVDD_UV")
   14071                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14072                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   14073              
   14074              $C$DW$1848      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  266

   14075                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$40)
   14076                      .dwattr $C$DW$1848, DW_AT_name("PVDD_UV")
   14077                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_PVDD_UV")
   14078                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14079                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   14080              
   14081              $C$DW$1849      .dwtag  DW_TAG_member
   14082                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$40)
   14083                      .dwattr $C$DW$1849, DW_AT_name("OTSD")
   14084                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_OTSD")
   14085                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14086                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   14087              
   14088              $C$DW$1850      .dwtag  DW_TAG_member
   14089                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$40)
   14090                      .dwattr $C$DW$1850, DW_AT_name("OTW")
   14091                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_OTW")
   14092                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14093                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   14094              
   14095              $C$DW$1851      .dwtag  DW_TAG_member
   14096                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$40)
   14097                      .dwattr $C$DW$1851, DW_AT_name("FETHA_OC")
   14098                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_FETHA_OC")
   14099                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14100                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   14101              
   14102              $C$DW$1852      .dwtag  DW_TAG_member
   14103                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$40)
   14104                      .dwattr $C$DW$1852, DW_AT_name("FETLA_OC")
   14105                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_FETLA_OC")
   14106                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14107                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   14108              
   14109              $C$DW$1853      .dwtag  DW_TAG_member
   14110                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$40)
   14111                      .dwattr $C$DW$1853, DW_AT_name("FETHB_OC")
   14112                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_FETHB_OC")
   14113                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14114                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   14115              
   14116              $C$DW$1854      .dwtag  DW_TAG_member
   14117                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$40)
   14118                      .dwattr $C$DW$1854, DW_AT_name("FETLB_OC")
   14119                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_FETLB_OC")
   14120                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14121                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   14122              
   14123              $C$DW$1855      .dwtag  DW_TAG_member
   14124                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$40)
   14125                      .dwattr $C$DW$1855, DW_AT_name("FETHC_OC")
   14126                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_FETHC_OC")
   14127                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14128                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   14129              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  267

   14130              $C$DW$1856      .dwtag  DW_TAG_member
   14131                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$40)
   14132                      .dwattr $C$DW$1856, DW_AT_name("FETLC_OC")
   14133                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_FETLC_OC")
   14134                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14135                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   14136              
   14137                      .dwendtag $C$DW$T$62
   14138              
   14139              $C$DW$T$64      .dwtag  DW_TAG_typedef
   14140                      .dwattr $C$DW$T$64, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   14141                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   14142                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   14143              
   14144              
   14145              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   14146                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   14147                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   14148              $C$DW$1857      .dwtag  DW_TAG_member
   14149                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$40)
   14150                      .dwattr $C$DW$1857, DW_AT_name("GVDD_OV")
   14151                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_GVDD_OV")
   14152                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14153                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   14154              
   14155              $C$DW$1858      .dwtag  DW_TAG_member
   14156                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$21)
   14157                      .dwattr $C$DW$1858, DW_AT_name("DeviceID")
   14158                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_DeviceID")
   14159                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14160                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   14161              
   14162                      .dwendtag $C$DW$T$63
   14163              
   14164              $C$DW$T$65      .dwtag  DW_TAG_typedef
   14165                      .dwattr $C$DW$T$65, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   14166                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   14167                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   14168              
   14169              
   14170              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   14171                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   14172                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   14173              $C$DW$1859      .dwtag  DW_TAG_member
   14174                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$64)
   14175                      .dwattr $C$DW$1859, DW_AT_name("Stat_Reg_1")
   14176                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_Stat_Reg_1")
   14177                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14178                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   14179              
   14180              $C$DW$1860      .dwtag  DW_TAG_member
   14181                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$65)
   14182                      .dwattr $C$DW$1860, DW_AT_name("Stat_Reg_2")
   14183                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_Stat_Reg_2")
   14184                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  268

   14185                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   14186              
   14187              $C$DW$1861      .dwtag  DW_TAG_member
   14188                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$66)
   14189                      .dwattr $C$DW$1861, DW_AT_name("Ctrl_Reg_1")
   14190                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   14191                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   14192                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14193              
   14194              $C$DW$1862      .dwtag  DW_TAG_member
   14195                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$67)
   14196                      .dwattr $C$DW$1862, DW_AT_name("Ctrl_Reg_2")
   14197                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   14198                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14199                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14200              
   14201              $C$DW$1863      .dwtag  DW_TAG_member
   14202                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$40)
   14203                      .dwattr $C$DW$1863, DW_AT_name("SndCmd")
   14204                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_SndCmd")
   14205                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14206                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14207              
   14208              $C$DW$1864      .dwtag  DW_TAG_member
   14209                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$40)
   14210                      .dwattr $C$DW$1864, DW_AT_name("RcvCmd")
   14211                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_RcvCmd")
   14212                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   14213                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14214              
   14215                      .dwendtag $C$DW$T$68
   14216              
   14217              $C$DW$T$362     .dwtag  DW_TAG_typedef
   14218                      .dwattr $C$DW$T$362, DW_AT_name("DRV_SPI_8301_Vars_t")
   14219                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$68)
   14220                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   14221              
   14222              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   14223                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   14224                      .dwattr $C$DW$T$363, DW_AT_address_class(0x20)
   14225              
   14226              
   14227              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   14228                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   14229                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   14230              $C$DW$1865      .dwtag  DW_TAG_member
   14231                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$69)
   14232                      .dwattr $C$DW$1865, DW_AT_name("a1")
   14233                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_a1")
   14234                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14235                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14236              
   14237              $C$DW$1866      .dwtag  DW_TAG_member
   14238                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$69)
   14239                      .dwattr $C$DW$1866, DW_AT_name("b0")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  269

   14240                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_b0")
   14241                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14242                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14243              
   14244              $C$DW$1867      .dwtag  DW_TAG_member
   14245                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$69)
   14246                      .dwattr $C$DW$1867, DW_AT_name("b1")
   14247                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_b1")
   14248                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14249                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14250              
   14251              $C$DW$1868      .dwtag  DW_TAG_member
   14252                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$69)
   14253                      .dwattr $C$DW$1868, DW_AT_name("x1")
   14254                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_x1")
   14255                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14256                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14257              
   14258              $C$DW$1869      .dwtag  DW_TAG_member
   14259                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$69)
   14260                      .dwattr $C$DW$1869, DW_AT_name("y1")
   14261                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_y1")
   14262                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14263                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14264              
   14265                      .dwendtag $C$DW$T$70
   14266              
   14267              $C$DW$T$119     .dwtag  DW_TAG_typedef
   14268                      .dwattr $C$DW$T$119, DW_AT_name("FILTER_FO_Obj")
   14269                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$70)
   14270                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
   14271              
   14272              
   14273              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   14274                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   14275                      .dwattr $C$DW$T$19, DW_AT_declaration
   14276                      .dwendtag $C$DW$T$19
   14277              
   14278              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
   14279                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$19)
   14280                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
   14281              
   14282              $C$DW$T$121     .dwtag  DW_TAG_typedef
   14283                      .dwattr $C$DW$T$121, DW_AT_name("FILTER_FO_Handle")
   14284                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
   14285                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   14286              
   14287              
   14288              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   14289                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   14290                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   14291              $C$DW$1870      .dwtag  DW_TAG_member
   14292                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$22)
   14293                      .dwattr $C$DW$1870, DW_AT_name("FOPT")
   14294                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_FOPT")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  270

   14295                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14296                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14297              
   14298              $C$DW$1871      .dwtag  DW_TAG_member
   14299                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$22)
   14300                      .dwattr $C$DW$1871, DW_AT_name("rsvd_1")
   14301                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_rsvd_1")
   14302                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14303                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14304              
   14305              $C$DW$1872      .dwtag  DW_TAG_member
   14306                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$22)
   14307                      .dwattr $C$DW$1872, DW_AT_name("FPWR")
   14308                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_FPWR")
   14309                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14310                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14311              
   14312              $C$DW$1873      .dwtag  DW_TAG_member
   14313                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$22)
   14314                      .dwattr $C$DW$1873, DW_AT_name("FSTATUS")
   14315                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_FSTATUS")
   14316                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14317                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14318              
   14319              $C$DW$1874      .dwtag  DW_TAG_member
   14320                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$22)
   14321                      .dwattr $C$DW$1874, DW_AT_name("FSTDBYWAIT")
   14322                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   14323                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14324                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14325              
   14326              $C$DW$1875      .dwtag  DW_TAG_member
   14327                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$22)
   14328                      .dwattr $C$DW$1875, DW_AT_name("FACTIVEWAIT")
   14329                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   14330                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14331                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14332              
   14333              $C$DW$1876      .dwtag  DW_TAG_member
   14334                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$22)
   14335                      .dwattr $C$DW$1876, DW_AT_name("FBANKWAIT")
   14336                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_FBANKWAIT")
   14337                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14338                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14339              
   14340              $C$DW$1877      .dwtag  DW_TAG_member
   14341                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$22)
   14342                      .dwattr $C$DW$1877, DW_AT_name("FOTPWAIT")
   14343                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_FOTPWAIT")
   14344                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14345                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14346              
   14347                      .dwendtag $C$DW$T$71
   14348              
   14349              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  271

   14350                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
   14351                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   14352              
   14353              $C$DW$T$86      .dwtag  DW_TAG_typedef
   14354                      .dwattr $C$DW$T$86, DW_AT_name("FLASH_Handle")
   14355                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   14356                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   14357              
   14358              
   14359              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   14360                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   14361                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   14362              $C$DW$1878      .dwtag  DW_TAG_member
   14363                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$73)
   14364                      .dwattr $C$DW$1878, DW_AT_name("GPACTRL")
   14365                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_GPACTRL")
   14366                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14367                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14368              
   14369              $C$DW$1879      .dwtag  DW_TAG_member
   14370                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$73)
   14371                      .dwattr $C$DW$1879, DW_AT_name("GPAQSEL1")
   14372                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_GPAQSEL1")
   14373                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14374                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14375              
   14376              $C$DW$1880      .dwtag  DW_TAG_member
   14377                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$73)
   14378                      .dwattr $C$DW$1880, DW_AT_name("GPAQSEL2")
   14379                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_GPAQSEL2")
   14380                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14381                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14382              
   14383              $C$DW$1881      .dwtag  DW_TAG_member
   14384                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$73)
   14385                      .dwattr $C$DW$1881, DW_AT_name("GPAMUX1")
   14386                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_GPAMUX1")
   14387                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14388                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14389              
   14390              $C$DW$1882      .dwtag  DW_TAG_member
   14391                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$73)
   14392                      .dwattr $C$DW$1882, DW_AT_name("GPAMUX2")
   14393                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_GPAMUX2")
   14394                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14395                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14396              
   14397              $C$DW$1883      .dwtag  DW_TAG_member
   14398                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$73)
   14399                      .dwattr $C$DW$1883, DW_AT_name("GPADIR")
   14400                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_GPADIR")
   14401                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14402                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14403              
   14404              $C$DW$1884      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  272

   14405                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$73)
   14406                      .dwattr $C$DW$1884, DW_AT_name("GPAPUD")
   14407                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_GPAPUD")
   14408                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14409                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14410              
   14411              $C$DW$1885      .dwtag  DW_TAG_member
   14412                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$25)
   14413                      .dwattr $C$DW$1885, DW_AT_name("rsvd_1")
   14414                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_1")
   14415                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14416                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14417              
   14418              $C$DW$1886      .dwtag  DW_TAG_member
   14419                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$73)
   14420                      .dwattr $C$DW$1886, DW_AT_name("GPBCTRL")
   14421                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_GPBCTRL")
   14422                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14423                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14424              
   14425              $C$DW$1887      .dwtag  DW_TAG_member
   14426                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$73)
   14427                      .dwattr $C$DW$1887, DW_AT_name("GPBQSEL1")
   14428                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_GPBQSEL1")
   14429                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14430                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14431              
   14432              $C$DW$1888      .dwtag  DW_TAG_member
   14433                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$25)
   14434                      .dwattr $C$DW$1888, DW_AT_name("rsvd_2")
   14435                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_rsvd_2")
   14436                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14437                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14438              
   14439              $C$DW$1889      .dwtag  DW_TAG_member
   14440                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$73)
   14441                      .dwattr $C$DW$1889, DW_AT_name("GPBMUX1")
   14442                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_GPBMUX1")
   14443                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14444                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14445              
   14446              $C$DW$1890      .dwtag  DW_TAG_member
   14447                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$25)
   14448                      .dwattr $C$DW$1890, DW_AT_name("rsvd_3")
   14449                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_rsvd_3")
   14450                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   14451                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14452              
   14453              $C$DW$1891      .dwtag  DW_TAG_member
   14454                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$73)
   14455                      .dwattr $C$DW$1891, DW_AT_name("GPBDIR")
   14456                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPBDIR")
   14457                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   14458                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14459              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  273

   14460              $C$DW$1892      .dwtag  DW_TAG_member
   14461                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$73)
   14462                      .dwattr $C$DW$1892, DW_AT_name("GPBPUD")
   14463                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPBPUD")
   14464                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   14465                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14466              
   14467              $C$DW$1893      .dwtag  DW_TAG_member
   14468                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$74)
   14469                      .dwattr $C$DW$1893, DW_AT_name("rsvd_4")
   14470                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_4")
   14471                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   14472                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14473              
   14474              $C$DW$1894      .dwtag  DW_TAG_member
   14475                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$73)
   14476                      .dwattr $C$DW$1894, DW_AT_name("AIOMUX1")
   14477                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_AIOMUX1")
   14478                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   14479                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14480              
   14481              $C$DW$1895      .dwtag  DW_TAG_member
   14482                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$25)
   14483                      .dwattr $C$DW$1895, DW_AT_name("rsvd_5")
   14484                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_rsvd_5")
   14485                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   14486                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14487              
   14488              $C$DW$1896      .dwtag  DW_TAG_member
   14489                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$73)
   14490                      .dwattr $C$DW$1896, DW_AT_name("AIODIR")
   14491                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_AIODIR")
   14492                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   14493                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14494              
   14495              $C$DW$1897      .dwtag  DW_TAG_member
   14496                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$75)
   14497                      .dwattr $C$DW$1897, DW_AT_name("rsvd_6")
   14498                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_rsvd_6")
   14499                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   14500                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14501              
   14502              $C$DW$1898      .dwtag  DW_TAG_member
   14503                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$73)
   14504                      .dwattr $C$DW$1898, DW_AT_name("GPADAT")
   14505                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_GPADAT")
   14506                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14507                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14508              
   14509              $C$DW$1899      .dwtag  DW_TAG_member
   14510                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$73)
   14511                      .dwattr $C$DW$1899, DW_AT_name("GPASET")
   14512                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GPASET")
   14513                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   14514                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  274

   14515              
   14516              $C$DW$1900      .dwtag  DW_TAG_member
   14517                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$73)
   14518                      .dwattr $C$DW$1900, DW_AT_name("GPACLEAR")
   14519                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GPACLEAR")
   14520                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14521                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14522              
   14523              $C$DW$1901      .dwtag  DW_TAG_member
   14524                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$73)
   14525                      .dwattr $C$DW$1901, DW_AT_name("GPATOGGLE")
   14526                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_GPATOGGLE")
   14527                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14528                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   14529              
   14530              $C$DW$1902      .dwtag  DW_TAG_member
   14531                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$73)
   14532                      .dwattr $C$DW$1902, DW_AT_name("GPBDAT")
   14533                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_GPBDAT")
   14534                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   14535                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14536              
   14537              $C$DW$1903      .dwtag  DW_TAG_member
   14538                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$73)
   14539                      .dwattr $C$DW$1903, DW_AT_name("GPBSET")
   14540                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_GPBSET")
   14541                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   14542                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14543              
   14544              $C$DW$1904      .dwtag  DW_TAG_member
   14545                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$73)
   14546                      .dwattr $C$DW$1904, DW_AT_name("GPBCLEAR")
   14547                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_GPBCLEAR")
   14548                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   14549                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14550              
   14551              $C$DW$1905      .dwtag  DW_TAG_member
   14552                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$73)
   14553                      .dwattr $C$DW$1905, DW_AT_name("GPBTOGGLE")
   14554                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_GPBTOGGLE")
   14555                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   14556                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14557              
   14558              $C$DW$1906      .dwtag  DW_TAG_member
   14559                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$30)
   14560                      .dwattr $C$DW$1906, DW_AT_name("rsvd_7")
   14561                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_rsvd_7")
   14562                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   14563                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14564              
   14565              $C$DW$1907      .dwtag  DW_TAG_member
   14566                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$73)
   14567                      .dwattr $C$DW$1907, DW_AT_name("AIODAT")
   14568                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_AIODAT")
   14569                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  275

   14570                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14571              
   14572              $C$DW$1908      .dwtag  DW_TAG_member
   14573                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$73)
   14574                      .dwattr $C$DW$1908, DW_AT_name("AIOSET")
   14575                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_AIOSET")
   14576                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14577                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14578              
   14579              $C$DW$1909      .dwtag  DW_TAG_member
   14580                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$73)
   14581                      .dwattr $C$DW$1909, DW_AT_name("AIOCLEAR")
   14582                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_AIOCLEAR")
   14583                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   14584                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14585              
   14586              $C$DW$1910      .dwtag  DW_TAG_member
   14587                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$73)
   14588                      .dwattr $C$DW$1910, DW_AT_name("AIOTOGGLE")
   14589                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_AIOTOGGLE")
   14590                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   14591                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14592              
   14593              $C$DW$1911      .dwtag  DW_TAG_member
   14594                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$27)
   14595                      .dwattr $C$DW$1911, DW_AT_name("GPIOXINTnSEL")
   14596                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   14597                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14598                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14599              
   14600              $C$DW$1912      .dwtag  DW_TAG_member
   14601                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$26)
   14602                      .dwattr $C$DW$1912, DW_AT_name("rsvd_8")
   14603                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_rsvd_8")
   14604                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14605                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14606              
   14607              $C$DW$1913      .dwtag  DW_TAG_member
   14608                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$73)
   14609                      .dwattr $C$DW$1913, DW_AT_name("GPIOLPMSEL")
   14610                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   14611                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   14612                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14613              
   14614                      .dwendtag $C$DW$T$76
   14615              
   14616              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   14617                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   14618                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   14619              
   14620              $C$DW$T$37      .dwtag  DW_TAG_typedef
   14621                      .dwattr $C$DW$T$37, DW_AT_name("GPIO_Handle")
   14622                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   14623                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   14624              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  276

   14625              
   14626              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   14627                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   14628                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x10)
   14629              $C$DW$1914      .dwtag  DW_TAG_member
   14630                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$77)
   14631                      .dwattr $C$DW$1914, DW_AT_name("I")
   14632                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_I")
   14633                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14634                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14635              
   14636              $C$DW$1915      .dwtag  DW_TAG_member
   14637                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$77)
   14638                      .dwattr $C$DW$1915, DW_AT_name("V")
   14639                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_V")
   14640                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14641                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14642              
   14643              $C$DW$1916      .dwtag  DW_TAG_member
   14644                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$69)
   14645                      .dwattr $C$DW$1916, DW_AT_name("dcBus")
   14646                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_dcBus")
   14647                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14648                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14649              
   14650              $C$DW$1917      .dwtag  DW_TAG_member
   14651                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$69)
   14652                      .dwattr $C$DW$1917, DW_AT_name("iBus")
   14653                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_iBus")
   14654                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14655                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14656              
   14657                      .dwendtag $C$DW$T$78
   14658              
   14659              $C$DW$T$108     .dwtag  DW_TAG_typedef
   14660                      .dwattr $C$DW$T$108, DW_AT_name("HAL_AdcData_t")
   14661                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$78)
   14662                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   14663              
   14664              
   14665              $C$DW$T$116     .dwtag  DW_TAG_structure_type
   14666                      .dwattr $C$DW$T$116, DW_AT_name("_HAL_Obj_")
   14667                      .dwattr $C$DW$T$116, DW_AT_byte_size(0xda)
   14668              $C$DW$1918      .dwtag  DW_TAG_member
   14669                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$80)
   14670                      .dwattr $C$DW$1918, DW_AT_name("adcHandle")
   14671                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_adcHandle")
   14672                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14673                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   14674              
   14675              $C$DW$1919      .dwtag  DW_TAG_member
   14676                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$82)
   14677                      .dwattr $C$DW$1919, DW_AT_name("clkHandle")
   14678                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_clkHandle")
   14679                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  277

   14680                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14681              
   14682              $C$DW$1920      .dwtag  DW_TAG_member
   14683                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$84)
   14684                      .dwattr $C$DW$1920, DW_AT_name("cpuHandle")
   14685                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_cpuHandle")
   14686                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14687                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14688              
   14689              $C$DW$1921      .dwtag  DW_TAG_member
   14690                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$86)
   14691                      .dwattr $C$DW$1921, DW_AT_name("flashHandle")
   14692                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_flashHandle")
   14693                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14694                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14695              
   14696              $C$DW$1922      .dwtag  DW_TAG_member
   14697                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$37)
   14698                      .dwattr $C$DW$1922, DW_AT_name("gpioHandle")
   14699                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_gpioHandle")
   14700                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14701                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14702              
   14703              $C$DW$1923      .dwtag  DW_TAG_member
   14704                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$89)
   14705                      .dwattr $C$DW$1923, DW_AT_name("offsetHandle_I")
   14706                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_offsetHandle_I")
   14707                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14708                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   14709              
   14710              $C$DW$1924      .dwtag  DW_TAG_member
   14711                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$91)
   14712                      .dwattr $C$DW$1924, DW_AT_name("offset_I")
   14713                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_offset_I")
   14714                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14715                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   14716              
   14717              $C$DW$1925      .dwtag  DW_TAG_member
   14718                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$89)
   14719                      .dwattr $C$DW$1925, DW_AT_name("offsetHandle_V")
   14720                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_offsetHandle_V")
   14721                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14722                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   14723              
   14724              $C$DW$1926      .dwtag  DW_TAG_member
   14725                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$91)
   14726                      .dwattr $C$DW$1926, DW_AT_name("offset_V")
   14727                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_offset_V")
   14728                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14729                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   14730              
   14731              $C$DW$1927      .dwtag  DW_TAG_member
   14732                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$93)
   14733                      .dwattr $C$DW$1927, DW_AT_name("oscHandle")
   14734                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_oscHandle")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  278

   14735                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   14736                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   14737              
   14738              $C$DW$1928      .dwtag  DW_TAG_member
   14739                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$95)
   14740                      .dwattr $C$DW$1928, DW_AT_name("pieHandle")
   14741                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_pieHandle")
   14742                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   14743                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   14744              
   14745              $C$DW$1929      .dwtag  DW_TAG_member
   14746                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$97)
   14747                      .dwattr $C$DW$1929, DW_AT_name("pllHandle")
   14748                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_pllHandle")
   14749                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   14750                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   14751              
   14752              $C$DW$1930      .dwtag  DW_TAG_member
   14753                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$100)
   14754                      .dwattr $C$DW$1930, DW_AT_name("pwmHandle")
   14755                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_pwmHandle")
   14756                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   14757                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   14758              
   14759              $C$DW$1931      .dwtag  DW_TAG_member
   14760                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$100)
   14761                      .dwattr $C$DW$1931, DW_AT_name("pwmDacHandle")
   14762                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_pwmDacHandle")
   14763                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   14764                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   14765              
   14766              $C$DW$1932      .dwtag  DW_TAG_member
   14767                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$102)
   14768                      .dwattr $C$DW$1932, DW_AT_name("pwrHandle")
   14769                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_pwrHandle")
   14770                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   14771                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   14772              
   14773              $C$DW$1933      .dwtag  DW_TAG_member
   14774                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$105)
   14775                      .dwattr $C$DW$1933, DW_AT_name("timerHandle")
   14776                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_timerHandle")
   14777                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   14778                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   14779              
   14780              $C$DW$1934      .dwtag  DW_TAG_member
   14781                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$107)
   14782                      .dwattr $C$DW$1934, DW_AT_name("wdogHandle")
   14783                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_wdogHandle")
   14784                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   14785                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   14786              
   14787              $C$DW$1935      .dwtag  DW_TAG_member
   14788                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$108)
   14789                      .dwattr $C$DW$1935, DW_AT_name("adcBias")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:21 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2336410                          PAGE  279

   14790                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_adcBias")
   14791                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   14792                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   14793              
   14794              $C$DW$1936      .dwtag  DW_TAG_member
   14795                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$69)
   14796                      .dwattr $C$DW$1936, DW_AT_name("current_sf")
   14797                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_current_sf")
   14798                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   14799                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   14800              
   14801              $C$DW$1937      .dwtag  DW_TAG_member
   14802                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$69)
   14803                      .dwattr $C$DW$1937, DW_AT_name("bus_current_sf")
   14804                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_bus_current_sf")
   14805                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   14806                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   14807              
   14808              $C$DW$1938      .dwtag  DW_TAG_member
   14809                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$69)
   14810                      .dwattr $C$DW$1938, DW_AT_name("voltage_sf")
   14811                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_voltage_sf")
   14812                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   14813                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   14814              
   14815              $C$DW$1939      .dwtag  DW_TAG_member
   14816                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$32)
   14817                      .dwattr $C$DW$1939, DW_AT_name("numCurrentSensors")
   14818                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_numCurrentSensors")
   14819                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   14820                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   14821              
   14822              $C$DW$1940      .dwtag  DW_TAG_member
   14823                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$32)
   14824                      .dwattr $C$DW$1940, DW_AT_name("numBusCurrentSensors")
   14825                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_numBusCurrentSensors")
   14826                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
   14827                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   14828              
   14829              $C$DW$1941      .dwtag  DW_TAG_member
   14830                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$32)
   14831                      .dwattr $C$DW$1941, DW_AT_name("numVoltageSensors")
   14832                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_numVoltageSensors")
   14833                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
   14834                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   14835              
   14836              $C$DW$1942      .dwtag  DW_TAG_member
