TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:16 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4369610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:02:16 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../modules/source/pid.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

      42                      .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$25)
      43                      .dwattr $C$DW$3, DW_AT_location[DW_OP_reg0]
      44              
      45              
      46              ;***************************************************************
      47              ;* FNAME: _PID_init                     FR SIZE:   0           *
      48              ;*                                                             *
      49              ;* FUNCTION ENVIRONMENT                                        *
      50              ;*                                                             *
      51              ;* FUNCTION PROPERTIES                                         *
      52              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      53              ;***************************************************************
      54              
      55              _PID_init:
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:16 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4369610                          PAGE    2

      56              ;* AR6   assigned to _numBytes
      57              $C$DW$4 .dwtag  DW_TAG_variable
      58                      .dwattr $C$DW$4, DW_AT_name("numBytes")
      59                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_numBytes")
      60                      .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$25)
      61                      .dwattr $C$DW$4, DW_AT_location[DW_OP_reg16]
      62              
      63              ;* AR4   assigned to _pMemory
      64              $C$DW$5 .dwtag  DW_TAG_variable
      65                      .dwattr $C$DW$5, DW_AT_name("pMemory")
      66                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_pMemory")
      67                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$28)
      68                      .dwattr $C$DW$5, DW_AT_location[DW_OP_reg12]
      69              
      70                      .dwcfi  cfa_offset, -2
      71                      .dwcfi  save_reg_to_mem, 26, 0
      72 00000000 1EA6          MOVL      XAR6,ACC              ; [CPU_] |57| 
      73                      .dwpsn  file "../modules/source/pid.c",line 61,column 3,is_stmt,isa 0
      74 00000001 0210          MOVB      ACC,#16               ; [CPU_] |61| 
      75 00000002 0FA6          CMPL      ACC,XAR6              ; [CPU_] |61| 
      76 00000003 6903          B         $C$L1,LOS             ; [CPU_] |61| 
      77                      ; branchcc occurs ; [] |61| 
      78                      .dwcfi  remember_state
      79                      .dwpsn  file "../modules/source/pid.c",line 62,column 5,is_stmt,isa 0
      80 00000004 D400          MOVB      XAR4,#0               ; [CPU_] |62| 
      81              $C$DW$6 .dwtag  DW_TAG_TI_branch
      82                      .dwattr $C$DW$6, DW_AT_low_pc(0x00)
      83                      .dwattr $C$DW$6, DW_AT_TI_return
      84              
      85 00000005 0006          LRETR     ; [CPU_] 
      86                      ; return occurs ; [] 
      87                      .dwcfi  restore_state
      88 00000006       $C$L1:    
      89                      .dwpsn  file "D:/Users/MaCHaDo/Documents/GitHub/LegStrong/modules/include/pid.h",line 413,column 3,is
      90 00000006 0200          MOVB      ACC,#0                ; [CPU_] |413| 
      91                      .dwpsn  file "D:/Users/MaCHaDo/Documents/GitHub/LegStrong/modules/include/pid.h",line 400,column 3,is
      92 00000007 D008          MOVB      XAR0,#8               ; [CPU_] |400| 
      93                      .dwpsn  file "D:/Users/MaCHaDo/Documents/GitHub/LegStrong/modules/include/pid.h",line 413,column 3,is
      94 00000008 1EF4          MOVL      *+XAR4[6],ACC         ; [CPU_] |413| 
      95                      .dwpsn  file "D:/Users/MaCHaDo/Documents/GitHub/LegStrong/modules/include/pid.h",line 400,column 3,is
      96 00000009 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_] |400| 
      97                      .dwpsn  file "D:/Users/MaCHaDo/Documents/GitHub/LegStrong/modules/include/pid.h",line 290,column 3,is
      98 0000000a D00A          MOVB      XAR0,#10              ; [CPU_] |290| 
      99 0000000b 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_] |290| 
     100              $C$DW$7 .dwtag  DW_TAG_TI_branch
     101                      .dwattr $C$DW$7, DW_AT_low_pc(0x00)
     102                      .dwattr $C$DW$7, DW_AT_TI_return
     103              
     104 0000000c 0006          LRETR     ; [CPU_] 
     105                      ; return occurs ; [] 
     106                      .dwattr $C$DW$1, DW_AT_TI_end_file("../modules/source/pid.c")
     107                      .dwattr $C$DW$1, DW_AT_TI_end_line(0x49)
     108                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
     109                      .dwendentry
     110                      .dwendtag $C$DW$1
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:16 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4369610                          PAGE    3

     111              
     112              
     113              ;***************************************************************
     114              ;* TYPE INFORMATION                                            *
     115              ;***************************************************************
     116              
     117              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     118                      .dwattr $C$DW$T$20, DW_AT_name("_PID_Obj_")
     119                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x10)
     120              $C$DW$8 .dwtag  DW_TAG_member
     121                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     122                      .dwattr $C$DW$8, DW_AT_name("Kp")
     123                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_Kp")
     124                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     125                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     126              
     127              $C$DW$9 .dwtag  DW_TAG_member
     128                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     129                      .dwattr $C$DW$9, DW_AT_name("Ki")
     130                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_Ki")
     131                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     132                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     133              
     134              $C$DW$10        .dwtag  DW_TAG_member
     135                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     136                      .dwattr $C$DW$10, DW_AT_name("Kd")
     137                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_Kd")
     138                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     139                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     140              
     141              $C$DW$11        .dwtag  DW_TAG_member
     142                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     143                      .dwattr $C$DW$11, DW_AT_name("Ui")
     144                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_Ui")
     145                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     146                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     147              
     148              $C$DW$12        .dwtag  DW_TAG_member
     149                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     150                      .dwattr $C$DW$12, DW_AT_name("refValue")
     151                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_refValue")
     152                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     153                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     154              
     155              $C$DW$13        .dwtag  DW_TAG_member
     156                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     157                      .dwattr $C$DW$13, DW_AT_name("fbackValue")
     158                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_fbackValue")
     159                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     160                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     161              
     162              $C$DW$14        .dwtag  DW_TAG_member
     163                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     164                      .dwattr $C$DW$14, DW_AT_name("outMin")
     165                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_outMin")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:16 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4369610                          PAGE    4

     166                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     167                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     168              
     169              $C$DW$15        .dwtag  DW_TAG_member
     170                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     171                      .dwattr $C$DW$15, DW_AT_name("outMax")
     172                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_outMax")
     173                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     174                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     175              
     176                      .dwendtag $C$DW$T$20
     177              
     178              $C$DW$T$21      .dwtag  DW_TAG_typedef
     179                      .dwattr $C$DW$T$21, DW_AT_name("PID_Obj")
     180                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     181                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     182              
     183              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     184                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
     185                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     186              
     187              $C$DW$T$23      .dwtag  DW_TAG_typedef
     188                      .dwattr $C$DW$T$23, DW_AT_name("PID_Handle")
     189                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     190                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     191              
     192              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     193                      .dwattr $C$DW$T$2, DW_AT_name("void")
     194              
     195              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     196                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     197                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     198              
     199              $C$DW$16        .dwtag  DW_TAG_TI_far_type
     200                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$3)
     201              
     202              $C$DW$T$28      .dwtag  DW_TAG_const_type
     203                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$16)
     204              
     205              $C$DW$T$4       .dwtag  DW_TAG_base_type
     206                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     207                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     208                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     209              
     210              $C$DW$T$5       .dwtag  DW_TAG_base_type
     211                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     212                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     213                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     214              
     215              $C$DW$T$6       .dwtag  DW_TAG_base_type
     216                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     217                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     218                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     219              
     220              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:02:16 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4369610                          PAGE    5

     221                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     222                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     223                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     224              
     225              $C$DW$T$8       .dwtag  DW_TAG_base_type
     226                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     227                      .dwattr $C$DW$T$8, DW_AT_name("short")
     228                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     229              
     230              $C$DW$T$9       .dwtag  DW_TAG_base_type
     231                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     232                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     233                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     234              
     235              $C$DW$T$10      .dwtag  DW_TAG_base_type
