TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:31 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../modules/source/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("EST_setLs_d_pu")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    3460                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3461                      .dwattr $C$DW$339, DW_AT_const_value(0x60)
    3462              
    3463              $C$DW$340       .dwtag  DW_TAG_enumerator
    3464                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3465                      .dwattr $C$DW$340, DW_AT_const_value(0x61)
    3466              
    3467              $C$DW$341       .dwtag  DW_TAG_enumerator
    3468                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3469                      .dwattr $C$DW$341, DW_AT_const_value(0x62)
    3470              
    3471              $C$DW$342       .dwtag  DW_TAG_enumerator
    3472                      .dwattr $C$DW$342, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3473                      .dwattr $C$DW$342, DW_AT_const_value(0x63)
    3474              
    3475              $C$DW$343       .dwtag  DW_TAG_enumerator
    3476                      .dwattr $C$DW$343, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3477                      .dwattr $C$DW$343, DW_AT_const_value(0x64)
    3478              
    3479              $C$DW$344       .dwtag  DW_TAG_enumerator
    3480                      .dwattr $C$DW$344, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3481                      .dwattr $C$DW$344, DW_AT_const_value(0x65)
    3482              
    3483              $C$DW$345       .dwtag  DW_TAG_enumerator
    3484                      .dwattr $C$DW$345, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3485                      .dwattr $C$DW$345, DW_AT_const_value(0x66)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   69

    3486              
    3487              $C$DW$346       .dwtag  DW_TAG_enumerator
    3488                      .dwattr $C$DW$346, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3489                      .dwattr $C$DW$346, DW_AT_const_value(0x67)
    3490              
    3491              $C$DW$347       .dwtag  DW_TAG_enumerator
    3492                      .dwattr $C$DW$347, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3493                      .dwattr $C$DW$347, DW_AT_const_value(0x68)
    3494              
    3495              $C$DW$348       .dwtag  DW_TAG_enumerator
    3496                      .dwattr $C$DW$348, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3497                      .dwattr $C$DW$348, DW_AT_const_value(0x69)
    3498              
    3499              $C$DW$349       .dwtag  DW_TAG_enumerator
    3500                      .dwattr $C$DW$349, DW_AT_name("USER_numErrorCodes")
    3501                      .dwattr $C$DW$349, DW_AT_const_value(0x6a)
    3502              
    3503                      .dwendtag $C$DW$T$74
    3504              
    3505              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3506                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3507                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3508                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3509              
    3510              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    3511                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$75)
    3512              
    3513              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3514                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$350)
    3515              
    3516              
    3517              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3518                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3519              $C$DW$351       .dwtag  DW_TAG_enumerator
    3520                      .dwattr $C$DW$351, DW_AT_name("CTRL_Type_PID_spd")
    3521                      .dwattr $C$DW$351, DW_AT_const_value(0x00)
    3522              
    3523              $C$DW$352       .dwtag  DW_TAG_enumerator
    3524                      .dwattr $C$DW$352, DW_AT_name("CTRL_Type_PID_Id")
    3525                      .dwattr $C$DW$352, DW_AT_const_value(0x01)
    3526              
    3527              $C$DW$353       .dwtag  DW_TAG_enumerator
    3528                      .dwattr $C$DW$353, DW_AT_name("CTRL_Type_PID_Iq")
    3529                      .dwattr $C$DW$353, DW_AT_const_value(0x02)
    3530              
    3531                      .dwendtag $C$DW$T$82
    3532              
    3533              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3534                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3535                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3536                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3537              
    3538              $C$DW$354       .dwtag  DW_TAG_TI_far_type
    3539                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$83)
    3540              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   70

    3541              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3542                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$354)
    3543              
    3544              
    3545              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3546                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3547                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3548              $C$DW$355       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    3550                      .dwattr $C$DW$355, DW_AT_name("alpha_sf")
    3551                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_alpha_sf")
    3552                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3553                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3554              
    3555              $C$DW$356       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    3557                      .dwattr $C$DW$356, DW_AT_name("beta_sf")
    3558                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_beta_sf")
    3559                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3560                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$357       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
    3564                      .dwattr $C$DW$357, DW_AT_name("numSensors")
    3565                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_numSensors")
    3566                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3567                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569                      .dwendtag $C$DW$T$23
    3570              
    3571              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3572                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3573                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3574                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3575              
    3576              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3577                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3578                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3579              
    3580              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3581                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3582                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3583                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3584              
    3585              
    3586              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3587                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3588                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3589              $C$DW$358       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$24)
    3591                      .dwattr $C$DW$358, DW_AT_name("version")
    3592                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_version")
    3593                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3594                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3595              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   71

    3596              $C$DW$359       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$26)
    3598                      .dwattr $C$DW$359, DW_AT_name("state")
    3599                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_state")
    3600                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3601                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3602              
    3603              $C$DW$360       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$26)
    3605                      .dwattr $C$DW$360, DW_AT_name("prevState")
    3606                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_prevState")
    3607                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3608                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3609              
    3610              $C$DW$361       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$28)
    3612                      .dwattr $C$DW$361, DW_AT_name("errorCode")
    3613                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_errorCode")
    3614                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3615                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3616              
    3617              $C$DW$362       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$30)
    3619                      .dwattr $C$DW$362, DW_AT_name("clarkeHandle_I")
    3620                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3621                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3622                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3623              
    3624              $C$DW$363       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
    3626                      .dwattr $C$DW$363, DW_AT_name("clarke_I")
    3627                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_clarke_I")
    3628                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3629                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3630              
    3631              $C$DW$364       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$30)
    3633                      .dwattr $C$DW$364, DW_AT_name("clarkeHandle_V")
    3634                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3635                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3636                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3637              
    3638              $C$DW$365       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
    3640                      .dwattr $C$DW$365, DW_AT_name("clarke_V")
    3641                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_clarke_V")
    3642                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3643                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3644              
    3645              $C$DW$366       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$33)
    3647                      .dwattr $C$DW$366, DW_AT_name("estHandle")
    3648                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_estHandle")
    3649                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3650                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   72

    3651              
    3652              $C$DW$367       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$35)
    3654                      .dwattr $C$DW$367, DW_AT_name("parkHandle")
    3655                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_parkHandle")
    3656                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3657                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3658              
    3659              $C$DW$368       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$36)
    3661                      .dwattr $C$DW$368, DW_AT_name("park")
    3662                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_park")
    3663                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3664                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3665              
    3666              $C$DW$369       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$38)
    3668                      .dwattr $C$DW$369, DW_AT_name("pidHandle_Id")
    3669                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_pidHandle_Id")
    3670                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3671                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3672              
    3673              $C$DW$370       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$39)
    3675                      .dwattr $C$DW$370, DW_AT_name("pid_Id")
    3676                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_pid_Id")
    3677                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3678                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3679              
    3680              $C$DW$371       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$38)
    3682                      .dwattr $C$DW$371, DW_AT_name("pidHandle_Iq")
    3683                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3684                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3685                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3686              
    3687              $C$DW$372       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$39)
    3689                      .dwattr $C$DW$372, DW_AT_name("pid_Iq")
    3690                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_pid_Iq")
    3691                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3692                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3693              
    3694              $C$DW$373       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$38)
    3696                      .dwattr $C$DW$373, DW_AT_name("pidHandle_spd")
    3697                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_pidHandle_spd")
    3698                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3699                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3700              
    3701              $C$DW$374       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$39)
    3703                      .dwattr $C$DW$374, DW_AT_name("pid_spd")
    3704                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_pid_spd")
    3705                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   73

    3706                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3707              
    3708              $C$DW$375       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$41)
    3710                      .dwattr $C$DW$375, DW_AT_name("iparkHandle")
    3711                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_iparkHandle")
    3712                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3713                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3714              
    3715              $C$DW$376       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$42)
    3717                      .dwattr $C$DW$376, DW_AT_name("ipark")
    3718                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ipark")
    3719                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3720                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3721              
    3722              $C$DW$377       .dwtag  DW_TAG_member
    3723                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$44)
    3724                      .dwattr $C$DW$377, DW_AT_name("svgenHandle")
    3725                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_svgenHandle")
    3726                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3727                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3728              
    3729              $C$DW$378       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$45)
    3731                      .dwattr $C$DW$378, DW_AT_name("svgen")
    3732                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_svgen")
    3733                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3734                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3735              
    3736              $C$DW$379       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$47)
    3738                      .dwattr $C$DW$379, DW_AT_name("trajHandle_Id")
    3739                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_trajHandle_Id")
    3740                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3741                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3742              
    3743              $C$DW$380       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$48)
    3745                      .dwattr $C$DW$380, DW_AT_name("traj_Id")
    3746                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_traj_Id")
    3747                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3748                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3749              
    3750              $C$DW$381       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$47)
    3752                      .dwattr $C$DW$381, DW_AT_name("trajHandle_spd")
    3753                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_trajHandle_spd")
    3754                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3755                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3756              
    3757              $C$DW$382       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$48)
    3759                      .dwattr $C$DW$382, DW_AT_name("traj_spd")
    3760                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_traj_spd")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   74

    3761                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3762                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3763              
    3764              $C$DW$383       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$47)
    3766                      .dwattr $C$DW$383, DW_AT_name("trajHandle_spdMax")
    3767                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3768                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3769                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3770              
    3771              $C$DW$384       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$48)
    3773                      .dwattr $C$DW$384, DW_AT_name("traj_spdMax")
    3774                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_traj_spdMax")
    3775                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3776                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3777              
    3778              $C$DW$385       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$49)
    3780                      .dwattr $C$DW$385, DW_AT_name("motorParams")
    3781                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_motorParams")
    3782                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3783                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3784              
    3785              $C$DW$386       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$52)
    3787                      .dwattr $C$DW$386, DW_AT_name("waitTimes")
    3788                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_waitTimes")
    3789                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3790                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3791              
    3792              $C$DW$387       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$51)
    3794                      .dwattr $C$DW$387, DW_AT_name("counter_state")
    3795                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_counter_state")
    3796                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3797                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3798              
    3799              $C$DW$388       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$53)
    3801                      .dwattr $C$DW$388, DW_AT_name("numIsrTicksPerCtrlTick")
    3802                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3803                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3804                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3805              
    3806              $C$DW$389       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$53)
    3808                      .dwattr $C$DW$389, DW_AT_name("numCtrlTicksPerCurrentTick")
    3809                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3810                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3811                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3812              
    3813              $C$DW$390       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$53)
    3815                      .dwattr $C$DW$390, DW_AT_name("numCtrlTicksPerSpeedTick")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   75

    3816                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3817                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3818                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3819              
    3820              $C$DW$391       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$53)
    3822                      .dwattr $C$DW$391, DW_AT_name("numCtrlTicksPerTrajTick")
    3823                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3824                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3825                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3826              
    3827              $C$DW$392       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$51)
    3829                      .dwattr $C$DW$392, DW_AT_name("ctrlFreq_Hz")
    3830                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3831                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3832                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3833              
    3834              $C$DW$393       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$51)
    3836                      .dwattr $C$DW$393, DW_AT_name("trajFreq_Hz")
    3837                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3838                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3839                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3840              
    3841              $C$DW$394       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3843                      .dwattr $C$DW$394, DW_AT_name("trajPeriod_sec")
    3844                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3845                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3846                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3847              
    3848              $C$DW$395       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$54)
    3850                      .dwattr $C$DW$395, DW_AT_name("ctrlPeriod_sec")
    3851                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3852                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3853                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3854              
    3855              $C$DW$396       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3857                      .dwattr $C$DW$396, DW_AT_name("maxVsMag_pu")
    3858                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3859                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3860                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3861              
    3862              $C$DW$397       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$55)
    3864                      .dwattr $C$DW$397, DW_AT_name("Iab_in")
    3865                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Iab_in")
    3866                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3867                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3868              
    3869              $C$DW$398       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   76

    3871                      .dwattr $C$DW$398, DW_AT_name("Iab_filt")
    3872                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Iab_filt")
    3873                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3874                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3875              
    3876              $C$DW$399       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$55)
    3878                      .dwattr $C$DW$399, DW_AT_name("Idq_in")
    3879                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Idq_in")
    3880                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3881                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3882              
    3883              $C$DW$400       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$55)
    3885                      .dwattr $C$DW$400, DW_AT_name("Vab_in")
    3886                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Vab_in")
    3887                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3888                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3889              
    3890              $C$DW$401       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3892                      .dwattr $C$DW$401, DW_AT_name("spd_out")
    3893                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_spd_out")
    3894                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3895                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3896              
    3897              $C$DW$402       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$55)
    3899                      .dwattr $C$DW$402, DW_AT_name("Vab_out")
    3900                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Vab_out")
    3901                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3902                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3903              
    3904              $C$DW$403       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$55)
    3906                      .dwattr $C$DW$403, DW_AT_name("Vdq_out")
    3907                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Vdq_out")
    3908                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3909                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3910              
    3911              $C$DW$404       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$54)
    3913                      .dwattr $C$DW$404, DW_AT_name("Rhf")
    3914                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Rhf")
    3915                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3916                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3917              
    3918              $C$DW$405       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$54)
    3920                      .dwattr $C$DW$405, DW_AT_name("Lhf")
    3921                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Lhf")
    3922                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3923                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3924              
    3925              $C$DW$406       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   77

    3926                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3927                      .dwattr $C$DW$406, DW_AT_name("RoverL")
    3928                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_RoverL")
    3929                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3930                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3931              
    3932              $C$DW$407       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3934                      .dwattr $C$DW$407, DW_AT_name("Kp_Id")
    3935                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kp_Id")
    3936                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3937                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3938              
    3939              $C$DW$408       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3941                      .dwattr $C$DW$408, DW_AT_name("Kp_Iq")
    3942                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kp_Iq")
    3943                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3944                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3945              
    3946              $C$DW$409       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3948                      .dwattr $C$DW$409, DW_AT_name("Kp_spd")
    3949                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Kp_spd")
    3950                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3951                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3952              
    3953              $C$DW$410       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3955                      .dwattr $C$DW$410, DW_AT_name("Ki_Id")
    3956                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ki_Id")
    3957                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3958                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3959              
    3960              $C$DW$411       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3962                      .dwattr $C$DW$411, DW_AT_name("Ki_Iq")
    3963                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ki_Iq")
    3964                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3965                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3966              
    3967              $C$DW$412       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3969                      .dwattr $C$DW$412, DW_AT_name("Ki_spd")
    3970                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ki_spd")
    3971                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3972                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3973              
    3974              $C$DW$413       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3976                      .dwattr $C$DW$413, DW_AT_name("Kd_Id")
    3977                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Kd_Id")
    3978                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3979                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3980              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   78

    3981              $C$DW$414       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3983                      .dwattr $C$DW$414, DW_AT_name("Kd_Iq")
    3984                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Kd_Iq")
    3985                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3986                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3987              
    3988              $C$DW$415       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3990                      .dwattr $C$DW$415, DW_AT_name("Kd_spd")
    3991                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Kd_spd")
    3992                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3993                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3994              
    3995              $C$DW$416       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3997                      .dwattr $C$DW$416, DW_AT_name("Ui_Id")
    3998                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ui_Id")
    3999                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4000                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4001              
    4002              $C$DW$417       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    4004                      .dwattr $C$DW$417, DW_AT_name("Ui_Iq")
    4005                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Ui_Iq")
    4006                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4007                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4008              
    4009              $C$DW$418       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    4011                      .dwattr $C$DW$418, DW_AT_name("Ui_spd")
    4012                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Ui_spd")
    4013                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4014                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4015              
    4016              $C$DW$419       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
    4018                      .dwattr $C$DW$419, DW_AT_name("Idq_ref")
    4019                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Idq_ref")
    4020                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4021                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4022              
    4023              $C$DW$420       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    4025                      .dwattr $C$DW$420, DW_AT_name("IdRated")
    4026                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_IdRated")
    4027                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4028                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4029              
    4030              $C$DW$421       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    4032                      .dwattr $C$DW$421, DW_AT_name("spd_ref")
    4033                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_spd_ref")
    4034                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4035                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   79

    4036              
    4037              $C$DW$422       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    4039                      .dwattr $C$DW$422, DW_AT_name("spd_max")
    4040                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_spd_max")
    4041                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4042                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4043              
    4044              $C$DW$423       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$53)
    4046                      .dwattr $C$DW$423, DW_AT_name("counter_current")
    4047                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_counter_current")
    4048                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4049                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4050              
    4051              $C$DW$424       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$53)
    4053                      .dwattr $C$DW$424, DW_AT_name("counter_isr")
    4054                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_counter_isr")
    4055                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4056                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4057              
    4058              $C$DW$425       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$53)
    4060                      .dwattr $C$DW$425, DW_AT_name("counter_speed")
    4061                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_counter_speed")
    4062                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4063                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4064              
    4065              $C$DW$426       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$53)
    4067                      .dwattr $C$DW$426, DW_AT_name("counter_traj")
    4068                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_counter_traj")
    4069                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4070                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4071              
    4072              $C$DW$427       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$56)
    4074                      .dwattr $C$DW$427, DW_AT_name("flag_enableCtrl")
    4075                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4076                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4077                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4078              
    4079              $C$DW$428       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4081                      .dwattr $C$DW$428, DW_AT_name("flag_enableDcBusComp")
    4082                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4083                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4084                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4085              
    4086              $C$DW$429       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$56)
    4088                      .dwattr $C$DW$429, DW_AT_name("flag_enablePowerWarp")
    4089                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4090                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   80

    4091                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4092              
    4093              $C$DW$430       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$56)
    4095                      .dwattr $C$DW$430, DW_AT_name("flag_enableOffset")
    4096                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_flag_enableOffset")
    4097                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4098                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4099              
    4100              $C$DW$431       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$56)
    4102                      .dwattr $C$DW$431, DW_AT_name("flag_enableSpeedCtrl")
    4103                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4104                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4105                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4106              
    4107              $C$DW$432       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4109                      .dwattr $C$DW$432, DW_AT_name("flag_enableUserMotorParams")
    4110                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4111                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4112                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4113              
    4114              $C$DW$433       .dwtag  DW_TAG_member
    4115                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$55)
    4116                      .dwattr $C$DW$433, DW_AT_name("Idq_offset_pu")
    4117                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4118                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4119                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4120              
    4121              $C$DW$434       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$55)
    4123                      .dwattr $C$DW$434, DW_AT_name("Vdq_offset_pu")
    4124                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4125                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4126                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4127              
    4128              $C$DW$435       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4130                      .dwattr $C$DW$435, DW_AT_name("angle_pu")
    4131                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_angle_pu")
    4132                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4133                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4134              
    4135              $C$DW$436       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4137                      .dwattr $C$DW$436, DW_AT_name("speed_ref_pu")
    4138                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_speed_ref_pu")
    4139                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4140                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4141              
    4142              $C$DW$437       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    4144                      .dwattr $C$DW$437, DW_AT_name("speed_fb_pu")
    4145                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_speed_fb_pu")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   81

    4146                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4147                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4148              
    4149              $C$DW$438       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4151                      .dwattr $C$DW$438, DW_AT_name("speed_outMax_pu")
    4152                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4153                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4154                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4155              
    4156              $C$DW$439       .dwtag  DW_TAG_member
    4157                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4158                      .dwattr $C$DW$439, DW_AT_name("flag_enableCurrentCtrl")
    4159                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4160                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4161                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4162              
    4163                      .dwendtag $C$DW$T$57
    4164              
    4165              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4166                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4167                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4168                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4169              
    4170              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4171                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4172                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4173              
    4174              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4175                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4176                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4177                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4178              
    4179              $C$DW$440       .dwtag  DW_TAG_TI_far_type
    4180                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$87)
    4181              
    4182              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4183                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$440)
    4184              
    4185              
    4186              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4187                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4188                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4189              $C$DW$441       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4191                      .dwattr $C$DW$441, DW_AT_name("rsvd")
    4192                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_rsvd")
    4193                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4194                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4195              
    4196              $C$DW$442       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$59)
    4198                      .dwattr $C$DW$442, DW_AT_name("targetProc")
    4199                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_targetProc")
    4200                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   82

    4201                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4202              
    4203              $C$DW$443       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$21)
    4205                      .dwattr $C$DW$443, DW_AT_name("major")
    4206                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_major")
    4207                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4208                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4209              
    4210              $C$DW$444       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    4212                      .dwattr $C$DW$444, DW_AT_name("minor")
    4213                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_minor")
    4214                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4215                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4216              
    4217                      .dwendtag $C$DW$T$60
    4218              
    4219              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4220                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4221                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4222                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4223              
    4224              
    4225              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4226                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4227                      .dwattr $C$DW$T$19, DW_AT_declaration
    4228                      .dwendtag $C$DW$T$19
    4229              
    4230              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4231                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4232                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4233              
    4234              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4235                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4236                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4237                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4238              
    4239              
    4240              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4241                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4242                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4243              $C$DW$445       .dwtag  DW_TAG_member
    4244                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    4245                      .dwattr $C$DW$445, DW_AT_name("sinTh")
    4246                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_sinTh")
    4247                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4248                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4249              
    4250              $C$DW$446       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4252                      .dwattr $C$DW$446, DW_AT_name("cosTh")
    4253                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_cosTh")
    4254                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4255                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   83

    4256              
    4257                      .dwendtag $C$DW$T$61
    4258              
    4259              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4260                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4261                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4262                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4263              
    4264              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4265                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4266                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4267              
    4268              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4269                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4270                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4271                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4272              
    4273              
    4274              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4275                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4276                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4277              $C$DW$447       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$62)
    4279                      .dwattr $C$DW$447, DW_AT_name("value")
    4280                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_value")
    4281                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4282                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4283              
    4284                      .dwendtag $C$DW$T$63
    4285              
    4286              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4287                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4288                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4289                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4290              
    4291              
    4292              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4293                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4294                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4295              $C$DW$448       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$65)
    4297                      .dwattr $C$DW$448, DW_AT_name("type")
    4298                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_type")
    4299                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4300                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4301              
    4302              $C$DW$449       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$53)
    4304                      .dwattr $C$DW$449, DW_AT_name("numPolePairs")
    4305                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_numPolePairs")
    4306                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4307                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4308              
    4309              $C$DW$450       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   84

    4311                      .dwattr $C$DW$450, DW_AT_name("Lr_H")
    4312                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Lr_H")
    4313                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4314                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4315              
    4316              $C$DW$451       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    4318                      .dwattr $C$DW$451, DW_AT_name("Ls_d_H")
    4319                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Ls_d_H")
    4320                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4321                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4322              
    4323              $C$DW$452       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    4325                      .dwattr $C$DW$452, DW_AT_name("Ls_q_H")
    4326                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ls_q_H")
    4327                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4328                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4329              
    4330              $C$DW$453       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    4332                      .dwattr $C$DW$453, DW_AT_name("Rr_Ohm")
    4333                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Rr_Ohm")
    4334                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4335                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4336              
    4337              $C$DW$454       .dwtag  DW_TAG_member
    4338                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$54)
    4339                      .dwattr $C$DW$454, DW_AT_name("Rs_Ohm")
    4340                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Rs_Ohm")
    4341                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4342                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4343              
    4344              $C$DW$455       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    4346                      .dwattr $C$DW$455, DW_AT_name("ratedFlux_VpHz")
    4347                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4348                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4349                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4350              
    4351                      .dwendtag $C$DW$T$66
    4352              
    4353              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4354                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4355                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4356                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4357              
    4358              
    4359              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4360                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4361                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4362              $C$DW$456       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4364                      .dwattr $C$DW$456, DW_AT_name("sinTh")
    4365                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sinTh")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   85

    4366                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4367                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4368              
    4369              $C$DW$457       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4371                      .dwattr $C$DW$457, DW_AT_name("cosTh")
    4372                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_cosTh")
    4373                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4374                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4375              
    4376                      .dwendtag $C$DW$T$67
    4377              
    4378              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4379                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4380                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4381                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4382              
    4383              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4384                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4385                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4386              
    4387              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4388                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4389                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4390                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4391              
    4392              
    4393              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4394                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4395                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4396              $C$DW$458       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4398                      .dwattr $C$DW$458, DW_AT_name("Kp")
    4399                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_Kp")
    4400                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4401                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4402              
    4403              $C$DW$459       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4405                      .dwattr $C$DW$459, DW_AT_name("Ki")
    4406                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Ki")
    4407                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4408                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4409              
    4410              $C$DW$460       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4412                      .dwattr $C$DW$460, DW_AT_name("Kd")
    4413                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Kd")
    4414                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4415                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4416              
    4417              $C$DW$461       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4419                      .dwattr $C$DW$461, DW_AT_name("Ui")
    4420                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_Ui")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   86

    4421                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4422                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4423              
    4424              $C$DW$462       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4426                      .dwattr $C$DW$462, DW_AT_name("refValue")
    4427                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_refValue")
    4428                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4429                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4430              
    4431              $C$DW$463       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4433                      .dwattr $C$DW$463, DW_AT_name("fbackValue")
    4434                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_fbackValue")
    4435                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4436                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4437              
    4438              $C$DW$464       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4440                      .dwattr $C$DW$464, DW_AT_name("outMin")
    4441                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_outMin")
    4442                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4443                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$465       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    4447                      .dwattr $C$DW$465, DW_AT_name("outMax")
    4448                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_outMax")
    4449                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4450                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452                      .dwendtag $C$DW$T$68
    4453              
    4454              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4455                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4456                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4457                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4458              
    4459              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4460                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4461                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4462              
    4463              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4464                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4465                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4466                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4467              
    4468              
    4469              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4470                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4471                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4472              $C$DW$466       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    4474                      .dwattr $C$DW$466, DW_AT_name("maxModulation")
    4475                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_maxModulation")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   87

    4476                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4477                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4478              
    4479                      .dwendtag $C$DW$T$69
    4480              
    4481              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4482                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4483                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4484                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4485              
    4486              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4487                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4488                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4489              
    4490              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4491                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4492                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4493                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4494              
    4495              
    4496              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4497                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4498                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4499              $C$DW$467       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    4501                      .dwattr $C$DW$467, DW_AT_name("targetValue")
    4502                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_targetValue")
    4503                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4505              
    4506              $C$DW$468       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    4508                      .dwattr $C$DW$468, DW_AT_name("intValue")
    4509                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_intValue")
    4510                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4511                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4512              
    4513              $C$DW$469       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    4515                      .dwattr $C$DW$469, DW_AT_name("minValue")
    4516                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_minValue")
    4517                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4518                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4519              
    4520              $C$DW$470       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    4522                      .dwattr $C$DW$470, DW_AT_name("maxValue")
    4523                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_maxValue")
    4524                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4525                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4526              
    4527              $C$DW$471       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    4529                      .dwattr $C$DW$471, DW_AT_name("maxDelta")
    4530                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxDelta")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   88

    4531                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4532                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4533              
    4534                      .dwendtag $C$DW$T$70
    4535              
    4536              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4537                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4538                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4539                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4540              
    4541              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4542                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4543                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4544              
    4545              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4546                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4547                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4548                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4549              
    4550              
    4551              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4552                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4553                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xb0)
    4554              $C$DW$472       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    4556                      .dwattr $C$DW$472, DW_AT_name("iqFullScaleCurrent_A")
    4557                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4558                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4559                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4560              
    4561              $C$DW$473       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$54)
    4563                      .dwattr $C$DW$473, DW_AT_name("iqFullScaleVoltage_V")
    4564                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4565                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4566                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4567              
    4568              $C$DW$474       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$54)
    4570                      .dwattr $C$DW$474, DW_AT_name("iqFullScaleFreq_Hz")
    4571                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4572                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4573                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4574              
    4575              $C$DW$475       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$53)
    4577                      .dwattr $C$DW$475, DW_AT_name("numIsrTicksPerCtrlTick")
    4578                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4579                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4580                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4581              
    4582              $C$DW$476       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$53)
    4584                      .dwattr $C$DW$476, DW_AT_name("numCtrlTicksPerCurrentTick")
    4585                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   89

    4586                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4587                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4588              
    4589              $C$DW$477       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$53)
    4591                      .dwattr $C$DW$477, DW_AT_name("numCtrlTicksPerEstTick")
    4592                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4593                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4594                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4595              
    4596              $C$DW$478       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$53)
    4598                      .dwattr $C$DW$478, DW_AT_name("numCtrlTicksPerSpeedTick")
    4599                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4600                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4601                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4602              
    4603              $C$DW$479       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$53)
    4605                      .dwattr $C$DW$479, DW_AT_name("numCtrlTicksPerTrajTick")
    4606                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4607                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4608                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4609              
    4610              $C$DW$480       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    4612                      .dwattr $C$DW$480, DW_AT_name("numCurrentSensors")
    4613                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_numCurrentSensors")
    4614                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4615                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4616              
    4617              $C$DW$481       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    4619                      .dwattr $C$DW$481, DW_AT_name("numVoltageSensors")
    4620                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_numVoltageSensors")
    4621                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4622                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4623              
    4624              $C$DW$482       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4626                      .dwattr $C$DW$482, DW_AT_name("offsetPole_rps")
    4627                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_offsetPole_rps")
    4628                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4629                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4630              
    4631              $C$DW$483       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4633                      .dwattr $C$DW$483, DW_AT_name("fluxPole_rps")
    4634                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_fluxPole_rps")
    4635                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4636                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$484       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4640                      .dwattr $C$DW$484, DW_AT_name("zeroSpeedLimit")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   90

    4641                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4642                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4643                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645              $C$DW$485       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4647                      .dwattr $C$DW$485, DW_AT_name("forceAngleFreq_Hz")
    4648                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4649                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4650                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4651              
    4652              $C$DW$486       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4654                      .dwattr $C$DW$486, DW_AT_name("maxAccel_Hzps")
    4655                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4656                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4657                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4658              
    4659              $C$DW$487       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$54)
    4661                      .dwattr $C$DW$487, DW_AT_name("maxAccel_est_Hzps")
    4662                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4663                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4664                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4665              
    4666              $C$DW$488       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4668                      .dwattr $C$DW$488, DW_AT_name("directionPole_rps")
    4669                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_directionPole_rps")
    4670                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4671                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4672              
    4673              $C$DW$489       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4675                      .dwattr $C$DW$489, DW_AT_name("speedPole_rps")
    4676                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_speedPole_rps")
    4677                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4678                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4679              
    4680              $C$DW$490       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4682                      .dwattr $C$DW$490, DW_AT_name("dcBusPole_rps")
    4683                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4684                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4685                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4686              
    4687              $C$DW$491       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4689                      .dwattr $C$DW$491, DW_AT_name("fluxFraction")
    4690                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_fluxFraction")
    4691                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4692                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4693              
    4694              $C$DW$492       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   91

    4696                      .dwattr $C$DW$492, DW_AT_name("indEst_speedMaxFraction")
    4697                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4698                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4699                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4700              
    4701              $C$DW$493       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4703                      .dwattr $C$DW$493, DW_AT_name("powerWarpGain")
    4704                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_powerWarpGain")
    4705                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4706                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4707              
    4708              $C$DW$494       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    4710                      .dwattr $C$DW$494, DW_AT_name("systemFreq_MHz")
    4711                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4712                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4713                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4714              
    4715              $C$DW$495       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    4717                      .dwattr $C$DW$495, DW_AT_name("pwmPeriod_usec")
    4718                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4719                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4720                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4721              
    4722              $C$DW$496       .dwtag  DW_TAG_member
    4723                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4724                      .dwattr $C$DW$496, DW_AT_name("voltage_sf")
    4725                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_voltage_sf")
    4726                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4727                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4728              
    4729              $C$DW$497       .dwtag  DW_TAG_member
    4730                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4731                      .dwattr $C$DW$497, DW_AT_name("current_sf")
    4732                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_current_sf")
    4733                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4734                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4735              
    4736              $C$DW$498       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4738                      .dwattr $C$DW$498, DW_AT_name("voltageFilterPole_rps")
    4739                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4740                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4741                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4742              
    4743              $C$DW$499       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    4745                      .dwattr $C$DW$499, DW_AT_name("maxVsMag_pu")
    4746                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4747                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4748                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4749              
    4750              $C$DW$500       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   92

    4751                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    4752                      .dwattr $C$DW$500, DW_AT_name("estKappa")
    4753                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_estKappa")
    4754                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4755                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4756              
    4757              $C$DW$501       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$65)
    4759                      .dwattr $C$DW$501, DW_AT_name("motor_type")
    4760                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_motor_type")
    4761                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4762                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4763              
    4764              $C$DW$502       .dwtag  DW_TAG_member
    4765                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$53)
    4766                      .dwattr $C$DW$502, DW_AT_name("motor_numPolePairs")
    4767                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4768                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4769                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4770              
    4771              $C$DW$503       .dwtag  DW_TAG_member
    4772                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    4773                      .dwattr $C$DW$503, DW_AT_name("motor_ratedFlux")
    4774                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4775                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4776                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4777              
    4778              $C$DW$504       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    4780                      .dwattr $C$DW$504, DW_AT_name("motor_Rr")
    4781                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_motor_Rr")
    4782                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4783                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4784              
    4785              $C$DW$505       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    4787                      .dwattr $C$DW$505, DW_AT_name("motor_Rs")
    4788                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_motor_Rs")
    4789                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4790                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4791              
    4792              $C$DW$506       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    4794                      .dwattr $C$DW$506, DW_AT_name("motor_Ls_d")
    4795                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_motor_Ls_d")
    4796                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4797                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4798              
    4799              $C$DW$507       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    4801                      .dwattr $C$DW$507, DW_AT_name("motor_Ls_q")
    4802                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_motor_Ls_q")
    4803                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4804                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4805              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:32 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2078410                          PAGE   93

    4806              $C$DW$508       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    4808                      .dwattr $C$DW$508, DW_AT_name("maxCurrent")
    4809                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_maxCurrent")
    4810                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
