TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:29:52 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/adc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    3357                      .dwendtag $C$DW$T$61
    3358              
    3359              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3360                      .dwattr $C$DW$T$62, DW_AT_name("ADC_TempSensorSrc_e")
    3361                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3362                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3363              
    3364              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3365                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$62)
    3366              
    3367              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3368                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$343)
    3369              
    3370              
    3371              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    3372                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3373              $C$DW$344       .dwtag  DW_TAG_enumerator
    3374                      .dwattr $C$DW$344, DW_AT_name("ADC_VoltageRefSrc_Int")
    3375                      .dwattr $C$DW$344, DW_AT_const_value(0x00)
    3376              
    3377              $C$DW$345       .dwtag  DW_TAG_enumerator
    3378                      .dwattr $C$DW$345, DW_AT_name("ADC_VoltageRefSrc_Ext")
    3379                      .dwattr $C$DW$345, DW_AT_const_value(0x08)
    3380              
    3381                      .dwendtag $C$DW$T$64
    3382              
    3383              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3384                      .dwattr $C$DW$T$65, DW_AT_name("ADC_VoltageRefSrc_e")
    3385                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3386                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   64

    3387              
    3388              $C$DW$346       .dwtag  DW_TAG_TI_far_type
    3389                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$65)
    3390              
    3391              $C$DW$T$66      .dwtag  DW_TAG_const_type
    3392                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$346)
    3393              
    3394              
    3395              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    3396                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    3397              $C$DW$347       .dwtag  DW_TAG_enumerator
    3398                      .dwattr $C$DW$347, DW_AT_name("ADC_DivideSelect_ClkIn_by_1")
    3399                      .dwattr $C$DW$347, DW_AT_const_value(0x00)
    3400              
    3401              $C$DW$348       .dwtag  DW_TAG_enumerator
    3402                      .dwattr $C$DW$348, DW_AT_name("ADC_DivideSelect_ClkIn_by_2")
    3403                      .dwattr $C$DW$348, DW_AT_const_value(0x01)
    3404              
    3405                      .dwendtag $C$DW$T$67
    3406              
    3407              $C$DW$T$68      .dwtag  DW_TAG_typedef
    3408                      .dwattr $C$DW$T$68, DW_AT_name("ADC_DivideSelect_e")
    3409                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3410                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3411              
    3412              $C$DW$349       .dwtag  DW_TAG_TI_far_type
    3413                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$68)
    3414              
    3415              $C$DW$T$69      .dwtag  DW_TAG_const_type
    3416                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$349)
    3417              
    3418              
    3419              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    3420                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    3421              $C$DW$350       .dwtag  DW_TAG_enumerator
    3422                      .dwattr $C$DW$350, DW_AT_name("ADC_NoIntTriggersSOC")
    3423                      .dwattr $C$DW$350, DW_AT_const_value(0x00)
    3424              
    3425              $C$DW$351       .dwtag  DW_TAG_enumerator
    3426                      .dwattr $C$DW$351, DW_AT_name("ADC_Int1TriggersSOC")
    3427                      .dwattr $C$DW$351, DW_AT_const_value(0x01)
    3428              
    3429              $C$DW$352       .dwtag  DW_TAG_enumerator
    3430                      .dwattr $C$DW$352, DW_AT_name("ADC_Int2TriggersSOC")
    3431                      .dwattr $C$DW$352, DW_AT_const_value(0x02)
    3432              
    3433                      .dwendtag $C$DW$T$74
    3434              
    3435              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3436                      .dwattr $C$DW$T$75, DW_AT_name("ADC_IntTriggerSOC_e")
    3437                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3438                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3439              
    3440              $C$DW$353       .dwtag  DW_TAG_TI_far_type
    3441                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$75)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   65

    3442              
    3443              $C$DW$T$76      .dwtag  DW_TAG_const_type
    3444                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$353)
    3445              
    3446              
    3447              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3448                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    3449                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    3450              $C$DW$354       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    3452                      .dwattr $C$DW$354, DW_AT_name("ADCRESULT")
    3453                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_ADCRESULT")
    3454                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$355       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    3459                      .dwattr $C$DW$355, DW_AT_name("resvd_1")
    3460                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_resvd_1")
    3461                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3462                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464              $C$DW$356       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    3466                      .dwattr $C$DW$356, DW_AT_name("ADCCTL1")
    3467                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_ADCCTL1")
    3468                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3469                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3470              
    3471              $C$DW$357       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3473                      .dwattr $C$DW$357, DW_AT_name("ADCCTL2")
    3474                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCCTL2")
    3475                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3476                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3477              
    3478              $C$DW$358       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3480                      .dwattr $C$DW$358, DW_AT_name("rsvd_2")
    3481                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd_2")
    3482                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3483                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3484              
    3485              $C$DW$359       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    3487                      .dwattr $C$DW$359, DW_AT_name("ADCINTFLG")
    3488                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ADCINTFLG")
    3489                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3490                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3491              
    3492              $C$DW$360       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    3494                      .dwattr $C$DW$360, DW_AT_name("ADCINTFLGCLR")
    3495                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3496                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   66

    3497                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$361       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    3501                      .dwattr $C$DW$361, DW_AT_name("ADCINTOVF")
    3502                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCINTOVF")
    3503                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3504                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3505              
    3506              $C$DW$362       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    3508                      .dwattr $C$DW$362, DW_AT_name("ADCINTOVFCLR")
    3509                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3510                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3511                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3512              
    3513              $C$DW$363       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$24)
    3515                      .dwattr $C$DW$363, DW_AT_name("INTSELxNy")
    3516                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_INTSELxNy")
    3517                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3518                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3519              
    3520              $C$DW$364       .dwtag  DW_TAG_member
    3521                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$25)
    3522                      .dwattr $C$DW$364, DW_AT_name("rsvd_3")
    3523                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd_3")
    3524                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3525                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3526              
    3527              $C$DW$365       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    3529                      .dwattr $C$DW$365, DW_AT_name("SOCPRICTRL")
    3530                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3531                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3532                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3533              
    3534              $C$DW$366       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    3536                      .dwattr $C$DW$366, DW_AT_name("rsvd_4")
    3537                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_rsvd_4")
    3538                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3539                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$367       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    3543                      .dwattr $C$DW$367, DW_AT_name("ADCSAMPLEMODE")
    3544                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3545                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3546                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$368       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    3550                      .dwattr $C$DW$368, DW_AT_name("rsvd_5")
    3551                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   67

    3552                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3553                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3554              
    3555              $C$DW$369       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    3557                      .dwattr $C$DW$369, DW_AT_name("ADCINTSOCSEL1")
    3558                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3559                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3560                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$370       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    3564                      .dwattr $C$DW$370, DW_AT_name("ADCINTSOCSEL2")
    3565                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3566                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3567                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$371       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    3571                      .dwattr $C$DW$371, DW_AT_name("rsvd_6")
    3572                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd_6")
    3573                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3574                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576              $C$DW$372       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    3578                      .dwattr $C$DW$372, DW_AT_name("ADCSOCFLG1")
    3579                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3580                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3581                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$373       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    3585                      .dwattr $C$DW$373, DW_AT_name("rsvd_7")
    3586                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd_7")
    3587                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3588                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$374       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    3592                      .dwattr $C$DW$374, DW_AT_name("ADCSOCFRC1")
    3593                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3594                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3595                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3596              
    3597              $C$DW$375       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    3599                      .dwattr $C$DW$375, DW_AT_name("rsvd_8")
    3600                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd_8")
    3601                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3602                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$376       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    3606                      .dwattr $C$DW$376, DW_AT_name("ADCSOCOVF1")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   68

    3607                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3608                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3609                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3610              
    3611              $C$DW$377       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    3613                      .dwattr $C$DW$377, DW_AT_name("rsvd_9")
    3614                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_rsvd_9")
    3615                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3616                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$378       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    3620                      .dwattr $C$DW$378, DW_AT_name("ADCSOCOVFCLR1")
    3621                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3622                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3623                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$379       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    3627                      .dwattr $C$DW$379, DW_AT_name("rsvd_10")
    3628                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd_10")
    3629                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3630                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$380       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    3634                      .dwattr $C$DW$380, DW_AT_name("ADCSOCxCTL")
    3635                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3636                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3637                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$381       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    3641                      .dwattr $C$DW$381, DW_AT_name("rsvd_11")
    3642                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd_11")
    3643                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3644                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$382       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    3648                      .dwattr $C$DW$382, DW_AT_name("ADCREFTRIM")
    3649                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3650                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3651                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$383       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    3655                      .dwattr $C$DW$383, DW_AT_name("ADCOFFTRIM")
    3656                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3657                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3658                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$384       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   69

    3662                      .dwattr $C$DW$384, DW_AT_name("resvd_12")
    3663                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_resvd_12")
    3664                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3665                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$385       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    3669                      .dwattr $C$DW$385, DW_AT_name("ADCREV")
    3670                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ADCREV")
    3671                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3672                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674                      .dwendtag $C$DW$T$27
    3675              
    3676              $C$DW$T$77      .dwtag  DW_TAG_typedef
    3677                      .dwattr $C$DW$T$77, DW_AT_name("ADC_Obj")
    3678                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    3679                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3680              
    3681              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3682                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    3683                      .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3684              
    3685              $C$DW$T$71      .dwtag  DW_TAG_typedef
    3686                      .dwattr $C$DW$T$71, DW_AT_name("ADC_Handle")
    3687                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3688                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3689              
    3690              $C$DW$386       .dwtag  DW_TAG_TI_far_type
    3691                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$71)
    3692              
    3693              $C$DW$T$78      .dwtag  DW_TAG_const_type
    3694                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$386)
    3695              
    3696              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3697                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3698              
    3699              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3700                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3701                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3702              
    3703              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3704                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3705                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3706                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3707              
    3708              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3709                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3710                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3711                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3712              
    3713              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3714                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3715                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3716                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0280810                          PAGE   70

    3717              
    3718              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3719                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3720                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3721                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3722              
    3723              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3724                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3725                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3726                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3727              
    3728              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3729                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3730                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3731                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3732              
    3733              $C$DW$T$10      .dwtag  DW_TAG_base_type
