TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4410010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:01:40 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/cap.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    1169                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$32)
    1170              
    1171              $C$DW$T$33      .dwtag  DW_TAG_const_type
    1172                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$90)
    1173              
    1174              
    1175              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    1176                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1177              $C$DW$91        .dwtag  DW_TAG_enumerator
    1178                      .dwattr $C$DW$91, DW_AT_name("CAP_Reset_Disable")
    1179                      .dwattr $C$DW$91, DW_AT_const_value(0x00)
    1180              
    1181              $C$DW$92        .dwtag  DW_TAG_enumerator
    1182                      .dwattr $C$DW$92, DW_AT_name("CAP_Reset_Enable")
    1183                      .dwattr $C$DW$92, DW_AT_const_value(0x01)
    1184              
    1185                      .dwendtag $C$DW$T$34
    1186              
    1187              $C$DW$T$35      .dwtag  DW_TAG_typedef
    1188                      .dwattr $C$DW$T$35, DW_AT_name("CAP_Reset_e")
    1189                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1190                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1191              
    1192              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    1193                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$35)
    1194              
    1195              $C$DW$T$36      .dwtag  DW_TAG_const_type
    1196                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$93)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4410010                          PAGE   23

    1197              
    1198              
    1199              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1200                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1201              $C$DW$94        .dwtag  DW_TAG_enumerator
    1202                      .dwattr $C$DW$94, DW_AT_name("CAP_Stop_Wrap_CEVT1")
    1203                      .dwattr $C$DW$94, DW_AT_const_value(0x00)
    1204              
    1205              $C$DW$95        .dwtag  DW_TAG_enumerator
    1206                      .dwattr $C$DW$95, DW_AT_name("CAP_Stop_Wrap_CEVT2")
    1207                      .dwattr $C$DW$95, DW_AT_const_value(0x02)
    1208              
    1209              $C$DW$96        .dwtag  DW_TAG_enumerator
    1210                      .dwattr $C$DW$96, DW_AT_name("CAP_Stop_Wrap_CEVT3")
    1211                      .dwattr $C$DW$96, DW_AT_const_value(0x04)
    1212              
    1213              $C$DW$97        .dwtag  DW_TAG_enumerator
    1214                      .dwattr $C$DW$97, DW_AT_name("CAP_Stop_Wrap_CEVT4")
    1215                      .dwattr $C$DW$97, DW_AT_const_value(0x06)
    1216              
    1217                      .dwendtag $C$DW$T$37
    1218              
    1219              $C$DW$T$38      .dwtag  DW_TAG_typedef
    1220                      .dwattr $C$DW$T$38, DW_AT_name("CAP_Stop_Wrap_e")
    1221                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1222                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1223              
    1224              $C$DW$98        .dwtag  DW_TAG_TI_far_type
    1225                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$38)
    1226              
    1227              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1228                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$98)
    1229              
    1230              
    1231              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    1232                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1233              $C$DW$99        .dwtag  DW_TAG_enumerator
    1234                      .dwattr $C$DW$99, DW_AT_name("CAP_SyncOut_SyncIn")
    1235                      .dwattr $C$DW$99, DW_AT_const_value(0x00)
    1236              
    1237              $C$DW$100       .dwtag  DW_TAG_enumerator
    1238                      .dwattr $C$DW$100, DW_AT_name("CAP_SyncOut_CTRPRD")
    1239                      .dwattr $C$DW$100, DW_AT_const_value(0x40)
    1240              
    1241              $C$DW$101       .dwtag  DW_TAG_enumerator
    1242                      .dwattr $C$DW$101, DW_AT_name("CAP_SyncOut_Disable")
    1243                      .dwattr $C$DW$101, DW_AT_const_value(0x80)
    1244              
    1245                      .dwendtag $C$DW$T$40
    1246              
    1247              $C$DW$T$41      .dwtag  DW_TAG_typedef
    1248                      .dwattr $C$DW$T$41, DW_AT_name("CAP_SyncOut_e")
    1249                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1250                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1251              
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4410010                          PAGE   24

    1252              $C$DW$102       .dwtag  DW_TAG_TI_far_type
    1253                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$41)
    1254              
    1255              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1256                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$102)
    1257              
    1258              
    1259              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1260                      .dwattr $C$DW$T$24, DW_AT_name("_CAP_Obj_")
    1261                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1a)
    1262              $C$DW$103       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1264                      .dwattr $C$DW$103, DW_AT_name("TSCTR")
    1265                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_TSCTR")
    1266                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$104       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1271                      .dwattr $C$DW$104, DW_AT_name("CTRPHS")
    1272                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CTRPHS")
    1273                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1274                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$105       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1278                      .dwattr $C$DW$105, DW_AT_name("CAP1")
    1279                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CAP1")
    1280                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1281                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283              $C$DW$106       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1285                      .dwattr $C$DW$106, DW_AT_name("CAP2")
    1286                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CAP2")
    1287                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1288                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$107       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1292                      .dwattr $C$DW$107, DW_AT_name("CAP3")
    1293                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CAP3")
    1294                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1295                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$108       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1299                      .dwattr $C$DW$108, DW_AT_name("CAP4")
    1300                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CAP4")
    1301                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1302                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$109       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$23)
    1306                      .dwattr $C$DW$109, DW_AT_name("Rsvd_1")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4410010                          PAGE   25

    1307                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Rsvd_1")
    1308                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1309                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$110       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1313                      .dwattr $C$DW$110, DW_AT_name("ECCTL1")
    1314                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ECCTL1")
    1315                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1316                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$111       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1320                      .dwattr $C$DW$111, DW_AT_name("ECCTL2")
    1321                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ECCTL2")
    1322                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1323                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$112       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1327                      .dwattr $C$DW$112, DW_AT_name("ECEINT")
    1328                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_ECEINT")
    1329                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1330                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$113       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
    1334                      .dwattr $C$DW$113, DW_AT_name("ECEFLG")
    1335                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_ECEFLG")
    1336                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1337                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$114       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1341                      .dwattr $C$DW$114, DW_AT_name("ECECLR")
    1342                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_ECECLR")
    1343                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1344                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$115       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1348                      .dwattr $C$DW$115, DW_AT_name("ECEFRC")
    1349                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ECEFRC")
    1350                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1351                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353                      .dwendtag $C$DW$T$24
    1354              
    1355              $C$DW$T$43      .dwtag  DW_TAG_typedef
    1356                      .dwattr $C$DW$T$43, DW_AT_name("CAP_Obj")
    1357                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$24)
    1358                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1359              
    1360              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1361                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4410010                          PAGE   26

    1362                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    1363              
    1364              $C$DW$T$45      .dwtag  DW_TAG_typedef
    1365                      .dwattr $C$DW$T$45, DW_AT_name("CAP_Handle")
    1366                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1367                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1368              
    1369              $C$DW$116       .dwtag  DW_TAG_TI_far_type
    1370                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$45)
    1371              
    1372              $C$DW$T$46      .dwtag  DW_TAG_const_type
    1373                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$116)
    1374              
    1375              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1376                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1377              
    1378              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1379                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1380                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1381              
    1382              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1383                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1384                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1385                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1386              
    1387              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1388                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1389                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1390                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1391              
    1392              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1393                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1394                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1395                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1396              
    1397              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1398                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1399                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1400                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1401              
    1402              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1403                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1404                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1405                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1406              
    1407              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1408                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1409                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1410                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1411              
    1412              $C$DW$T$10      .dwtag  DW_TAG_base_type
