TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:42 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4588011                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:01:42 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/clk.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    3030                      .dwattr $C$DW$222, DW_AT_name("CLK_Timer2PreScaler_by_1")
    3031                      .dwattr $C$DW$222, DW_AT_const_value(0x00)
    3032              
    3033              $C$DW$223       .dwtag  DW_TAG_enumerator
    3034                      .dwattr $C$DW$223, DW_AT_name("CLK_Timer2PreScaler_by_2")
    3035                      .dwattr $C$DW$223, DW_AT_const_value(0x20)
    3036              
    3037              $C$DW$224       .dwtag  DW_TAG_enumerator
    3038                      .dwattr $C$DW$224, DW_AT_name("CLK_Timer2PreScaler_by_4")
    3039                      .dwattr $C$DW$224, DW_AT_const_value(0x40)
    3040              
    3041              $C$DW$225       .dwtag  DW_TAG_enumerator
    3042                      .dwattr $C$DW$225, DW_AT_name("CLK_Timer2PreScaler_by_8")
    3043                      .dwattr $C$DW$225, DW_AT_const_value(0x60)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:42 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4588011                          PAGE   57

    3044              
    3045              $C$DW$226       .dwtag  DW_TAG_enumerator
    3046                      .dwattr $C$DW$226, DW_AT_name("CLK_Timer2PreScaler_by_16")
    3047                      .dwattr $C$DW$226, DW_AT_const_value(0x80)
    3048              
    3049                      .dwendtag $C$DW$T$48
    3050              
    3051              $C$DW$T$49      .dwtag  DW_TAG_typedef
    3052                      .dwattr $C$DW$T$49, DW_AT_name("CLK_Timer2PreScaler_e")
    3053                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3054                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3055              
    3056              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    3057                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$49)
    3058              
    3059              $C$DW$T$50      .dwtag  DW_TAG_const_type
    3060                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$227)
    3061              
    3062              
    3063              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    3064                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3065              $C$DW$228       .dwtag  DW_TAG_enumerator
    3066                      .dwattr $C$DW$228, DW_AT_name("CLK_Timer2Src_SysClk")
    3067                      .dwattr $C$DW$228, DW_AT_const_value(0x00)
    3068              
    3069              $C$DW$229       .dwtag  DW_TAG_enumerator
    3070                      .dwattr $C$DW$229, DW_AT_name("CLK_Timer2Src_ExtOsc")
    3071                      .dwattr $C$DW$229, DW_AT_const_value(0x08)
    3072              
    3073              $C$DW$230       .dwtag  DW_TAG_enumerator
    3074                      .dwattr $C$DW$230, DW_AT_name("CLK_Timer2Src_IntOsc1")
    3075                      .dwattr $C$DW$230, DW_AT_const_value(0x10)
    3076              
    3077              $C$DW$231       .dwtag  DW_TAG_enumerator
    3078                      .dwattr $C$DW$231, DW_AT_name("CLK_Timer2Src_IntOsc2")
    3079                      .dwattr $C$DW$231, DW_AT_const_value(0x18)
    3080              
    3081                      .dwendtag $C$DW$T$51
    3082              
    3083              $C$DW$T$52      .dwtag  DW_TAG_typedef
    3084                      .dwattr $C$DW$T$52, DW_AT_name("CLK_Timer2Src_e")
    3085                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3086                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3087              
    3088              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    3089                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$52)
    3090              
    3091              $C$DW$T$53      .dwtag  DW_TAG_const_type
    3092                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$232)
    3093              
    3094              
    3095              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    3096                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    3097              $C$DW$233       .dwtag  DW_TAG_enumerator
    3098                      .dwattr $C$DW$233, DW_AT_name("CLK_WdClkSrc_IntOsc1")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:42 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4588011                          PAGE   58

    3099                      .dwattr $C$DW$233, DW_AT_const_value(0x00)
    3100              
    3101              $C$DW$234       .dwtag  DW_TAG_enumerator
    3102                      .dwattr $C$DW$234, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2")
    3103                      .dwattr $C$DW$234, DW_AT_const_value(0x04)
    3104              
    3105                      .dwendtag $C$DW$T$54
    3106              
    3107              $C$DW$T$55      .dwtag  DW_TAG_typedef
    3108                      .dwattr $C$DW$T$55, DW_AT_name("CLK_WdClkSrc_e")
    3109                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3110                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3111              
    3112              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    3113                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$55)
    3114              
    3115              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3116                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$235)
    3117              
    3118              
    3119              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3120                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_Obj_")
    3121                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x11)
    3122              $C$DW$236       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    3124                      .dwattr $C$DW$236, DW_AT_name("XCLK")
    3125                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_XCLK")
    3126                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3128              
    3129              $C$DW$237       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    3131                      .dwattr $C$DW$237, DW_AT_name("rsvd_1")
    3132                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd_1")
    3133                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3134                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3135              
    3136              $C$DW$238       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    3138                      .dwattr $C$DW$238, DW_AT_name("CLKCTL")
    3139                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_CLKCTL")
    3140                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3141                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3142              
    3143              $C$DW$239       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$21)
    3145                      .dwattr $C$DW$239, DW_AT_name("rsvd_2")
    3146                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd_2")
    3147                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3148                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3149              
    3150              $C$DW$240       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    3152                      .dwattr $C$DW$240, DW_AT_name("LOSPCP")
    3153                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:42 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4588011                          PAGE   59

    3154                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3155                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3156              
    3157              $C$DW$241       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    3159                      .dwattr $C$DW$241, DW_AT_name("PCLKCR0")
    3160                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR0")
    3161                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3162                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3163              
    3164              $C$DW$242       .dwtag  DW_TAG_member
    3165                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    3166                      .dwattr $C$DW$242, DW_AT_name("PCLKCR1")
    3167                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR1")
    3168                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3169                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3170              
    3171              $C$DW$243       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$22)
    3173                      .dwattr $C$DW$243, DW_AT_name("rsvd_3")
    3174                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd_3")
    3175                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3176                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3177              
    3178              $C$DW$244       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    3180                      .dwattr $C$DW$244, DW_AT_name("PCLKCR3")
    3181                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR3")
    3182                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3183                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3184              
    3185                      .dwendtag $C$DW$T$23
    3186              
    3187              $C$DW$T$57      .dwtag  DW_TAG_typedef
    3188                      .dwattr $C$DW$T$57, DW_AT_name("CLK_Obj")
    3189                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    3190                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3191              
    3192              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3193                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    3194                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    3195              
    3196              $C$DW$T$59      .dwtag  DW_TAG_typedef
    3197                      .dwattr $C$DW$T$59, DW_AT_name("CLK_Handle")
    3198                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3199                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3200              
    3201              $C$DW$245       .dwtag  DW_TAG_TI_far_type
    3202                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$59)
    3203              
    3204              $C$DW$T$60      .dwtag  DW_TAG_const_type
    3205                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$245)
    3206              
    3207              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3208                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:42 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4588011                          PAGE   60

    3209              
    3210              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3211                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3212                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3213              
    3214              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3215                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3216                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3217                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3218              
    3219              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3220                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3221                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3222                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3223              
    3224              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3225                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3226                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3227                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3228              
    3229              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3230                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3231                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3232                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3233              
    3234              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3235                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3236                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3237                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3238              
    3239              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3240                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3241                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3242                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3243              
    3244              $C$DW$T$10      .dwtag  DW_TAG_base_type
