TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:29:56 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/comp.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

     250 00000013 1AC4          OR        *+XAR4[0],#0x0002     ; [CPU_] |82| 
         00000014 0002 
     251 00000015 761A   EDIS
     252 00000016 FF69          SPM       #0                    ; [CPU_] 
     253              $C$DW$17        .dwtag  DW_TAG_TI_branch
     254                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     255                      .dwattr $C$DW$17, DW_AT_TI_return
     256              
     257 00000017 0006          LRETR     ; [CPU_] 
     258                      ; return occurs ; [] 
     259                      .dwattr $C$DW$14, DW_AT_TI_end_file("../drivers/source/comp.c")
     260                      .dwattr $C$DW$14, DW_AT_TI_end_line(0x57)
     261                      .dwattr $C$DW$14, DW_AT_TI_end_column(0x01)
     262                      .dwendentry
     263                      .dwendtag $C$DW$14
     264              
     265 00000018               .sect   ".text"
     266                      .clink
     267                      .global _COMP_disable
     268              
     269              $C$DW$18        .dwtag  DW_TAG_subprogram
     270                      .dwattr $C$DW$18, DW_AT_name("COMP_disable")
     271                      .dwattr $C$DW$18, DW_AT_low_pc(_COMP_disable)
     272                      .dwattr $C$DW$18, DW_AT_high_pc(0x00)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE    6

     273                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_COMP_disable")
     274                      .dwattr $C$DW$18, DW_AT_external
     275                      .dwattr $C$DW$18, DW_AT_TI_begin_file("../drivers/source/comp.c")
     276                      .dwattr $C$DW$18, DW_AT_TI_begin_line(0x3c)
     277                      .dwattr $C$DW$18, DW_AT_TI_begin_column(0x06)
     278                      .dwattr $C$DW$18, DW_AT_TI_max_frame_size(-2)
     279                      .dwpsn  file "../drivers/source/comp.c",line 61,column 1,is_stmt,address _COMP_disable,isa 0
     280              
     281                      .dwfde $C$DW$CIE, _COMP_disable
     282              $C$DW$19        .dwtag  DW_TAG_formal_parameter
     283                      .dwattr $C$DW$19, DW_AT_name("compHandle")
     284                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_compHandle")
     285                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
     286                      .dwattr $C$DW$19, DW_AT_location[DW_OP_reg12]
     287              
     288              
     289              ;***************************************************************
     290              ;* FNAME: _COMP_disable                 FR SIZE:   0           *
     291              ;*                                                             *
     292              ;* FUNCTION ENVIRONMENT                                        *
     293              ;*                                                             *
     294              ;* FUNCTION PROPERTIES                                         *
     295              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     296              ;***************************************************************
     297              
     298              _COMP_disable:
     299              ;* AR4   assigned to _compHandle
     300              $C$DW$20        .dwtag  DW_TAG_variable
     301                      .dwattr $C$DW$20, DW_AT_name("compHandle")
     302                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_compHandle")
     303                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$25)
     304                      .dwattr $C$DW$20, DW_AT_location[DW_OP_reg12]
     305              
     306                      .dwcfi  cfa_offset, -2
     307                      .dwcfi  save_reg_to_mem, 26, 0
     308 00000018 7622   EALLOW
     309                      .dwpsn  file "../drivers/source/comp.c",line 67,column 5,is_stmt,isa 0
     310 00000019 18C4          AND       *+XAR4[0],#0xfffe     ; [CPU_] |67| 
         0000001a FFFE 
     311 0000001b 761A   EDIS
     312 0000001c FF69          SPM       #0                    ; [CPU_] 
     313              $C$DW$21        .dwtag  DW_TAG_TI_branch
     314                      .dwattr $C$DW$21, DW_AT_low_pc(0x00)
     315                      .dwattr $C$DW$21, DW_AT_TI_return
     316              
     317 0000001d 0006          LRETR     ; [CPU_] 
     318                      ; return occurs ; [] 
     319                      .dwattr $C$DW$18, DW_AT_TI_end_file("../drivers/source/comp.c")
     320                      .dwattr $C$DW$18, DW_AT_TI_end_line(0x48)
     321                      .dwattr $C$DW$18, DW_AT_TI_end_column(0x01)
     322                      .dwendentry
     323                      .dwendtag $C$DW$18
     324              
     325              
     326              ;***************************************************************
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE    7

     327              ;* TYPE INFORMATION                                            *
     328              ;***************************************************************
     329              
     330              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     331                      .dwattr $C$DW$T$21, DW_AT_name("_COMP_Obj_")
     332                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x11)
     333              $C$DW$22        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     335                      .dwattr $C$DW$22, DW_AT_name("COMPCTL")
     336                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_COMPCTL")
     337                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     338                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     339              
     340              $C$DW$23        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     342                      .dwattr $C$DW$23, DW_AT_name("rsvd_1")
     343                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd_1")
     344                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     345                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     346              
     347              $C$DW$24        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     349                      .dwattr $C$DW$24, DW_AT_name("COMPSTS")
     350                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_COMPSTS")
     351                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     352                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     353              
     354              $C$DW$25        .dwtag  DW_TAG_member
     355                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     356                      .dwattr $C$DW$25, DW_AT_name("rsvd_2")
     357                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd_2")
     358                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     359                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     360              
     361              $C$DW$26        .dwtag  DW_TAG_member
     362                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     363                      .dwattr $C$DW$26, DW_AT_name("DACCTL")
     364                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_DACCTL")
     365                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     366                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     367              
     368              $C$DW$27        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
     370                      .dwattr $C$DW$27, DW_AT_name("rsvd_3")
     371                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd_3")
     372                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     373                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     374              
     375              $C$DW$28        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     377                      .dwattr $C$DW$28, DW_AT_name("DACVAL")
     378                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_DACVAL")
     379                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     380                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     381              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE    8

     382              $C$DW$29        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     384                      .dwattr $C$DW$29, DW_AT_name("rsvd_4")
     385                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd_4")
     386                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     387                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$30        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     391                      .dwattr $C$DW$30, DW_AT_name("RAMPMAXREF_ACTIVE")
     392                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_RAMPMAXREF_ACTIVE")
     393                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     394                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396              $C$DW$31        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     398                      .dwattr $C$DW$31, DW_AT_name("rsvd_5")
     399                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd_5")
     400                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     401                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403              $C$DW$32        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     405                      .dwattr $C$DW$32, DW_AT_name("RAMPMAXREF_SHADOW")
     406                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_RAMPMAXREF_SHADOW")
     407                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     408                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     409              
     410              $C$DW$33        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     412                      .dwattr $C$DW$33, DW_AT_name("rsvd_6")
     413                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd_6")
     414                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     415                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417              $C$DW$34        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$20)
     419                      .dwattr $C$DW$34, DW_AT_name("RAMPDECVAL_ACTIVE")
     420                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_RAMPDECVAL_ACTIVE")
     421                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     422                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     423              
     424              $C$DW$35        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$20)
     426                      .dwattr $C$DW$35, DW_AT_name("rsvd_7")
     427                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd_7")
     428                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     429                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$36        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
     433                      .dwattr $C$DW$36, DW_AT_name("RAMPDECVAL_SHADOW")
     434                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_RAMPDECVAL_SHADOW")
     435                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     436                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE    9

     437              
     438              $C$DW$37        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     440                      .dwattr $C$DW$37, DW_AT_name("rsvd_8")
     441                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd_8")
     442                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     443                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$38        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     447                      .dwattr $C$DW$38, DW_AT_name("RAMPSTS")
     448                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_RAMPSTS")
     449                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     450                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452                      .dwendtag $C$DW$T$21
     453              
     454              $C$DW$T$22      .dwtag  DW_TAG_typedef
     455                      .dwattr $C$DW$T$22, DW_AT_name("COMP_Obj")
     456                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     457                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     458              
     459              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     460                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     461                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     462              
     463              $C$DW$T$24      .dwtag  DW_TAG_typedef
     464                      .dwattr $C$DW$T$24, DW_AT_name("COMP_Handle")
     465                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     466                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     467              
     468              $C$DW$39        .dwtag  DW_TAG_TI_far_type
     469                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$24)
     470              
     471              $C$DW$T$25      .dwtag  DW_TAG_const_type
     472                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$39)
     473              
     474              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     475                      .dwattr $C$DW$T$2, DW_AT_name("void")
     476              
     477              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     478                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     479                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     480              
     481              $C$DW$T$4       .dwtag  DW_TAG_base_type
     482                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     483                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     484                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     485              
     486              $C$DW$T$5       .dwtag  DW_TAG_base_type
     487                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     488                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     489                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     490              
     491              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:56 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\1203210                          PAGE   10

     492                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     493                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     494                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     495              
     496              $C$DW$T$7       .dwtag  DW_TAG_base_type
     497                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     498                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     499                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     500              
     501              $C$DW$T$8       .dwtag  DW_TAG_base_type
     502                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     503                      .dwattr $C$DW$T$8, DW_AT_name("short")
     504                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     505              
     506              $C$DW$T$9       .dwtag  DW_TAG_base_type
     507                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     508                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     509                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     510              
     511              $C$DW$T$10      .dwtag  DW_TAG_base_type
