TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:29:58 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    4105              $C$DW$365       .dwtag  DW_TAG_enumerator
    4106                      .dwattr $C$DW$365, DW_AT_name("DRV8301_RegName_Status_1")
    4107                      .dwattr $C$DW$365, DW_AT_const_value(0x00)
    4108              
    4109              $C$DW$366       .dwtag  DW_TAG_enumerator
    4110                      .dwattr $C$DW$366, DW_AT_name("DRV8301_RegName_Status_2")
    4111                      .dwattr $C$DW$366, DW_AT_const_value(0x800)
    4112              
    4113              $C$DW$367       .dwtag  DW_TAG_enumerator
    4114                      .dwattr $C$DW$367, DW_AT_name("DRV8301_RegName_Control_1")
    4115                      .dwattr $C$DW$367, DW_AT_const_value(0x1000)
    4116              
    4117              $C$DW$368       .dwtag  DW_TAG_enumerator
    4118                      .dwattr $C$DW$368, DW_AT_name("DRV8301_RegName_Control_2")
    4119                      .dwattr $C$DW$368, DW_AT_const_value(0x1800)
    4120              
    4121                      .dwendtag $C$DW$T$106
    4122              
    4123              $C$DW$T$107     .dwtag  DW_TAG_typedef
    4124                      .dwattr $C$DW$T$107, DW_AT_name("DRV8301_RegName_e")
    4125                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    4126                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4127              
    4128              $C$DW$369       .dwtag  DW_TAG_TI_far_type
    4129                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$107)
    4130              
    4131              $C$DW$T$108     .dwtag  DW_TAG_const_type
    4132                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$369)
    4133              
    4134              
    4135              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    4136                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    4137              $C$DW$370       .dwtag  DW_TAG_enumerator
    4138                      .dwattr $C$DW$370, DW_AT_name("DRV8301_FaultType_NoFault")
    4139                      .dwattr $C$DW$370, DW_AT_const_value(0x00)
    4140              
    4141              $C$DW$371       .dwtag  DW_TAG_enumerator
    4142                      .dwattr $C$DW$371, DW_AT_name("DRV8301_FaultType_FETLC_OC")
    4143                      .dwattr $C$DW$371, DW_AT_const_value(0x01)
    4144              
    4145              $C$DW$372       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   79

    4146                      .dwattr $C$DW$372, DW_AT_name("DRV8301_FaultType_FETHC_OC")
    4147                      .dwattr $C$DW$372, DW_AT_const_value(0x02)
    4148              
    4149              $C$DW$373       .dwtag  DW_TAG_enumerator
    4150                      .dwattr $C$DW$373, DW_AT_name("DRV8301_FaultType_FETLB_OC")
    4151                      .dwattr $C$DW$373, DW_AT_const_value(0x04)
    4152              
    4153              $C$DW$374       .dwtag  DW_TAG_enumerator
    4154                      .dwattr $C$DW$374, DW_AT_name("DRV8301_FaultType_FETHB_OC")
    4155                      .dwattr $C$DW$374, DW_AT_const_value(0x08)
    4156              
    4157              $C$DW$375       .dwtag  DW_TAG_enumerator
    4158                      .dwattr $C$DW$375, DW_AT_name("DRV8301_FaultType_FETLA_OC")
    4159                      .dwattr $C$DW$375, DW_AT_const_value(0x10)
    4160              
    4161              $C$DW$376       .dwtag  DW_TAG_enumerator
    4162                      .dwattr $C$DW$376, DW_AT_name("DRV8301_FaultType_FETHA_OC")
    4163                      .dwattr $C$DW$376, DW_AT_const_value(0x20)
    4164              
    4165              $C$DW$377       .dwtag  DW_TAG_enumerator
    4166                      .dwattr $C$DW$377, DW_AT_name("DRV8301_FaultType_OTW")
    4167                      .dwattr $C$DW$377, DW_AT_const_value(0x40)
    4168              
    4169              $C$DW$378       .dwtag  DW_TAG_enumerator
    4170                      .dwattr $C$DW$378, DW_AT_name("DRV8301_FaultType_OTSD")
    4171                      .dwattr $C$DW$378, DW_AT_const_value(0x80)
    4172              
    4173              $C$DW$379       .dwtag  DW_TAG_enumerator
    4174                      .dwattr $C$DW$379, DW_AT_name("DRV8301_FaultType_PVDD_UV")
    4175                      .dwattr $C$DW$379, DW_AT_const_value(0x100)
    4176              
    4177              $C$DW$380       .dwtag  DW_TAG_enumerator
    4178                      .dwattr $C$DW$380, DW_AT_name("DRV8301_FaultType_GVDD_UV")
    4179                      .dwattr $C$DW$380, DW_AT_const_value(0x200)
    4180              
    4181              $C$DW$381       .dwtag  DW_TAG_enumerator
    4182                      .dwattr $C$DW$381, DW_AT_name("DRV8301_FaultType_GVDD_OV")
    4183                      .dwattr $C$DW$381, DW_AT_const_value(0x400)
    4184              
    4185                      .dwendtag $C$DW$T$109
    4186              
    4187              $C$DW$T$110     .dwtag  DW_TAG_typedef
    4188                      .dwattr $C$DW$T$110, DW_AT_name("DRV8301_FaultType_e")
    4189                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    4190                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    4191              
    4192              
    4193              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4194                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    4195                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    4196              $C$DW$382       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    4198                      .dwattr $C$DW$382, DW_AT_name("spiHandle")
    4199                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_spiHandle")
    4200                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   80

    4201                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4202              
    4203              $C$DW$383       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$22)
    4205                      .dwattr $C$DW$383, DW_AT_name("gpioHandle")
    4206                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_gpioHandle")
    4207                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4208                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4209              
    4210              $C$DW$384       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    4212                      .dwattr $C$DW$384, DW_AT_name("gpioNumber")
    4213                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_gpioNumber")
    4214                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4215                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4216              
    4217              $C$DW$385       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$25)
    4219                      .dwattr $C$DW$385, DW_AT_name("RxTimeOut")
    4220                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_RxTimeOut")
    4221                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4222                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4223              
    4224              $C$DW$386       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$25)
    4226                      .dwattr $C$DW$386, DW_AT_name("enableTimeOut")
    4227                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_enableTimeOut")
    4228                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4229                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4230              
    4231                      .dwendtag $C$DW$T$26
    4232              
    4233              $C$DW$T$113     .dwtag  DW_TAG_typedef
    4234                      .dwattr $C$DW$T$113, DW_AT_name("DRV8301_Obj")
    4235                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$26)
    4236                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    4237              
    4238              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    4239                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    4240                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    4241              
    4242              $C$DW$T$70      .dwtag  DW_TAG_typedef
    4243                      .dwattr $C$DW$T$70, DW_AT_name("DRV8301_Handle")
    4244                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4245                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4246              
    4247              $C$DW$387       .dwtag  DW_TAG_TI_far_type
    4248                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$70)
    4249              
    4250              $C$DW$T$114     .dwtag  DW_TAG_const_type
    4251                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$387)
    4252              
    4253              
    4254              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4255                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   81

    4256                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    4257              $C$DW$388       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$28)
    4259                      .dwattr $C$DW$388, DW_AT_name("DRV8301_CURRENT")
    4260                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4261                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4262                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4263              
    4264              $C$DW$389       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$30)
    4266                      .dwattr $C$DW$389, DW_AT_name("DRV8301_RESET")
    4267                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4268                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4269                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4270              
    4271              $C$DW$390       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$32)
    4273                      .dwattr $C$DW$390, DW_AT_name("PWM_MODE")
    4274                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_PWM_MODE")
    4275                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4276                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4277              
    4278              $C$DW$391       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$34)
    4280                      .dwattr $C$DW$391, DW_AT_name("OC_MODE")
    4281                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_OC_MODE")
    4282                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4283                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4284              
    4285              $C$DW$392       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$36)
    4287                      .dwattr $C$DW$392, DW_AT_name("OC_ADJ_SET")
    4288                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4289                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4290                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4291              
    4292                      .dwendtag $C$DW$T$37
    4293              
    4294              $C$DW$T$52      .dwtag  DW_TAG_typedef
    4295                      .dwattr $C$DW$T$52, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4296                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    4297                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4298              
    4299              
    4300              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4301                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4302                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    4303              $C$DW$393       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$39)
    4305                      .dwattr $C$DW$393, DW_AT_name("OCTW_SET")
    4306                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_OCTW_SET")
    4307                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4308                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4309              
    4310              $C$DW$394       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   82

    4311                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$41)
    4312                      .dwattr $C$DW$394, DW_AT_name("GAIN")
    4313                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_GAIN")
    4314                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4315                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4316              
    4317              $C$DW$395       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$43)
    4319                      .dwattr $C$DW$395, DW_AT_name("DC_CAL_CH1p2")
    4320                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4321                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4322                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4323              
    4324              $C$DW$396       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$45)
    4326                      .dwattr $C$DW$396, DW_AT_name("OC_TOFF")
    4327                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_OC_TOFF")
    4328                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4329                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4330              
    4331                      .dwendtag $C$DW$T$46
    4332              
    4333              $C$DW$T$53      .dwtag  DW_TAG_typedef
    4334                      .dwattr $C$DW$T$53, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4335                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$46)
    4336                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4337              
    4338              
    4339              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4340                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4341                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    4342              $C$DW$397       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4344                      .dwattr $C$DW$397, DW_AT_name("FAULT")
    4345                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_FAULT")
    4346                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4347                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4348              
    4349              $C$DW$398       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4351                      .dwattr $C$DW$398, DW_AT_name("GVDD_UV")
    4352                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GVDD_UV")
    4353                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4354                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4355              
    4356              $C$DW$399       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4358                      .dwattr $C$DW$399, DW_AT_name("PVDD_UV")
    4359                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_PVDD_UV")
    4360                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4361                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4362              
    4363              $C$DW$400       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4365                      .dwattr $C$DW$400, DW_AT_name("OTSD")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   83

    4366                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_OTSD")
    4367                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4368                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4369              
    4370              $C$DW$401       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    4372                      .dwattr $C$DW$401, DW_AT_name("OTW")
    4373                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_OTW")
    4374                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4375                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4376              
    4377              $C$DW$402       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    4379                      .dwattr $C$DW$402, DW_AT_name("FETHA_OC")
    4380                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_FETHA_OC")
    4381                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4382                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4383              
    4384              $C$DW$403       .dwtag  DW_TAG_member
    4385                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$25)
    4386                      .dwattr $C$DW$403, DW_AT_name("FETLA_OC")
    4387                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_FETLA_OC")
    4388                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4389                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4390              
    4391              $C$DW$404       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$25)
    4393                      .dwattr $C$DW$404, DW_AT_name("FETHB_OC")
    4394                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_FETHB_OC")
    4395                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4396                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4397              
    4398              $C$DW$405       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$25)
    4400                      .dwattr $C$DW$405, DW_AT_name("FETLB_OC")
    4401                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_FETLB_OC")
    4402                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4403                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4404              
    4405              $C$DW$406       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$25)
    4407                      .dwattr $C$DW$406, DW_AT_name("FETHC_OC")
    4408                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_FETHC_OC")
    4409                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4410                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4411              
    4412              $C$DW$407       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$25)
    4414                      .dwattr $C$DW$407, DW_AT_name("FETLC_OC")
    4415                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_FETLC_OC")
    4416                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4417                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4418              
    4419                      .dwendtag $C$DW$T$47
    4420              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   84

    4421              $C$DW$T$50      .dwtag  DW_TAG_typedef
    4422                      .dwattr $C$DW$T$50, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4423                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$47)
    4424                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4425              
    4426              
    4427              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4428                      .dwattr $C$DW$T$49, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4429                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    4430              $C$DW$408       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$25)
    4432                      .dwattr $C$DW$408, DW_AT_name("GVDD_OV")
    4433                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GVDD_OV")
    4434                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4435                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4436              
    4437              $C$DW$409       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$48)
    4439                      .dwattr $C$DW$409, DW_AT_name("DeviceID")
    4440                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_DeviceID")
    4441                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4442                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4443              
    4444                      .dwendtag $C$DW$T$49
    4445              
    4446              $C$DW$T$51      .dwtag  DW_TAG_typedef
    4447                      .dwattr $C$DW$T$51, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4448                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    4449                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4450              
    4451              
    4452              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4453                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4454                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x18)
    4455              $C$DW$410       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$50)
    4457                      .dwattr $C$DW$410, DW_AT_name("Stat_Reg_1")
    4458                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4459                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4460                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4461              
    4462              $C$DW$411       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$51)
    4464                      .dwattr $C$DW$411, DW_AT_name("Stat_Reg_2")
    4465                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4466                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4467                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4468              
    4469              $C$DW$412       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$52)
    4471                      .dwattr $C$DW$412, DW_AT_name("Ctrl_Reg_1")
    4472                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4473                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4474                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4475              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   85

    4476              $C$DW$413       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$53)
    4478                      .dwattr $C$DW$413, DW_AT_name("Ctrl_Reg_2")
    4479                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4480                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4481                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4482              
    4483              $C$DW$414       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    4485                      .dwattr $C$DW$414, DW_AT_name("SndCmd")
    4486                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_SndCmd")
    4487                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4488                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4489              
    4490              $C$DW$415       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    4492                      .dwattr $C$DW$415, DW_AT_name("RcvCmd")
    4493                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RcvCmd")
    4494                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4495                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4496              
    4497                      .dwendtag $C$DW$T$54
    4498              
    4499              $C$DW$T$120     .dwtag  DW_TAG_typedef
    4500                      .dwattr $C$DW$T$120, DW_AT_name("DRV_SPI_8301_Vars_t")
    4501                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$54)
    4502                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4503              
    4504              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4505                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4506                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4507              
    4508              $C$DW$416       .dwtag  DW_TAG_TI_far_type
    4509                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$121)
    4510              
    4511              $C$DW$T$122     .dwtag  DW_TAG_const_type
    4512                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$416)
    4513              
    4514              
    4515              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4516                      .dwattr $C$DW$T$64, DW_AT_name("_GPIO_Obj_")
    4517                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6a)
    4518              $C$DW$417       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$56)
    4520                      .dwattr $C$DW$417, DW_AT_name("GPACTRL")
    4521                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPACTRL")
    4522                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4523                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4524              
    4525              $C$DW$418       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$56)
    4527                      .dwattr $C$DW$418, DW_AT_name("GPAQSEL1")
    4528                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPAQSEL1")
    4529                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4530                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   86

    4531              
    4532              $C$DW$419       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$56)
    4534                      .dwattr $C$DW$419, DW_AT_name("GPAQSEL2")
    4535                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPAQSEL2")
    4536                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4537                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4538              
    4539              $C$DW$420       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    4541                      .dwattr $C$DW$420, DW_AT_name("GPAMUX1")
    4542                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPAMUX1")
    4543                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4544                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4545              
    4546              $C$DW$421       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    4548                      .dwattr $C$DW$421, DW_AT_name("GPAMUX2")
    4549                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPAMUX2")
    4550                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4551                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4552              
    4553              $C$DW$422       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    4555                      .dwattr $C$DW$422, DW_AT_name("GPADIR")
    4556                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPADIR")
    4557                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4558                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4559              
    4560              $C$DW$423       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    4562                      .dwattr $C$DW$423, DW_AT_name("GPAPUD")
    4563                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GPAPUD")
    4564                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4565                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4566              
    4567              $C$DW$424       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$58)
    4569                      .dwattr $C$DW$424, DW_AT_name("rsvd_1")
    4570                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_1")
    4571                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4572                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4573              
    4574              $C$DW$425       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    4576                      .dwattr $C$DW$425, DW_AT_name("GPBCTRL")
    4577                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_GPBCTRL")
    4578                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4579                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4580              
    4581              $C$DW$426       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$56)
    4583                      .dwattr $C$DW$426, DW_AT_name("GPBQSEL1")
    4584                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_GPBQSEL1")
    4585                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   87

    4586                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4587              
    4588              $C$DW$427       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$58)
    4590                      .dwattr $C$DW$427, DW_AT_name("rsvd_2")
    4591                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_rsvd_2")
    4592                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4593                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4594              
    4595              $C$DW$428       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4597                      .dwattr $C$DW$428, DW_AT_name("GPBMUX1")
    4598                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPBMUX1")
    4599                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4600                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4601              
    4602              $C$DW$429       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$58)
    4604                      .dwattr $C$DW$429, DW_AT_name("rsvd_3")
    4605                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd_3")
    4606                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4607                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4608              
    4609              $C$DW$430       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$56)
    4611                      .dwattr $C$DW$430, DW_AT_name("GPBDIR")
    4612                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPBDIR")
    4613                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4614                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4615              
    4616              $C$DW$431       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$56)
    4618                      .dwattr $C$DW$431, DW_AT_name("GPBPUD")
    4619                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_GPBPUD")
    4620                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4621                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4622              
    4623              $C$DW$432       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$59)
    4625                      .dwattr $C$DW$432, DW_AT_name("rsvd_4")
    4626                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd_4")
    4627                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4628                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4629              
    4630              $C$DW$433       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$56)
    4632                      .dwattr $C$DW$433, DW_AT_name("AIOMUX1")
    4633                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_AIOMUX1")
    4634                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4635                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4636              
    4637              $C$DW$434       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$58)
    4639                      .dwattr $C$DW$434, DW_AT_name("rsvd_5")
    4640                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   88

    4641                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4642                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4643              
    4644              $C$DW$435       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$56)
    4646                      .dwattr $C$DW$435, DW_AT_name("AIODIR")
    4647                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_AIODIR")
    4648                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4649                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4650              
    4651              $C$DW$436       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$60)
    4653                      .dwattr $C$DW$436, DW_AT_name("rsvd_6")
    4654                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd_6")
    4655                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4656                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4657              
    4658              $C$DW$437       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    4660                      .dwattr $C$DW$437, DW_AT_name("GPADAT")
    4661                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPADAT")
    4662                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4663                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4664              
    4665              $C$DW$438       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    4667                      .dwattr $C$DW$438, DW_AT_name("GPASET")
    4668                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPASET")
    4669                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4670                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4671              
    4672              $C$DW$439       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    4674                      .dwattr $C$DW$439, DW_AT_name("GPACLEAR")
    4675                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_GPACLEAR")
    4676                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4677                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4678              
    4679              $C$DW$440       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    4681                      .dwattr $C$DW$440, DW_AT_name("GPATOGGLE")
    4682                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPATOGGLE")
    4683                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4684                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4685              
    4686              $C$DW$441       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    4688                      .dwattr $C$DW$441, DW_AT_name("GPBDAT")
    4689                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBDAT")
    4690                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4691                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4692              
    4693              $C$DW$442       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    4695                      .dwattr $C$DW$442, DW_AT_name("GPBSET")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   89

    4696                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPBSET")
    4697                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4698                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4699              
    4700              $C$DW$443       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    4702                      .dwattr $C$DW$443, DW_AT_name("GPBCLEAR")
    4703                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GPBCLEAR")
    4704                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4705                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4706              
    4707              $C$DW$444       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    4709                      .dwattr $C$DW$444, DW_AT_name("GPBTOGGLE")
    4710                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4711                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4712                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4713              
    4714              $C$DW$445       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$61)
    4716                      .dwattr $C$DW$445, DW_AT_name("rsvd_7")
    4717                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd_7")
    4718                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4719                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4720              
    4721              $C$DW$446       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    4723                      .dwattr $C$DW$446, DW_AT_name("AIODAT")
    4724                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_AIODAT")
    4725                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4726                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4727              
    4728              $C$DW$447       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    4730                      .dwattr $C$DW$447, DW_AT_name("AIOSET")
    4731                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_AIOSET")
    4732                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4733                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4734              
    4735              $C$DW$448       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    4737                      .dwattr $C$DW$448, DW_AT_name("AIOCLEAR")
    4738                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_AIOCLEAR")
    4739                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4740                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4741              
    4742              $C$DW$449       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$56)
    4744                      .dwattr $C$DW$449, DW_AT_name("AIOTOGGLE")
    4745                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_AIOTOGGLE")
    4746                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4747                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4748              
    4749              $C$DW$450       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   90

    4751                      .dwattr $C$DW$450, DW_AT_name("GPIOXINTnSEL")
    4752                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4753                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4754                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4755              
    4756              $C$DW$451       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$63)
    4758                      .dwattr $C$DW$451, DW_AT_name("rsvd_8")
    4759                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_8")
    4760                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4761                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4762              
    4763              $C$DW$452       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$56)
    4765                      .dwattr $C$DW$452, DW_AT_name("GPIOLPMSEL")
    4766                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4767                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4768                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4769              
    4770                      .dwendtag $C$DW$T$64
    4771              
    4772              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4773                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$64)
    4774                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    4775              
    4776              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4777                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    4778                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4779                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4780              
    4781              $C$DW$453       .dwtag  DW_TAG_TI_far_type
    4782                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$22)
    4783              
    4784              $C$DW$T$125     .dwtag  DW_TAG_const_type
    4785                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$453)
    4786              
    4787              
    4788              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4789                      .dwattr $C$DW$T$65, DW_AT_name("_SPI_Obj_")
    4790                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    4791              $C$DW$454       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$57)
    4793                      .dwattr $C$DW$454, DW_AT_name("SPICCR")
    4794                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_SPICCR")
    4795                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4796                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4797              
    4798              $C$DW$455       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$57)
    4800                      .dwattr $C$DW$455, DW_AT_name("SPICTL")
    4801                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_SPICTL")
    4802                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4803                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4804              
    4805              $C$DW$456       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   91

    4806                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$57)
    4807                      .dwattr $C$DW$456, DW_AT_name("SPIST")
    4808                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_SPIST")
    4809                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4810                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4811              
    4812              $C$DW$457       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$57)
    4814                      .dwattr $C$DW$457, DW_AT_name("rsvd_1")
    4815                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd_1")
    4816                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4817                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4818              
    4819              $C$DW$458       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$57)
    4821                      .dwattr $C$DW$458, DW_AT_name("SPIBRR")
    4822                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_SPIBRR")
    4823                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4824                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4825              
    4826              $C$DW$459       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$57)
    4828                      .dwattr $C$DW$459, DW_AT_name("rsvd_2")
    4829                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd_2")
    4830                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4831                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4832              
    4833              $C$DW$460       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$57)
    4835                      .dwattr $C$DW$460, DW_AT_name("SPIEMU")
    4836                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_SPIEMU")
    4837                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4838                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4839              
    4840              $C$DW$461       .dwtag  DW_TAG_member
    4841                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$57)
    4842                      .dwattr $C$DW$461, DW_AT_name("SPIRXBUF")
    4843                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_SPIRXBUF")
    4844                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4845                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4846              
    4847              $C$DW$462       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$57)
    4849                      .dwattr $C$DW$462, DW_AT_name("SPITXBUF")
    4850                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_SPITXBUF")
    4851                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4852                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4853              
    4854              $C$DW$463       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$57)
    4856                      .dwattr $C$DW$463, DW_AT_name("SPIDAT")
    4857                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_SPIDAT")
    4858                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4859                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4860              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   92

    4861              $C$DW$464       .dwtag  DW_TAG_member
    4862                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$57)
    4863                      .dwattr $C$DW$464, DW_AT_name("SPIFFTX")
    4864                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_SPIFFTX")
    4865                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4866                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4867              
    4868              $C$DW$465       .dwtag  DW_TAG_member
    4869                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$57)
    4870                      .dwattr $C$DW$465, DW_AT_name("SPIFFRX")
    4871                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_SPIFFRX")
    4872                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4873                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4874              
    4875              $C$DW$466       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$57)
    4877                      .dwattr $C$DW$466, DW_AT_name("SPIFFCT")
    4878                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_SPIFFCT")
    4879                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4880                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4881              
    4882              $C$DW$467       .dwtag  DW_TAG_member
    4883                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$58)
    4884                      .dwattr $C$DW$467, DW_AT_name("rsvd_3")
    4885                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd_3")
    4886                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4887                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4888              
    4889              $C$DW$468       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$57)
    4891                      .dwattr $C$DW$468, DW_AT_name("SPIPRI")
    4892                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_SPIPRI")
    4893                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4894                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4895              
    4896                      .dwendtag $C$DW$T$65
    4897              
    4898              $C$DW$T$127     .dwtag  DW_TAG_typedef
    4899                      .dwattr $C$DW$T$127, DW_AT_name("SPI_Obj")
    4900                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$65)
    4901                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4902              
    4903              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4904                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$65)
    4905                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4906              
    4907              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4908                      .dwattr $C$DW$T$20, DW_AT_name("SPI_Handle")
    4909                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4910                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4911              
    4912              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    4913                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    4914              
    4915              $C$DW$T$128     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:29:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2190410                          PAGE   93

    4916                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$469)
    4917              
    4918              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4919                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4920              
    4921              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4922                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4923                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4924              
    4925              $C$DW$470       .dwtag  DW_TAG_TI_far_type
    4926                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$3)
    4927              
    4928              $C$DW$T$130     .dwtag  DW_TAG_const_type
    4929                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$470)
    4930              
    4931              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4932                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4933                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4934                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4935              
    4936              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4937                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4938                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4939                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4940              
    4941              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4942                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4943                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4944                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4945              
    4946              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4947                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4948                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4949                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4950              
    4951              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4952                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4953                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4954                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4955              
    4956              $C$DW$T$9       .dwtag  DW_TAG_base_type
