TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4578410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Sun Oct 30 14:01:47 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/flash.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Documents\GitHub\LegStrong\Debug")
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    1305                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1306              
    1307              $C$DW$122       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4578410                          PAGE   25

    1308                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$41)
    1309              
    1310              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1311                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$122)
    1312              
    1313              
    1314              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1315                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1316              $C$DW$123       .dwtag  DW_TAG_enumerator
    1317                      .dwattr $C$DW$123, DW_AT_name("FLASH_NumOtpWaitStates_1")
    1318                      .dwattr $C$DW$123, DW_AT_const_value(0x01)
    1319              
    1320              $C$DW$124       .dwtag  DW_TAG_enumerator
    1321                      .dwattr $C$DW$124, DW_AT_name("FLASH_NumOtpWaitStates_2")
    1322                      .dwattr $C$DW$124, DW_AT_const_value(0x02)
    1323              
    1324              $C$DW$125       .dwtag  DW_TAG_enumerator
    1325                      .dwattr $C$DW$125, DW_AT_name("FLASH_NumOtpWaitStates_3")
    1326                      .dwattr $C$DW$125, DW_AT_const_value(0x03)
    1327              
    1328              $C$DW$126       .dwtag  DW_TAG_enumerator
    1329                      .dwattr $C$DW$126, DW_AT_name("FLASH_NumOtpWaitStates_4")
    1330                      .dwattr $C$DW$126, DW_AT_const_value(0x04)
    1331              
    1332              $C$DW$127       .dwtag  DW_TAG_enumerator
    1333                      .dwattr $C$DW$127, DW_AT_name("FLASH_NumOtpWaitStates_5")
    1334                      .dwattr $C$DW$127, DW_AT_const_value(0x05)
    1335              
    1336              $C$DW$128       .dwtag  DW_TAG_enumerator
    1337                      .dwattr $C$DW$128, DW_AT_name("FLASH_NumOtpWaitStates_6")
    1338                      .dwattr $C$DW$128, DW_AT_const_value(0x06)
    1339              
    1340              $C$DW$129       .dwtag  DW_TAG_enumerator
    1341                      .dwattr $C$DW$129, DW_AT_name("FLASH_NumOtpWaitStates_7")
    1342                      .dwattr $C$DW$129, DW_AT_const_value(0x07)
    1343              
    1344              $C$DW$130       .dwtag  DW_TAG_enumerator
    1345                      .dwattr $C$DW$130, DW_AT_name("FLASH_NumOtpWaitStates_8")
    1346                      .dwattr $C$DW$130, DW_AT_const_value(0x08)
    1347              
    1348              $C$DW$131       .dwtag  DW_TAG_enumerator
    1349                      .dwattr $C$DW$131, DW_AT_name("FLASH_NumOtpWaitStates_9")
    1350                      .dwattr $C$DW$131, DW_AT_const_value(0x09)
    1351              
    1352              $C$DW$132       .dwtag  DW_TAG_enumerator
    1353                      .dwattr $C$DW$132, DW_AT_name("FLASH_NumOtpWaitStates_10")
    1354                      .dwattr $C$DW$132, DW_AT_const_value(0x0a)
    1355              
    1356              $C$DW$133       .dwtag  DW_TAG_enumerator
    1357                      .dwattr $C$DW$133, DW_AT_name("FLASH_NumOtpWaitStates_11")
    1358                      .dwattr $C$DW$133, DW_AT_const_value(0x0b)
    1359              
    1360              $C$DW$134       .dwtag  DW_TAG_enumerator
    1361                      .dwattr $C$DW$134, DW_AT_name("FLASH_NumOtpWaitStates_12")
    1362                      .dwattr $C$DW$134, DW_AT_const_value(0x0c)
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4578410                          PAGE   26

    1363              
    1364              $C$DW$135       .dwtag  DW_TAG_enumerator
    1365                      .dwattr $C$DW$135, DW_AT_name("FLASH_NumOtpWaitStates_13")
    1366                      .dwattr $C$DW$135, DW_AT_const_value(0x0d)
    1367              
    1368              $C$DW$136       .dwtag  DW_TAG_enumerator
    1369                      .dwattr $C$DW$136, DW_AT_name("FLASH_NumOtpWaitStates_14")
    1370                      .dwattr $C$DW$136, DW_AT_const_value(0x0e)
    1371              
    1372              $C$DW$137       .dwtag  DW_TAG_enumerator
    1373                      .dwattr $C$DW$137, DW_AT_name("FLASH_NumOtpWaitStates_15")
    1374                      .dwattr $C$DW$137, DW_AT_const_value(0x0f)
    1375              
    1376                      .dwendtag $C$DW$T$43
    1377              
    1378              $C$DW$T$44      .dwtag  DW_TAG_typedef
    1379                      .dwattr $C$DW$T$44, DW_AT_name("FLASH_NumOtpWaitStates_e")
    1380                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1381                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1382              
    1383              $C$DW$138       .dwtag  DW_TAG_TI_far_type
    1384                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$44)
    1385              
    1386              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1387                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$138)
    1388              
    1389              
    1390              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$21, DW_AT_name("_FLASH_Obj_")
    1392                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1393              $C$DW$139       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1395                      .dwattr $C$DW$139, DW_AT_name("FOPT")
    1396                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_FOPT")
    1397                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1399              
    1400              $C$DW$140       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1402                      .dwattr $C$DW$140, DW_AT_name("rsvd_1")
    1403                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd_1")
    1404                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1405                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1406              
    1407              $C$DW$141       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1409                      .dwattr $C$DW$141, DW_AT_name("FPWR")
    1410                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_FPWR")
    1411                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1412                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$142       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1416                      .dwattr $C$DW$142, DW_AT_name("FSTATUS")
    1417                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_FSTATUS")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4578410                          PAGE   27

    1418                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1419                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$143       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1423                      .dwattr $C$DW$143, DW_AT_name("FSTDBYWAIT")
    1424                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1425                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1426                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1427              
    1428              $C$DW$144       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1430                      .dwattr $C$DW$144, DW_AT_name("FACTIVEWAIT")
    1431                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1432                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1433                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$145       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1437                      .dwattr $C$DW$145, DW_AT_name("FBANKWAIT")
    1438                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_FBANKWAIT")
    1439                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1440                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$146       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1444                      .dwattr $C$DW$146, DW_AT_name("FOTPWAIT")
    1445                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_FOTPWAIT")
    1446                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1447                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449                      .dwendtag $C$DW$T$21
    1450              
    1451              $C$DW$T$46      .dwtag  DW_TAG_typedef
    1452                      .dwattr $C$DW$T$46, DW_AT_name("FLASH_Obj")
    1453                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$21)
    1454                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1455              
    1456              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1457                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1458                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
    1459              
    1460              $C$DW$T$25      .dwtag  DW_TAG_typedef
    1461                      .dwattr $C$DW$T$25, DW_AT_name("FLASH_Handle")
    1462                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1463                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1464              
    1465              $C$DW$147       .dwtag  DW_TAG_TI_far_type
    1466                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1467              
    1468              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1469                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$147)
    1470              
    1471              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1472                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v15.12.3 Sun Oct 30 14:01:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\4578410                          PAGE   28

    1473              
    1474              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1475                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1476                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1477              
    1478              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1479                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1480                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1481                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1482              
    1483              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1484                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1485                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1486                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1487              
    1488              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1489                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1490                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1491                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1492              
    1493              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1494                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1495                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1496                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1497              
    1498              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1499                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1500                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1501                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1502              
    1503              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1504                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1505                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1506                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1507              
    1508              $C$DW$T$10      .dwtag  DW_TAG_base_type
