TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:15:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0162810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 15:15:04 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/i2c.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    1482                      .dwattr $C$DW$123, DW_AT_const_value(0x400)
    1483              
    1484              $C$DW$124       .dwtag  DW_TAG_enumerator
    1485                      .dwattr $C$DW$124, DW_AT_name("I2C_Status_Rx_Full")
    1486                      .dwattr $C$DW$124, DW_AT_const_value(0x800)
    1487              
    1488              $C$DW$125       .dwtag  DW_TAG_enumerator
    1489                      .dwattr $C$DW$125, DW_AT_name("I2C_Status_Busy")
    1490                      .dwattr $C$DW$125, DW_AT_const_value(0x1000)
    1491              
    1492              $C$DW$126       .dwtag  DW_TAG_enumerator
    1493                      .dwattr $C$DW$126, DW_AT_name("I2C_Status_NACK_Sent")
    1494                      .dwattr $C$DW$126, DW_AT_const_value(0x2000)
    1495              
    1496              $C$DW$127       .dwtag  DW_TAG_enumerator
    1497                      .dwattr $C$DW$127, DW_AT_name("I2C_Status_Slave_Dir")
    1498                      .dwattr $C$DW$127, DW_AT_const_value(0x4000)
    1499              
    1500                      .dwendtag $C$DW$T$33
    1501              
    1502              $C$DW$T$34      .dwtag  DW_TAG_typedef
    1503                      .dwattr $C$DW$T$34, DW_AT_name("I2C_Status_e")
    1504                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1505                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1506              
    1507              
    1508              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1509                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1510              $C$DW$128       .dwtag  DW_TAG_enumerator
    1511                      .dwattr $C$DW$128, DW_AT_name("I2C_Control_Stop")
    1512                      .dwattr $C$DW$128, DW_AT_const_value(0xc00)
    1513              
    1514              $C$DW$129       .dwtag  DW_TAG_enumerator
    1515                      .dwattr $C$DW$129, DW_AT_name("I2C_Control_Single_TX")
    1516                      .dwattr $C$DW$129, DW_AT_const_value(0x2e00)
    1517              
    1518              $C$DW$130       .dwtag  DW_TAG_enumerator
    1519                      .dwattr $C$DW$130, DW_AT_name("I2C_Control_Single_RX")
    1520                      .dwattr $C$DW$130, DW_AT_const_value(0x2c00)
    1521              
    1522              $C$DW$131       .dwtag  DW_TAG_enumerator
    1523                      .dwattr $C$DW$131, DW_AT_name("I2C_Control_Burst_TX_Start")
    1524                      .dwattr $C$DW$131, DW_AT_const_value(0x2600)
    1525              
    1526              $C$DW$132       .dwtag  DW_TAG_enumerator
    1527                      .dwattr $C$DW$132, DW_AT_name("I2C_Control_Burst_TX_Stop")
    1528                      .dwattr $C$DW$132, DW_AT_const_value(0xe00)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:15:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0162810                          PAGE   29

    1529              
    1530              $C$DW$133       .dwtag  DW_TAG_enumerator
    1531                      .dwattr $C$DW$133, DW_AT_name("I2C_Control_Burst_RX_Start")
    1532                      .dwattr $C$DW$133, DW_AT_const_value(0x2400)
    1533              
    1534              $C$DW$134       .dwtag  DW_TAG_enumerator
    1535                      .dwattr $C$DW$134, DW_AT_name("I2C_Control_Burst_RX_Stop")
    1536                      .dwattr $C$DW$134, DW_AT_const_value(0xc00)
    1537              
    1538                      .dwendtag $C$DW$T$37
    1539              
    1540              $C$DW$T$38      .dwtag  DW_TAG_typedef
    1541                      .dwattr $C$DW$T$38, DW_AT_name("I2C_Control_e")
    1542                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1543                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1544              
    1545              $C$DW$135       .dwtag  DW_TAG_TI_far_type
    1546                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    1547              
    1548              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1549                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$135)
    1550              
    1551              
    1552              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1554                      .dwattr $C$DW$T$19, DW_AT_declaration
    1555                      .dwendtag $C$DW$T$19
    1556              
    1557              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1558                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    1560              
    1561              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1562                      .dwattr $C$DW$T$30, DW_AT_name("I2C_Handle")
    1563                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1564                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1565              
    1566              $C$DW$136       .dwtag  DW_TAG_TI_far_type
    1567                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$30)
    1568              
    1569              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1570                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$136)
    1571              
    1572              
    1573              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1574                      .dwattr $C$DW$T$23, DW_AT_name("_I2C_Obj_")
    1575                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x22)
    1576              $C$DW$137       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1578                      .dwattr $C$DW$137, DW_AT_name("I2COAR")
    1579                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_I2COAR")
    1580                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$138       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:15:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0162810                          PAGE   30

    1584                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1585                      .dwattr $C$DW$138, DW_AT_name("I2CIER")
    1586                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_I2CIER")
    1587                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1588                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$139       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1592                      .dwattr $C$DW$139, DW_AT_name("I2CSTR")
    1593                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_I2CSTR")
    1594                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1595                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$140       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1599                      .dwattr $C$DW$140, DW_AT_name("I2CCLKL")
    1600                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_I2CCLKL")
    1601                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1602                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$141       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    1606                      .dwattr $C$DW$141, DW_AT_name("I2CCLKH")
    1607                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_I2CCLKH")
    1608                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1609                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1610              
    1611              $C$DW$142       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1613                      .dwattr $C$DW$142, DW_AT_name("I2CCNT")
    1614                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_I2CCNT")
    1615                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1616                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$143       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1620                      .dwattr $C$DW$143, DW_AT_name("I2CDRR")
    1621                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_I2CDRR")
    1622                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1623                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625              $C$DW$144       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1627                      .dwattr $C$DW$144, DW_AT_name("I2CSAR")
    1628                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_I2CSAR")
    1629                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1630                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$145       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
    1634                      .dwattr $C$DW$145, DW_AT_name("I2CDXR")
    1635                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_I2CDXR")
    1636                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1637                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1638              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:15:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0162810                          PAGE   31

    1639              $C$DW$146       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    1641                      .dwattr $C$DW$146, DW_AT_name("I2CMDR")
    1642                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_I2CMDR")
    1643                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1644                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$147       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    1648                      .dwattr $C$DW$147, DW_AT_name("I2CISRC")
    1649                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_I2CISRC")
    1650                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1651                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$148       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    1655                      .dwattr $C$DW$148, DW_AT_name("I2CEMDR")
    1656                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_I2CEMDR")
    1657                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1658                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$149       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1662                      .dwattr $C$DW$149, DW_AT_name("I2CPSC")
    1663                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_I2CPSC")
    1664                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1665                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$150       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
    1669                      .dwattr $C$DW$150, DW_AT_name("rsvd_1")
    1670                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd_1")
    1671                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1672                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$151       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1676                      .dwattr $C$DW$151, DW_AT_name("I2CFFTX")
    1677                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_I2CFFTX")
    1678                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1679                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$152       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    1683                      .dwattr $C$DW$152, DW_AT_name("I2CFFRX")
    1684                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_I2CFFRX")
    1685                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1686                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688                      .dwendtag $C$DW$T$23
    1689              
    1690              $C$DW$T$44      .dwtag  DW_TAG_typedef
    1691                      .dwattr $C$DW$T$44, DW_AT_name("I2C_Obj")
    1692                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$23)
    1693                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:15:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\0162810                          PAGE   32

    1694              
    1695              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1696                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1697              
    1698              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1699                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1700                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1701              
    1702              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1703                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1704                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1705                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1706              
    1707              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1708                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1709                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1710                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1711              
    1712              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1713                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1714                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1715                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1716              
    1717              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1718                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1719                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1720                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1721              
    1722              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1723                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1724                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1725                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1726              
    1727              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1728                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1729                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1730                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1731              
    1732              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1733                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1734                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1735                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1736              
    1737              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1738                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1739                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1740                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1741              
    1742              $C$DW$T$20      .dwtag  DW_TAG_typedef
    1743                      .dwattr $C$DW$T$20, DW_AT_name("uint16_t")
    1744                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$11)
    1745                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1746              
