TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:04 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/pie.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    2533                      .dwattr $C$DW$247, DW_AT_name("PIE_SystemInterrupts_USER2")
    2534                      .dwattr $C$DW$247, DW_AT_const_value(0x15)
    2535              
    2536              $C$DW$248       .dwtag  DW_TAG_enumerator
    2537                      .dwattr $C$DW$248, DW_AT_name("PIE_SystemInterrupts_USER3")
    2538                      .dwattr $C$DW$248, DW_AT_const_value(0x16)
    2539              
    2540              $C$DW$249       .dwtag  DW_TAG_enumerator
    2541                      .dwattr $C$DW$249, DW_AT_name("PIE_SystemInterrupts_USER4")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   48

    2542                      .dwattr $C$DW$249, DW_AT_const_value(0x17)
    2543              
    2544              $C$DW$250       .dwtag  DW_TAG_enumerator
    2545                      .dwattr $C$DW$250, DW_AT_name("PIE_SystemInterrupts_USER5")
    2546                      .dwattr $C$DW$250, DW_AT_const_value(0x18)
    2547              
    2548              $C$DW$251       .dwtag  DW_TAG_enumerator
    2549                      .dwattr $C$DW$251, DW_AT_name("PIE_SystemInterrupts_USER6")
    2550                      .dwattr $C$DW$251, DW_AT_const_value(0x19)
    2551              
    2552              $C$DW$252       .dwtag  DW_TAG_enumerator
    2553                      .dwattr $C$DW$252, DW_AT_name("PIE_SystemInterrupts_USER7")
    2554                      .dwattr $C$DW$252, DW_AT_const_value(0x1a)
    2555              
    2556              $C$DW$253       .dwtag  DW_TAG_enumerator
    2557                      .dwattr $C$DW$253, DW_AT_name("PIE_SystemInterrupts_USER8")
    2558                      .dwattr $C$DW$253, DW_AT_const_value(0x1b)
    2559              
    2560              $C$DW$254       .dwtag  DW_TAG_enumerator
    2561                      .dwattr $C$DW$254, DW_AT_name("PIE_SystemInterrupts_USER9")
    2562                      .dwattr $C$DW$254, DW_AT_const_value(0x1c)
    2563              
    2564              $C$DW$255       .dwtag  DW_TAG_enumerator
    2565                      .dwattr $C$DW$255, DW_AT_name("PIE_SystemInterrupts_USER10")
    2566                      .dwattr $C$DW$255, DW_AT_const_value(0x1d)
    2567              
    2568              $C$DW$256       .dwtag  DW_TAG_enumerator
    2569                      .dwattr $C$DW$256, DW_AT_name("PIE_SystemInterrupts_USER11")
    2570                      .dwattr $C$DW$256, DW_AT_const_value(0x1e)
    2571              
    2572              $C$DW$257       .dwtag  DW_TAG_enumerator
    2573                      .dwattr $C$DW$257, DW_AT_name("PIE_SystemInterrupts_USER12")
    2574                      .dwattr $C$DW$257, DW_AT_const_value(0x1f)
    2575              
    2576                      .dwendtag $C$DW$T$52
    2577              
    2578              $C$DW$T$53      .dwtag  DW_TAG_typedef
    2579                      .dwattr $C$DW$T$53, DW_AT_name("PIE_SystemInterrupts_e")
    2580                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2581                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2582              
    2583              $C$DW$258       .dwtag  DW_TAG_TI_far_type
    2584                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$53)
    2585              
    2586              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2587                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$258)
    2588              
    2589              
    2590              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2591                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2592              $C$DW$259       .dwtag  DW_TAG_enumerator
    2593                      .dwattr $C$DW$259, DW_AT_name("PIE_ExtIntPolarity_FallingEdge")
    2594                      .dwattr $C$DW$259, DW_AT_const_value(0x00)
    2595              
    2596              $C$DW$260       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   49

    2597                      .dwattr $C$DW$260, DW_AT_name("PIE_ExtIntPolarity_RisingEdge")
    2598                      .dwattr $C$DW$260, DW_AT_const_value(0x04)
    2599              
    2600              $C$DW$261       .dwtag  DW_TAG_enumerator
    2601                      .dwattr $C$DW$261, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge")
    2602                      .dwattr $C$DW$261, DW_AT_const_value(0x0c)
    2603              
    2604                      .dwendtag $C$DW$T$55
    2605              
    2606              $C$DW$T$56      .dwtag  DW_TAG_typedef
    2607                      .dwattr $C$DW$T$56, DW_AT_name("PIE_ExtIntPolarity_e")
    2608                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2609                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2610              
    2611              $C$DW$262       .dwtag  DW_TAG_TI_far_type
    2612                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$56)
    2613              
    2614              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2615                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$262)
    2616              
    2617              
    2618              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2619                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    2620                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2621              $C$DW$263       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2623                      .dwattr $C$DW$263, DW_AT_name("IER")
    2624                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_IER")
    2625                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2627              
    2628              $C$DW$264       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2630                      .dwattr $C$DW$264, DW_AT_name("IFR")
    2631                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_IFR")
    2632                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2633                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635                      .dwendtag $C$DW$T$21
    2636              
    2637              $C$DW$T$22      .dwtag  DW_TAG_typedef
    2638                      .dwattr $C$DW$T$22, DW_AT_name("PIE_IERIFR_t")
    2639                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2640                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2641              
    2642              $C$DW$265       .dwtag  DW_TAG_TI_far_type
    2643                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$22)
    2644              
    2645              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2646                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$265)
    2647              
    2648              
    2649              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2650                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2651                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   50

    2652                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2653              $C$DW$266       .dwtag  DW_TAG_subrange_type
    2654                      .dwattr $C$DW$266, DW_AT_upper_bound(0x0b)
    2655              
    2656                      .dwendtag $C$DW$T$24
    2657              
    2658              
    2659              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2660                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2661                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2662              $C$DW$267       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2664                      .dwattr $C$DW$267, DW_AT_name("PIECTRL")
    2665                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PIECTRL")
    2666                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669              $C$DW$268       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2671                      .dwattr $C$DW$268, DW_AT_name("PIEACK")
    2672                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_PIEACK")
    2673                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2674                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676              $C$DW$269       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$24)
    2678                      .dwattr $C$DW$269, DW_AT_name("PIEIER_PIEIFR")
    2679                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2680                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2681                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2682              
    2683              $C$DW$270       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
    2685                      .dwattr $C$DW$270, DW_AT_name("rsvd_1")
    2686                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_1")
    2687                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2688                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$271       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$29)
    2692                      .dwattr $C$DW$271, DW_AT_name("Reset")
    2693                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_Reset")
    2694                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2695                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$272       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    2699                      .dwattr $C$DW$272, DW_AT_name("INT1")
    2700                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INT1")
    2701                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2702                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2703              
    2704              $C$DW$273       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$29)
    2706                      .dwattr $C$DW$273, DW_AT_name("INT2")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   51

    2707                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INT2")
    2708                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2709                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2710              
    2711              $C$DW$274       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$29)
    2713                      .dwattr $C$DW$274, DW_AT_name("INT3")
    2714                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT3")
    2715                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2716                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2717              
    2718              $C$DW$275       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    2720                      .dwattr $C$DW$275, DW_AT_name("INT4")
    2721                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INT4")
    2722                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2723                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$276       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$29)
    2727                      .dwattr $C$DW$276, DW_AT_name("INT5")
    2728                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INT5")
    2729                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2730                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$277       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    2734                      .dwattr $C$DW$277, DW_AT_name("INT6")
    2735                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT6")
    2736                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2737                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739              $C$DW$278       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$29)
    2741                      .dwattr $C$DW$278, DW_AT_name("INT7")
    2742                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INT7")
    2743                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2744                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746              $C$DW$279       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    2748                      .dwattr $C$DW$279, DW_AT_name("INT8")
    2749                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT8")
    2750                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2751                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2752              
    2753              $C$DW$280       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$29)
    2755                      .dwattr $C$DW$280, DW_AT_name("INT9")
    2756                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INT9")
    2757                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2758                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2759              
    2760              $C$DW$281       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   52

    2762                      .dwattr $C$DW$281, DW_AT_name("INT10")
    2763                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INT10")
    2764                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2765                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2766              
    2767              $C$DW$282       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$29)
    2769                      .dwattr $C$DW$282, DW_AT_name("INT11")
    2770                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INT11")
    2771                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2772                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$283       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$29)
    2776                      .dwattr $C$DW$283, DW_AT_name("INT12")
    2777                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_INT12")
    2778                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2779                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$284       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    2783                      .dwattr $C$DW$284, DW_AT_name("TINT1")
    2784                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_TINT1")
    2785                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2786                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$285       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$29)
    2790                      .dwattr $C$DW$285, DW_AT_name("TINT2")
    2791                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_TINT2")
    2792                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2793                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795              $C$DW$286       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$29)
    2797                      .dwattr $C$DW$286, DW_AT_name("DATALOG")
    2798                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_DATALOG")
    2799                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2800                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2801              
    2802              $C$DW$287       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$29)
    2804                      .dwattr $C$DW$287, DW_AT_name("RTOSINT")
    2805                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RTOSINT")
    2806                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2807                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2808              
    2809              $C$DW$288       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$29)
    2811                      .dwattr $C$DW$288, DW_AT_name("EMUINT")
    2812                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_EMUINT")
    2813                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2814                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2815              
    2816              $C$DW$289       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   53

    2817                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    2818                      .dwattr $C$DW$289, DW_AT_name("NMI")
    2819                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_NMI")
    2820                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2821                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2822              
    2823              $C$DW$290       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    2825                      .dwattr $C$DW$290, DW_AT_name("ILLEGAL")
    2826                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_ILLEGAL")
    2827                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2828                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$291       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    2832                      .dwattr $C$DW$291, DW_AT_name("USER1")
    2833                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_USER1")
    2834                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2835                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837              $C$DW$292       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    2839                      .dwattr $C$DW$292, DW_AT_name("USER2")
    2840                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_USER2")
    2841                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2842                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2843              
    2844              $C$DW$293       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
    2846                      .dwattr $C$DW$293, DW_AT_name("USER3")
    2847                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_USER3")
    2848                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2849                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2850              
    2851              $C$DW$294       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    2853                      .dwattr $C$DW$294, DW_AT_name("USER4")
    2854                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_USER4")
    2855                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2856                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2857              
    2858              $C$DW$295       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    2860                      .dwattr $C$DW$295, DW_AT_name("USER5")
    2861                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_USER5")
    2862                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2863                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2864              
    2865              $C$DW$296       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    2867                      .dwattr $C$DW$296, DW_AT_name("USER6")
    2868                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_USER6")
    2869                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2870                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2871              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   54

    2872              $C$DW$297       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    2874                      .dwattr $C$DW$297, DW_AT_name("USER7")
    2875                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_USER7")
    2876                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2877                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2878              
    2879              $C$DW$298       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    2881                      .dwattr $C$DW$298, DW_AT_name("USER8")
    2882                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_USER8")
    2883                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2884                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$299       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    2888                      .dwattr $C$DW$299, DW_AT_name("USER9")
    2889                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_USER9")
    2890                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2891                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893              $C$DW$300       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
    2895                      .dwattr $C$DW$300, DW_AT_name("USER10")
    2896                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_USER10")
    2897                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2898                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2899              
    2900              $C$DW$301       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$29)
    2902                      .dwattr $C$DW$301, DW_AT_name("USER11")
    2903                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_USER11")
    2904                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2905                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2906              
    2907              $C$DW$302       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$29)
    2909                      .dwattr $C$DW$302, DW_AT_name("USER12")
    2910                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_USER12")
    2911                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2912                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2913              
    2914              $C$DW$303       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$29)
    2916                      .dwattr $C$DW$303, DW_AT_name("ADCINT1_HP")
    2917                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2918                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2919                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2920              
    2921              $C$DW$304       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$29)
    2923                      .dwattr $C$DW$304, DW_AT_name("ADCINT2_HP")
    2924                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2925                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2926                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   55

    2927              
    2928              $C$DW$305       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$29)
    2930                      .dwattr $C$DW$305, DW_AT_name("rsvd1_3")
    2931                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_rsvd1_3")
    2932                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2933                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$306       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$29)
    2937                      .dwattr $C$DW$306, DW_AT_name("XINT1")
    2938                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_XINT1")
    2939                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2940                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942              $C$DW$307       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$29)
    2944                      .dwattr $C$DW$307, DW_AT_name("XINT2")
    2945                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_XINT2")
    2946                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2947                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2948              
    2949              $C$DW$308       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$29)
    2951                      .dwattr $C$DW$308, DW_AT_name("ADCINT9")
    2952                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_ADCINT9")
    2953                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2954                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2955              
    2956              $C$DW$309       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    2958                      .dwattr $C$DW$309, DW_AT_name("TINT0")
    2959                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_TINT0")
    2960                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2961                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2962              
    2963              $C$DW$310       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    2965                      .dwattr $C$DW$310, DW_AT_name("WAKEINT")
    2966                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_WAKEINT")
    2967                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2968                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2969              
    2970              $C$DW$311       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$29)
    2972                      .dwattr $C$DW$311, DW_AT_name("EPWM1_TZINT")
    2973                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2974                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2975                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977              $C$DW$312       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    2979                      .dwattr $C$DW$312, DW_AT_name("EPWM2_TZINT")
    2980                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2981                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   56

    2982                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2983              
    2984              $C$DW$313       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2986                      .dwattr $C$DW$313, DW_AT_name("EPWM3_TZINT")
    2987                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2988                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2989                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2990              
    2991              $C$DW$314       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2993                      .dwattr $C$DW$314, DW_AT_name("EPWM4_TZINT")
    2994                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2995                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2996                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2997              
    2998              $C$DW$315       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    3000                      .dwattr $C$DW$315, DW_AT_name("rsvd2_5")
    3001                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_rsvd2_5")
    3002                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3003                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3004              
    3005              $C$DW$316       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    3007                      .dwattr $C$DW$316, DW_AT_name("rsvd2_6")
    3008                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd2_6")
    3009                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3010                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3011              
    3012              $C$DW$317       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    3014                      .dwattr $C$DW$317, DW_AT_name("rsvd2_7")
    3015                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_rsvd2_7")
    3016                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3017                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3018              
    3019              $C$DW$318       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    3021                      .dwattr $C$DW$318, DW_AT_name("rsvd2_8")
    3022                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_rsvd2_8")
    3023                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    3024                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3025              
    3026              $C$DW$319       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    3028                      .dwattr $C$DW$319, DW_AT_name("EPWM1_INT")
    3029                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_EPWM1_INT")
    3030                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3031                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3032              
    3033              $C$DW$320       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    3035                      .dwattr $C$DW$320, DW_AT_name("EPWM2_INT")
    3036                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_EPWM2_INT")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   57

    3037                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    3038                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3039              
    3040              $C$DW$321       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    3042                      .dwattr $C$DW$321, DW_AT_name("EPWM3_INT")
    3043                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_EPWM3_INT")
    3044                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3045                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3046              
    3047              $C$DW$322       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
    3049                      .dwattr $C$DW$322, DW_AT_name("EPWM4_INT")
    3050                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_EPWM4_INT")
    3051                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    3052                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3053              
    3054              $C$DW$323       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    3056                      .dwattr $C$DW$323, DW_AT_name("rsvd3_5")
    3057                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_rsvd3_5")
    3058                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3059                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061              $C$DW$324       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    3063                      .dwattr $C$DW$324, DW_AT_name("rsvd3_6")
    3064                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_rsvd3_6")
    3065                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    3066                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3067              
    3068              $C$DW$325       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    3070                      .dwattr $C$DW$325, DW_AT_name("rsvd3_7")
    3071                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_rsvd3_7")
    3072                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3073                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3074              
    3075              $C$DW$326       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    3077                      .dwattr $C$DW$326, DW_AT_name("rsvd3_8")
    3078                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_rsvd3_8")
    3079                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    3080                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3081              
    3082              $C$DW$327       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    3084                      .dwattr $C$DW$327, DW_AT_name("ECAP1_INT")
    3085                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_ECAP1_INT")
    3086                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3087                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3088              
    3089              $C$DW$328       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    3091                      .dwattr $C$DW$328, DW_AT_name("rsvd4_2")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   58

    3092                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd4_2")
    3093                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3094                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3095              
    3096              $C$DW$329       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    3098                      .dwattr $C$DW$329, DW_AT_name("rsvd4_3")
    3099                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_rsvd4_3")
    3100                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3101                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3102              
    3103              $C$DW$330       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    3105                      .dwattr $C$DW$330, DW_AT_name("rsvd4_4")
    3106                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd4_4")
    3107                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    3108                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3109              
    3110              $C$DW$331       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    3112                      .dwattr $C$DW$331, DW_AT_name("rsvd4_5")
    3113                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_rsvd4_5")
    3114                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3115                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3116              
    3117              $C$DW$332       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    3119                      .dwattr $C$DW$332, DW_AT_name("rsvd4_6")
    3120                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd4_6")
    3121                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3122                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3123              
    3124              $C$DW$333       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    3126                      .dwattr $C$DW$333, DW_AT_name("rsvd4_7")
    3127                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd4_7")
    3128                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3129                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3130              
    3131              $C$DW$334       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    3133                      .dwattr $C$DW$334, DW_AT_name("rsvd4_8")
    3134                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_rsvd4_8")
    3135                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3136                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3137              
    3138              $C$DW$335       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    3140                      .dwattr $C$DW$335, DW_AT_name("rsvd5_1")
    3141                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd5_1")
    3142                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3143                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3144              
    3145              $C$DW$336       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   59

    3147                      .dwattr $C$DW$336, DW_AT_name("rsvd5_2")
    3148                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_rsvd5_2")
    3149                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3150                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3151              
    3152              $C$DW$337       .dwtag  DW_TAG_member
    3153                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    3154                      .dwattr $C$DW$337, DW_AT_name("rsvd5_3")
    3155                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd5_3")
    3156                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3157                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3158              
    3159              $C$DW$338       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    3161                      .dwattr $C$DW$338, DW_AT_name("rsvd5_4")
    3162                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_rsvd5_4")
    3163                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3164                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3165              
    3166              $C$DW$339       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    3168                      .dwattr $C$DW$339, DW_AT_name("rsvd5_5")
    3169                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd5_5")
    3170                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3171                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3172              
    3173              $C$DW$340       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    3175                      .dwattr $C$DW$340, DW_AT_name("rsvd5_6")
    3176                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd5_6")
    3177                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3178                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3179              
    3180              $C$DW$341       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    3182                      .dwattr $C$DW$341, DW_AT_name("rsvd5_7")
    3183                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_rsvd5_7")
    3184                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3185                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3186              
    3187              $C$DW$342       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    3189                      .dwattr $C$DW$342, DW_AT_name("rsvd5_8")
    3190                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd5_8")
    3191                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3192                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3193              
    3194              $C$DW$343       .dwtag  DW_TAG_member
    3195                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    3196                      .dwattr $C$DW$343, DW_AT_name("SPIRXINTA")
    3197                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_SPIRXINTA")
    3198                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3199                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3200              
    3201              $C$DW$344       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   60

    3202                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    3203                      .dwattr $C$DW$344, DW_AT_name("SPITXINTA")
    3204                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_SPITXINTA")
    3205                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3206                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3207              
    3208              $C$DW$345       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    3210                      .dwattr $C$DW$345, DW_AT_name("rsvd6_3")
    3211                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd6_3")
    3212                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3213                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3214              
    3215              $C$DW$346       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    3217                      .dwattr $C$DW$346, DW_AT_name("rsvd6_4")
    3218                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_rsvd6_4")
    3219                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3220                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3221              
    3222              $C$DW$347       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    3224                      .dwattr $C$DW$347, DW_AT_name("rsvd6_5")
    3225                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd6_5")
    3226                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3227                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3228              
    3229              $C$DW$348       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
    3231                      .dwattr $C$DW$348, DW_AT_name("rsvd6_6")
    3232                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_rsvd6_6")
    3233                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3234                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3235              
    3236              $C$DW$349       .dwtag  DW_TAG_member
    3237                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    3238                      .dwattr $C$DW$349, DW_AT_name("rsvd6_7")
    3239                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd6_7")
    3240                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3241                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3242              
    3243              $C$DW$350       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    3245                      .dwattr $C$DW$350, DW_AT_name("rsvd6_8")
    3246                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_rsvd6_8")
    3247                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    3248                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3249              
    3250              $C$DW$351       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    3252                      .dwattr $C$DW$351, DW_AT_name("rsvd7_1")
    3253                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_rsvd7_1")
    3254                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3255                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3256              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   61

    3257              $C$DW$352       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    3259                      .dwattr $C$DW$352, DW_AT_name("rsvd7_2")
    3260                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd7_2")
    3261                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    3262                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3263              
    3264              $C$DW$353       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    3266                      .dwattr $C$DW$353, DW_AT_name("rsvd7_3")
    3267                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_rsvd7_3")
    3268                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3269                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3270              
    3271              $C$DW$354       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    3273                      .dwattr $C$DW$354, DW_AT_name("rsvd7_4")
    3274                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd7_4")
    3275                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3276                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3277              
    3278              $C$DW$355       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    3280                      .dwattr $C$DW$355, DW_AT_name("rsvd7_5")
    3281                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_rsvd7_5")
    3282                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3283                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3284              
    3285              $C$DW$356       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    3287                      .dwattr $C$DW$356, DW_AT_name("rsvd7_6")
    3288                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd7_6")
    3289                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3290                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3291              
    3292              $C$DW$357       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    3294                      .dwattr $C$DW$357, DW_AT_name("rsvd7_7")
    3295                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_rsvd7_7")
    3296                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3297                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3298              
    3299              $C$DW$358       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    3301                      .dwattr $C$DW$358, DW_AT_name("rsvd7_8")
    3302                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd7_8")
    3303                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3304                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3305              
    3306              $C$DW$359       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    3308                      .dwattr $C$DW$359, DW_AT_name("I2CINT1A")
    3309                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_I2CINT1A")
    3310                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3311                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   62

    3312              
    3313              $C$DW$360       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
    3315                      .dwattr $C$DW$360, DW_AT_name("I2CINT2A")
    3316                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_I2CINT2A")
    3317                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3318                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3319              
    3320              $C$DW$361       .dwtag  DW_TAG_member
    3321                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    3322                      .dwattr $C$DW$361, DW_AT_name("rsvd8_3")
    3323                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_rsvd8_3")
    3324                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3325                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3326              
    3327              $C$DW$362       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    3329                      .dwattr $C$DW$362, DW_AT_name("rsvd8_4")
    3330                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd8_4")
    3331                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3332                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3333              
    3334              $C$DW$363       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    3336                      .dwattr $C$DW$363, DW_AT_name("rsvd8_5")
    3337                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd8_5")
    3338                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3339                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$364       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    3343                      .dwattr $C$DW$364, DW_AT_name("rsvd8_6")
    3344                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd8_6")
    3345                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3346                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3347              
    3348              $C$DW$365       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    3350                      .dwattr $C$DW$365, DW_AT_name("rsvd8_7")
    3351                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd8_7")
    3352                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3353                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3354              
    3355              $C$DW$366       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    3357                      .dwattr $C$DW$366, DW_AT_name("rsvd8_8")
    3358                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_rsvd8_8")
    3359                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3360                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3361              
    3362              $C$DW$367       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    3364                      .dwattr $C$DW$367, DW_AT_name("SCIRXINTA")
    3365                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_SCIRXINTA")
    3366                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   63

    3367                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3368              
    3369              $C$DW$368       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    3371                      .dwattr $C$DW$368, DW_AT_name("SCITXINTA")
    3372                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_SCITXINTA")
    3373                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3374                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3375              
    3376              $C$DW$369       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    3378                      .dwattr $C$DW$369, DW_AT_name("rsvd9_3")
    3379                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd9_3")
    3380                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    3381                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3382              
    3383              $C$DW$370       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    3385                      .dwattr $C$DW$370, DW_AT_name("rsvd9_4")
    3386                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd9_4")
    3387                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3388                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3389              
    3390              $C$DW$371       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    3392                      .dwattr $C$DW$371, DW_AT_name("rsvd9_5")
    3393                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd9_5")
    3394                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3395                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3396              
    3397              $C$DW$372       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    3399                      .dwattr $C$DW$372, DW_AT_name("rsvd9_6")
    3400                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd9_6")
    3401                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3402                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3403              
    3404              $C$DW$373       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    3406                      .dwattr $C$DW$373, DW_AT_name("rsvd9_7")
    3407                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd9_7")
    3408                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3409                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3410              
    3411              $C$DW$374       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    3413                      .dwattr $C$DW$374, DW_AT_name("rsvd9_8")
    3414                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd9_8")
    3415                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3416                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3417              
    3418              $C$DW$375       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    3420                      .dwattr $C$DW$375, DW_AT_name("ADCINT1")
    3421                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCINT1")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   64

    3422                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3423                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3424              
    3425              $C$DW$376       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    3427                      .dwattr $C$DW$376, DW_AT_name("ADCINT2")
    3428                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINT2")
    3429                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3430                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3431              
    3432              $C$DW$377       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    3434                      .dwattr $C$DW$377, DW_AT_name("ADCINT3")
    3435                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINT3")
    3436                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3437                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3438              
    3439              $C$DW$378       .dwtag  DW_TAG_member
    3440                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    3441                      .dwattr $C$DW$378, DW_AT_name("ADCINT4")
    3442                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCINT4")
    3443                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3444                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3445              
    3446              $C$DW$379       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    3448                      .dwattr $C$DW$379, DW_AT_name("ADCINT5")
    3449                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINT5")
    3450                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3451                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3452              
    3453              $C$DW$380       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    3455                      .dwattr $C$DW$380, DW_AT_name("ADCINT6")
    3456                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINT6")
    3457                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3458                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3459              
    3460              $C$DW$381       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    3462                      .dwattr $C$DW$381, DW_AT_name("ADCINT7")
    3463                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCINT7")
    3464                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3465                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3466              
    3467              $C$DW$382       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    3469                      .dwattr $C$DW$382, DW_AT_name("ADCINT8")
    3470                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCINT8")
    3471                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3472                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3473              
    3474              $C$DW$383       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    3476                      .dwattr $C$DW$383, DW_AT_name("rsvd11_1")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   65

    3477                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd11_1")
    3478                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3479                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3480              
    3481              $C$DW$384       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    3483                      .dwattr $C$DW$384, DW_AT_name("rsvd11_2")
    3484                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd11_2")
    3485                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3486                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3487              
    3488              $C$DW$385       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    3490                      .dwattr $C$DW$385, DW_AT_name("rsvd11_3")
    3491                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd11_3")
    3492                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3493                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3494              
    3495              $C$DW$386       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    3497                      .dwattr $C$DW$386, DW_AT_name("rsvd11_4")
    3498                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd11_4")
    3499                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3500                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3501              
    3502              $C$DW$387       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    3504                      .dwattr $C$DW$387, DW_AT_name("rsvd11_5")
    3505                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd11_5")
    3506                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3507                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3508              
    3509              $C$DW$388       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    3511                      .dwattr $C$DW$388, DW_AT_name("rsvd11_6")
    3512                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd11_6")
    3513                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    3514                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3515              
    3516              $C$DW$389       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    3518                      .dwattr $C$DW$389, DW_AT_name("rsvd11_7")
    3519                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd11_7")
    3520                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3521                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3522              
    3523              $C$DW$390       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    3525                      .dwattr $C$DW$390, DW_AT_name("rsvd11_8")
    3526                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd11_8")
    3527                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    3528                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3529              
    3530              $C$DW$391       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   66

    3532                      .dwattr $C$DW$391, DW_AT_name("XINT3")
    3533                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_XINT3")
    3534                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3535                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3536              
    3537              $C$DW$392       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    3539                      .dwattr $C$DW$392, DW_AT_name("rsvd12_2")
    3540                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd12_2")
    3541                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    3542                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3543              
    3544              $C$DW$393       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    3546                      .dwattr $C$DW$393, DW_AT_name("rsvd12_3")
    3547                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd12_3")
    3548                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3549                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3550              
    3551              $C$DW$394       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    3553                      .dwattr $C$DW$394, DW_AT_name("rsvd12_4")
    3554                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_rsvd12_4")
    3555                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    3556                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3557              
    3558              $C$DW$395       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    3560                      .dwattr $C$DW$395, DW_AT_name("rsvd12_5")
    3561                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd12_5")
    3562                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3563                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3564              
    3565              $C$DW$396       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    3567                      .dwattr $C$DW$396, DW_AT_name("rsvd12_6")
    3568                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd12_6")
    3569                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    3570                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3571              
    3572              $C$DW$397       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    3574                      .dwattr $C$DW$397, DW_AT_name("rsvd12_7")
    3575                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd12_7")
    3576                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3577                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3578              
    3579              $C$DW$398       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
    3581                      .dwattr $C$DW$398, DW_AT_name("rsvd12_8")
    3582                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_rsvd12_8")
    3583                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    3584                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3585              
    3586              $C$DW$399       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   67

    3587                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$30)
    3588                      .dwattr $C$DW$399, DW_AT_name("rsvd13")
    3589                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_rsvd13")
    3590                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3591                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3592              
    3593              $C$DW$400       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$31)
    3595                      .dwattr $C$DW$400, DW_AT_name("XINTnCR")
    3596                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_XINTnCR")
    3597                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    3598                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3599              
    3600              $C$DW$401       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$32)
    3602                      .dwattr $C$DW$401, DW_AT_name("rsvd14")
    3603                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd14")
    3604                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    3605                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3606              
    3607              $C$DW$402       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$31)
    3609                      .dwattr $C$DW$402, DW_AT_name("XINTnCTR")
    3610                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_XINTnCTR")
    3611                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    3612                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3613              
    3614                      .dwendtag $C$DW$T$33
    3615              
    3616              $C$DW$T$60      .dwtag  DW_TAG_typedef
    3617                      .dwattr $C$DW$T$60, DW_AT_name("PIE_Obj")
    3618                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    3619                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3620              
    3621              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3622                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
    3623                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3624              
    3625              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3626                      .dwattr $C$DW$T$62, DW_AT_name("PIE_Handle")
    3627                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3628                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3629              
    3630              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    3631                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$62)
    3632              
    3633              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3634                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$403)
    3635              
    3636              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3637                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3638              
    3639              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3640                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3641                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2068810                          PAGE   68

    3642              
    3643              
    3644              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    3645                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3646                      .dwendtag $C$DW$T$26
    3647              
    3648              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3649                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3650                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3651              
    3652              $C$DW$T$28      .dwtag  DW_TAG_typedef
    3653                      .dwattr $C$DW$T$28, DW_AT_name("PIE_IntVec_t")
    3654                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3655                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3656              
    3657              $C$DW$404       .dwtag  DW_TAG_TI_far_type
    3658                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    3659              
    3660              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    3661                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$404)
    3662              
    3663              $C$DW$405       .dwtag  DW_TAG_TI_far_type
    3664                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$28)
    3665              
    3666              $C$DW$T$70      .dwtag  DW_TAG_const_type
    3667                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$405)
    3668              
    3669              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    3670                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    3671                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    3672              
    3673              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3674                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3675                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3676                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3677              
