TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:06 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/pwm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    8661                      .dwendtag $C$DW$T$117
    8662              
    8663              $C$DW$T$118     .dwtag  DW_TAG_typedef
    8664                      .dwattr $C$DW$T$118, DW_AT_name("PWM_SyncMode_e")
    8665                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    8666                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    8667              
    8668              $C$DW$753       .dwtag  DW_TAG_TI_far_type
    8669                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$118)
    8670              
    8671              $C$DW$T$119     .dwtag  DW_TAG_const_type
    8672                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$753)
    8673              
    8674              
    8675              $C$DW$T$120     .dwtag  DW_TAG_enumeration_type
    8676                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x01)
    8677              $C$DW$754       .dwtag  DW_TAG_enumerator
    8678                      .dwattr $C$DW$754, DW_AT_name("PWM_TripZoneDCEventSel_Disabled")
    8679                      .dwattr $C$DW$754, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  161

    8680              
    8681              $C$DW$755       .dwtag  DW_TAG_enumerator
    8682                      .dwattr $C$DW$755, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLX")
    8683                      .dwattr $C$DW$755, DW_AT_const_value(0x01)
    8684              
    8685              $C$DW$756       .dwtag  DW_TAG_enumerator
    8686                      .dwattr $C$DW$756, DW_AT_name("PWM_TripZoneDCEventSel_DCxHH_DCxLX")
    8687                      .dwattr $C$DW$756, DW_AT_const_value(0x02)
    8688              
    8689              $C$DW$757       .dwtag  DW_TAG_enumerator
    8690                      .dwattr $C$DW$757, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLL")
    8691                      .dwattr $C$DW$757, DW_AT_const_value(0x03)
    8692              
    8693              $C$DW$758       .dwtag  DW_TAG_enumerator
    8694                      .dwattr $C$DW$758, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLH")
    8695                      .dwattr $C$DW$758, DW_AT_const_value(0x04)
    8696              
    8697              $C$DW$759       .dwtag  DW_TAG_enumerator
    8698                      .dwattr $C$DW$759, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLH")
    8699                      .dwattr $C$DW$759, DW_AT_const_value(0x05)
    8700              
    8701                      .dwendtag $C$DW$T$120
    8702              
    8703              $C$DW$T$121     .dwtag  DW_TAG_typedef
    8704                      .dwattr $C$DW$T$121, DW_AT_name("PWM_TripZoneDCEventSel_e")
    8705                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    8706                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    8707              
    8708              $C$DW$760       .dwtag  DW_TAG_TI_far_type
    8709                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$121)
    8710              
    8711              $C$DW$T$122     .dwtag  DW_TAG_const_type
    8712                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$760)
    8713              
    8714              
    8715              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    8716                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    8717              $C$DW$761       .dwtag  DW_TAG_enumerator
    8718                      .dwattr $C$DW$761, DW_AT_name("PWM_TripZoneState_HighImp")
    8719                      .dwattr $C$DW$761, DW_AT_const_value(0x00)
    8720              
    8721              $C$DW$762       .dwtag  DW_TAG_enumerator
    8722                      .dwattr $C$DW$762, DW_AT_name("PWM_TripZoneState_EPWM_High")
    8723                      .dwattr $C$DW$762, DW_AT_const_value(0x01)
    8724              
    8725              $C$DW$763       .dwtag  DW_TAG_enumerator
    8726                      .dwattr $C$DW$763, DW_AT_name("PWM_TripZoneState_EPWM_Low")
    8727                      .dwattr $C$DW$763, DW_AT_const_value(0x02)
    8728              
    8729              $C$DW$764       .dwtag  DW_TAG_enumerator
    8730                      .dwattr $C$DW$764, DW_AT_name("PWM_TripZoneState_DoNothing")
    8731                      .dwattr $C$DW$764, DW_AT_const_value(0x03)
    8732              
    8733                      .dwendtag $C$DW$T$123
    8734              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  162

    8735              $C$DW$T$124     .dwtag  DW_TAG_typedef
    8736                      .dwattr $C$DW$T$124, DW_AT_name("PWM_TripZoneState_e")
    8737                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    8738                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    8739              
    8740              $C$DW$765       .dwtag  DW_TAG_TI_far_type
    8741                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$124)
    8742              
    8743              $C$DW$T$125     .dwtag  DW_TAG_const_type
    8744                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$765)
    8745              
    8746              
    8747              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8748                      .dwattr $C$DW$T$23, DW_AT_name("_PWM_Obj_")
    8749                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x3a)
    8750              $C$DW$766       .dwtag  DW_TAG_member
    8751                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$20)
    8752                      .dwattr $C$DW$766, DW_AT_name("TBCTL")
    8753                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_TBCTL")
    8754                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8755                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8756              
    8757              $C$DW$767       .dwtag  DW_TAG_member
    8758                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$20)
    8759                      .dwattr $C$DW$767, DW_AT_name("TBSTS")
    8760                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_TBSTS")
    8761                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8762                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8763              
    8764              $C$DW$768       .dwtag  DW_TAG_member
    8765                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$20)
    8766                      .dwattr $C$DW$768, DW_AT_name("TBPHSHR")
    8767                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_TBPHSHR")
    8768                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8769                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8770              
    8771              $C$DW$769       .dwtag  DW_TAG_member
    8772                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$20)
    8773                      .dwattr $C$DW$769, DW_AT_name("TBPHS")
    8774                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_TBPHS")
    8775                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8776                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8777              
    8778              $C$DW$770       .dwtag  DW_TAG_member
    8779                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$20)
    8780                      .dwattr $C$DW$770, DW_AT_name("TBCTR")
    8781                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_TBCTR")
    8782                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8783                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8784              
    8785              $C$DW$771       .dwtag  DW_TAG_member
    8786                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$20)
    8787                      .dwattr $C$DW$771, DW_AT_name("TBPRD")
    8788                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_TBPRD")
    8789                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  163

    8790                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8791              
    8792              $C$DW$772       .dwtag  DW_TAG_member
    8793                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$20)
    8794                      .dwattr $C$DW$772, DW_AT_name("TBPRDHR")
    8795                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_TBPRDHR")
    8796                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8797                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8798              
    8799              $C$DW$773       .dwtag  DW_TAG_member
    8800                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$20)
    8801                      .dwattr $C$DW$773, DW_AT_name("CMPCTL")
    8802                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_CMPCTL")
    8803                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8804                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8805              
    8806              $C$DW$774       .dwtag  DW_TAG_member
    8807                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$20)
    8808                      .dwattr $C$DW$774, DW_AT_name("CMPAHR")
    8809                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_CMPAHR")
    8810                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8811                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8812              
    8813              $C$DW$775       .dwtag  DW_TAG_member
    8814                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$20)
    8815                      .dwattr $C$DW$775, DW_AT_name("CMPA")
    8816                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_CMPA")
    8817                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8818                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8819              
    8820              $C$DW$776       .dwtag  DW_TAG_member
    8821                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$20)
    8822                      .dwattr $C$DW$776, DW_AT_name("CMPB")
    8823                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_CMPB")
    8824                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8825                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8826              
    8827              $C$DW$777       .dwtag  DW_TAG_member
    8828                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$20)
    8829                      .dwattr $C$DW$777, DW_AT_name("AQCTLA")
    8830                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_AQCTLA")
    8831                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8832                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8833              
    8834              $C$DW$778       .dwtag  DW_TAG_member
    8835                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$20)
    8836                      .dwattr $C$DW$778, DW_AT_name("AQCTLB")
    8837                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_AQCTLB")
    8838                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8839                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8840              
    8841              $C$DW$779       .dwtag  DW_TAG_member
    8842                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$20)
    8843                      .dwattr $C$DW$779, DW_AT_name("AQSFRC")
    8844                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_AQSFRC")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  164

    8845                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8846                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8847              
    8848              $C$DW$780       .dwtag  DW_TAG_member
    8849                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$20)
    8850                      .dwattr $C$DW$780, DW_AT_name("AQCSFRC")
    8851                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_AQCSFRC")
    8852                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8853                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8854              
    8855              $C$DW$781       .dwtag  DW_TAG_member
    8856                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$20)
    8857                      .dwattr $C$DW$781, DW_AT_name("DBCTL")
    8858                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_DBCTL")
    8859                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8860                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8861              
    8862              $C$DW$782       .dwtag  DW_TAG_member
    8863                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$20)
    8864                      .dwattr $C$DW$782, DW_AT_name("DBRED")
    8865                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_DBRED")
    8866                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8867                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8868              
    8869              $C$DW$783       .dwtag  DW_TAG_member
    8870                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$20)
    8871                      .dwattr $C$DW$783, DW_AT_name("DBFED")
    8872                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_DBFED")
    8873                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8874                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8875              
    8876              $C$DW$784       .dwtag  DW_TAG_member
    8877                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$20)
    8878                      .dwattr $C$DW$784, DW_AT_name("TZSEL")
    8879                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_TZSEL")
    8880                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8881                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8882              
    8883              $C$DW$785       .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$20)
    8885                      .dwattr $C$DW$785, DW_AT_name("TZDCSEL")
    8886                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_TZDCSEL")
    8887                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8888                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8889              
    8890              $C$DW$786       .dwtag  DW_TAG_member
    8891                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$20)
    8892                      .dwattr $C$DW$786, DW_AT_name("TZCTL")
    8893                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_TZCTL")
    8894                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8895                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8896              
    8897              $C$DW$787       .dwtag  DW_TAG_member
    8898                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
    8899                      .dwattr $C$DW$787, DW_AT_name("TZEINT")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  165

    8900                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_TZEINT")
    8901                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8902                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8903              
    8904              $C$DW$788       .dwtag  DW_TAG_member
    8905                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
    8906                      .dwattr $C$DW$788, DW_AT_name("TZFLG")
    8907                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_TZFLG")
    8908                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8909                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8910              
    8911              $C$DW$789       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$20)
    8913                      .dwattr $C$DW$789, DW_AT_name("TZCLR")
    8914                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_TZCLR")
    8915                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8916                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$790       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$20)
    8920                      .dwattr $C$DW$790, DW_AT_name("TZFRC")
    8921                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_TZFRC")
    8922                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8923                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$791       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$20)
    8927                      .dwattr $C$DW$791, DW_AT_name("ETSEL")
    8928                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_ETSEL")
    8929                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8930                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932              $C$DW$792       .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$20)
    8934                      .dwattr $C$DW$792, DW_AT_name("ETPS")
    8935                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ETPS")
    8936                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8937                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8938              
    8939              $C$DW$793       .dwtag  DW_TAG_member
    8940                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$20)
    8941                      .dwattr $C$DW$793, DW_AT_name("ETFLG")
    8942                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ETFLG")
    8943                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8944                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8945              
    8946              $C$DW$794       .dwtag  DW_TAG_member
    8947                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$20)
    8948                      .dwattr $C$DW$794, DW_AT_name("ETCLR")
    8949                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ETCLR")
    8950                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8951                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8952              
    8953              $C$DW$795       .dwtag  DW_TAG_member
    8954                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  166

    8955                      .dwattr $C$DW$795, DW_AT_name("ETFRC")
    8956                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ETFRC")
    8957                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8958                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8959              
    8960              $C$DW$796       .dwtag  DW_TAG_member
    8961                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$20)
    8962                      .dwattr $C$DW$796, DW_AT_name("PCCTL")
    8963                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_PCCTL")
    8964                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8965                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8966              
    8967              $C$DW$797       .dwtag  DW_TAG_member
    8968                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
    8969                      .dwattr $C$DW$797, DW_AT_name("rsvd_1")
    8970                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_rsvd_1")
    8971                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    8972                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8973              
    8974              $C$DW$798       .dwtag  DW_TAG_member
    8975                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    8976                      .dwattr $C$DW$798, DW_AT_name("HRCNFG")
    8977                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_HRCNFG")
    8978                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8979                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8980              
    8981              $C$DW$799       .dwtag  DW_TAG_member
    8982                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
    8983                      .dwattr $C$DW$799, DW_AT_name("HRPWR")
    8984                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_HRPWR")
    8985                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8986                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8987              
    8988              $C$DW$800       .dwtag  DW_TAG_member
    8989                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$21)
    8990                      .dwattr $C$DW$800, DW_AT_name("rsvd_2")
    8991                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_rsvd_2")
    8992                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8993                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8994              
    8995              $C$DW$801       .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
    8997                      .dwattr $C$DW$801, DW_AT_name("HRMSTEP")
    8998                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_HRMSTEP")
    8999                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9000                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9001              
    9002              $C$DW$802       .dwtag  DW_TAG_member
    9003                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    9004                      .dwattr $C$DW$802, DW_AT_name("rsvd_3")
    9005                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_3")
    9006                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9007                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9008              
    9009              $C$DW$803       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  167

    9010                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
    9011                      .dwattr $C$DW$803, DW_AT_name("HRPCTL")
    9012                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_HRPCTL")
    9013                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9014                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9015              
    9016              $C$DW$804       .dwtag  DW_TAG_member
    9017                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
    9018                      .dwattr $C$DW$804, DW_AT_name("rsvd_4")
    9019                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_rsvd_4")
    9020                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    9021                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9022              
    9023              $C$DW$805       .dwtag  DW_TAG_member
    9024                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    9025                      .dwattr $C$DW$805, DW_AT_name("TBPRDHRM")
    9026                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_TBPRDHRM")
    9027                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9028                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9029              
    9030              $C$DW$806       .dwtag  DW_TAG_member
    9031                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
    9032                      .dwattr $C$DW$806, DW_AT_name("TBPRDM")
    9033                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_TBPRDM")
    9034                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    9035                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9036              
    9037              $C$DW$807       .dwtag  DW_TAG_member
    9038                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    9039                      .dwattr $C$DW$807, DW_AT_name("CMPAHRM")
    9040                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CMPAHRM")
    9041                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9042                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9043              
    9044              $C$DW$808       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
    9046                      .dwattr $C$DW$808, DW_AT_name("CMPAM")
    9047                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_CMPAM")
    9048                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    9049                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9050              
    9051              $C$DW$809       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
    9053                      .dwattr $C$DW$809, DW_AT_name("rsvd_5")
    9054                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_rsvd_5")
    9055                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9056                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9057              
    9058              $C$DW$810       .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
    9060                      .dwattr $C$DW$810, DW_AT_name("DCTRIPSEL")
    9061                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_DCTRIPSEL")
    9062                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9063                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9064              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  168

    9065              $C$DW$811       .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
    9067                      .dwattr $C$DW$811, DW_AT_name("DCACTL")
    9068                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_DCACTL")
    9069                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    9070                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9071              
    9072              $C$DW$812       .dwtag  DW_TAG_member
    9073                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    9074                      .dwattr $C$DW$812, DW_AT_name("DCBCTL")
    9075                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_DCBCTL")
    9076                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9077                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9078              
    9079              $C$DW$813       .dwtag  DW_TAG_member
    9080                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
    9081                      .dwattr $C$DW$813, DW_AT_name("DCFCTL")
    9082                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_DCFCTL")
    9083                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    9084                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9085              
    9086              $C$DW$814       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    9088                      .dwattr $C$DW$814, DW_AT_name("DCCAPCTL")
    9089                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DCCAPCTL")
    9090                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9091                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9092              
    9093              $C$DW$815       .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    9095                      .dwattr $C$DW$815, DW_AT_name("DCFOFFSET")
    9096                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_DCFOFFSET")
    9097                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    9098                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9099              
    9100              $C$DW$816       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
    9102                      .dwattr $C$DW$816, DW_AT_name("DCFOFFSETCNT")
    9103                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    9104                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9105                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9106              
    9107              $C$DW$817       .dwtag  DW_TAG_member
    9108                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    9109                      .dwattr $C$DW$817, DW_AT_name("DCFWINDOW")
    9110                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_DCFWINDOW")
    9111                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    9112                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9113              
    9114              $C$DW$818       .dwtag  DW_TAG_member
    9115                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    9116                      .dwattr $C$DW$818, DW_AT_name("DCFWINDOWCNT")
    9117                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    9118                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9119                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  169

    9120              
    9121              $C$DW$819       .dwtag  DW_TAG_member
    9122                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
    9123                      .dwattr $C$DW$819, DW_AT_name("DCCAP")
    9124                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_DCCAP")
    9125                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    9126                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9127              
    9128                      .dwendtag $C$DW$T$23
    9129              
    9130              $C$DW$T$126     .dwtag  DW_TAG_typedef
    9131                      .dwattr $C$DW$T$126, DW_AT_name("PWM_Obj")
    9132                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$23)
    9133                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    9134              
    9135              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    9136                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    9137                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    9138              
    9139              $C$DW$T$33      .dwtag  DW_TAG_typedef
    9140                      .dwattr $C$DW$T$33, DW_AT_name("PWM_Handle")
    9141                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    9142                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    9143              
    9144              $C$DW$820       .dwtag  DW_TAG_TI_far_type
    9145                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$33)
    9146              
    9147              $C$DW$T$127     .dwtag  DW_TAG_const_type
    9148                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$820)
    9149              
    9150              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    9151                      .dwattr $C$DW$T$2, DW_AT_name("void")
    9152              
    9153              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    9154                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    9155                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    9156              
    9157              $C$DW$T$4       .dwtag  DW_TAG_base_type
    9158                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    9159                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    9160                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    9161              
    9162              $C$DW$T$5       .dwtag  DW_TAG_base_type
    9163                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    9164                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    9165                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    9166              
    9167              $C$DW$T$6       .dwtag  DW_TAG_base_type
    9168                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    9169                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    9170                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    9171              
    9172              $C$DW$T$7       .dwtag  DW_TAG_base_type
    9173                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    9174                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2170410                          PAGE  170

    9175                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    9176              
    9177              $C$DW$T$8       .dwtag  DW_TAG_base_type
    9178                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    9179                      .dwattr $C$DW$T$8, DW_AT_name("short")
    9180                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    9181              
    9182              $C$DW$T$9       .dwtag  DW_TAG_base_type
    9183                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    9184                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    9185                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    9186              
    9187              $C$DW$T$10      .dwtag  DW_TAG_base_type
