TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:09 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/sci.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    3517              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3518                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3519              $C$DW$260       .dwtag  DW_TAG_enumerator
    3520                      .dwattr $C$DW$260, DW_AT_name("SCI_Priority_Immediate")
    3521                      .dwattr $C$DW$260, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE   66

    3522              
    3523              $C$DW$261       .dwtag  DW_TAG_enumerator
    3524                      .dwattr $C$DW$261, DW_AT_name("SCI_Priority_FreeRun")
    3525                      .dwattr $C$DW$261, DW_AT_const_value(0x08)
    3526              
    3527              $C$DW$262       .dwtag  DW_TAG_enumerator
    3528                      .dwattr $C$DW$262, DW_AT_name("SCI_Priority_AfterRxRxSeq")
    3529                      .dwattr $C$DW$262, DW_AT_const_value(0x10)
    3530              
    3531                      .dwendtag $C$DW$T$41
    3532              
    3533              $C$DW$T$42      .dwtag  DW_TAG_typedef
    3534                      .dwattr $C$DW$T$42, DW_AT_name("SCI_Priority_e")
    3535                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3536                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3537              
    3538              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    3539                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$42)
    3540              
    3541              $C$DW$T$43      .dwtag  DW_TAG_const_type
    3542                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$263)
    3543              
    3544              
    3545              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    3546                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3547              $C$DW$264       .dwtag  DW_TAG_enumerator
    3548                      .dwattr $C$DW$264, DW_AT_name("SCI_Parity_Odd")
    3549                      .dwattr $C$DW$264, DW_AT_const_value(0x00)
    3550              
    3551              $C$DW$265       .dwtag  DW_TAG_enumerator
    3552                      .dwattr $C$DW$265, DW_AT_name("SCI_Parity_Even")
    3553                      .dwattr $C$DW$265, DW_AT_const_value(0x40)
    3554              
    3555                      .dwendtag $C$DW$T$44
    3556              
    3557              $C$DW$T$45      .dwtag  DW_TAG_typedef
    3558                      .dwattr $C$DW$T$45, DW_AT_name("SCI_Parity_e")
    3559                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3560                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3561              
    3562              $C$DW$266       .dwtag  DW_TAG_TI_far_type
    3563                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$45)
    3564              
    3565              $C$DW$T$46      .dwtag  DW_TAG_const_type
    3566                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$266)
    3567              
    3568              
    3569              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3570                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3571              $C$DW$267       .dwtag  DW_TAG_enumerator
    3572                      .dwattr $C$DW$267, DW_AT_name("SCI_FifoLevel_Empty")
    3573                      .dwattr $C$DW$267, DW_AT_const_value(0x00)
    3574              
    3575              $C$DW$268       .dwtag  DW_TAG_enumerator
    3576                      .dwattr $C$DW$268, DW_AT_name("SCI_FifoLevel_1_Word")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE   67

    3577                      .dwattr $C$DW$268, DW_AT_const_value(0x01)
    3578              
    3579              $C$DW$269       .dwtag  DW_TAG_enumerator
    3580                      .dwattr $C$DW$269, DW_AT_name("SCI_FifoLevel_2_Words")
    3581                      .dwattr $C$DW$269, DW_AT_const_value(0x02)
    3582              
    3583              $C$DW$270       .dwtag  DW_TAG_enumerator
    3584                      .dwattr $C$DW$270, DW_AT_name("SCI_FifoLevel_3_Words")
    3585                      .dwattr $C$DW$270, DW_AT_const_value(0x03)
    3586              
    3587              $C$DW$271       .dwtag  DW_TAG_enumerator
    3588                      .dwattr $C$DW$271, DW_AT_name("SCI_FifoLevel_4_Words")
    3589                      .dwattr $C$DW$271, DW_AT_const_value(0x04)
    3590              
    3591                      .dwendtag $C$DW$T$47
    3592              
    3593              $C$DW$T$48      .dwtag  DW_TAG_typedef
    3594                      .dwattr $C$DW$T$48, DW_AT_name("SCI_FifoLevel_e")
    3595                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3596                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3597              
    3598              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    3599                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$48)
    3600              
    3601              $C$DW$T$49      .dwtag  DW_TAG_const_type
    3602                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$272)
    3603              
    3604              
    3605              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3606                      .dwattr $C$DW$T$22, DW_AT_name("_SCI_Obj_")
    3607                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3608              $C$DW$273       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    3610                      .dwattr $C$DW$273, DW_AT_name("SCICCR")
    3611                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SCICCR")
    3612                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3614              
    3615              $C$DW$274       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    3617                      .dwattr $C$DW$274, DW_AT_name("SCICTL1")
    3618                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_SCICTL1")
    3619                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3620                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3621              
    3622              $C$DW$275       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    3624                      .dwattr $C$DW$275, DW_AT_name("SCIHBAUD")
    3625                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_SCIHBAUD")
    3626                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3627                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3628              
    3629              $C$DW$276       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3631                      .dwattr $C$DW$276, DW_AT_name("SCILBAUD")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE   68

    3632                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_SCILBAUD")
    3633                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3634                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3635              
    3636              $C$DW$277       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    3638                      .dwattr $C$DW$277, DW_AT_name("SCICTL2")
    3639                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_SCICTL2")
    3640                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3641                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3642              
    3643              $C$DW$278       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    3645                      .dwattr $C$DW$278, DW_AT_name("SCIRXST")
    3646                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_SCIRXST")
    3647                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3648                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3649              
    3650              $C$DW$279       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    3652                      .dwattr $C$DW$279, DW_AT_name("SCIRXEMU")
    3653                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_SCIRXEMU")
    3654                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3655                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3656              
    3657              $C$DW$280       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    3659                      .dwattr $C$DW$280, DW_AT_name("SCIRXBUF")
    3660                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_SCIRXBUF")
    3661                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3662                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3663              
    3664              $C$DW$281       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    3666                      .dwattr $C$DW$281, DW_AT_name("rsvd_1")
    3667                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd_1")
    3668                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3669                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3670              
    3671              $C$DW$282       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3673                      .dwattr $C$DW$282, DW_AT_name("SCITXBUF")
    3674                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SCITXBUF")
    3675                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3676                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3677              
    3678              $C$DW$283       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    3680                      .dwattr $C$DW$283, DW_AT_name("SCIFFTX")
    3681                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_SCIFFTX")
    3682                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3683                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3684              
    3685              $C$DW$284       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE   69

    3687                      .dwattr $C$DW$284, DW_AT_name("SCIFFRX")
    3688                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SCIFFRX")
    3689                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3690                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3691              
    3692              $C$DW$285       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    3694                      .dwattr $C$DW$285, DW_AT_name("SCIFFCT")
    3695                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_SCIFFCT")
    3696                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3697                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3698              
    3699              $C$DW$286       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    3701                      .dwattr $C$DW$286, DW_AT_name("rsvd_2")
    3702                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_rsvd_2")
    3703                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3704                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3705              
    3706              $C$DW$287       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    3708                      .dwattr $C$DW$287, DW_AT_name("SCIPRI")
    3709                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_SCIPRI")
    3710                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3711                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3712              
    3713                      .dwendtag $C$DW$T$22
    3714              
    3715              $C$DW$T$50      .dwtag  DW_TAG_typedef
    3716                      .dwattr $C$DW$T$50, DW_AT_name("SCI_Obj")
    3717                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$22)
    3718                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3719              
    3720              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3721                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    3722                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    3723              
    3724              $C$DW$T$26      .dwtag  DW_TAG_typedef
    3725                      .dwattr $C$DW$T$26, DW_AT_name("SCI_Handle")
    3726                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3727                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3728              
    3729              $C$DW$288       .dwtag  DW_TAG_TI_far_type
    3730                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$26)
    3731              
    3732              $C$DW$T$51      .dwtag  DW_TAG_const_type
    3733                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$288)
    3734              
    3735              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3736                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3737              
    3738              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3739                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3740                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3741              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:10 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2213610                          PAGE   70

    3742              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3743                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3744                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3745                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3746              
    3747              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3748                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3749                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3750                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3751              
    3752              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3753                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3754                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3755                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3756              
    3757              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3758                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3759                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3760                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3761              
    3762              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3763                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3764                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3765                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3766              
    3767              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3768                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3769                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3770                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3771              
    3772              $C$DW$T$10      .dwtag  DW_TAG_base_type
