TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:34:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2102410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 15:34:12 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/sci_io.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     614                      .dwattr $C$DW$48, DW_AT_TI_begin_file("../drivers/source/sci_io.c")
     615                      .dwattr $C$DW$48, DW_AT_TI_begin_line(0x36)
     616                      .dwattr $C$DW$48, DW_AT_TI_begin_column(0x05)
     617                      .dwattr $C$DW$48, DW_AT_TI_max_frame_size(-2)
     618                      .dwpsn  file "../drivers/source/sci_io.c",line 55,column 1,is_stmt,address _SCI_close,isa 0
     619              
     620                      .dwfde $C$DW$CIE, _SCI_close
     621              $C$DW$49        .dwtag  DW_TAG_formal_parameter
     622                      .dwattr $C$DW$49, DW_AT_name("dev_fd")
     623                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_dev_fd")
     624                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$10)
     625                      .dwattr $C$DW$49, DW_AT_location[DW_OP_reg0]
     626              
     627              
     628              ;***************************************************************
     629              ;* FNAME: _SCI_close                    FR SIZE:   0           *
     630              ;*                                                             *
     631              ;* FUNCTION ENVIRONMENT                                        *
     632              ;*                                                             *
     633              ;* FUNCTION PROPERTIES                                         *
     634              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     635              ;***************************************************************
     636              
     637              _SCI_close:
     638              ;* AL    assigned to _dev_fd
     639              $C$DW$50        .dwtag  DW_TAG_variable
     640                      .dwattr $C$DW$50, DW_AT_name("dev_fd")
     641                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_dev_fd")
     642                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$44)
     643                      .dwattr $C$DW$50, DW_AT_location[DW_OP_reg0]
     644              
     645                      .dwcfi  cfa_offset, -2
     646                      .dwcfi  save_reg_to_mem, 26, 0
     647                      .dwpsn  file "../drivers/source/sci_io.c",line 56,column 5,is_stmt,isa 0
     648 00000043 5201          CMPB      AL,#1                 ; [CPU_] |56| 
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:34:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2102410                          PAGE   13

     649 00000044 6005          B         $C$L8,NEQ             ; [CPU_] |56| 
     650                      ; branchcc occurs ; [] |56| 
     651 00000045 761F-         MOVW      DP,#_deviceOpen       ; [CPU_U] 
         00000046 0000 
     652 00000047 9200-         MOV       AL,@_deviceOpen       ; [CPU_] |56| 
     653 00000048 6004          B         $C$L9,NEQ             ; [CPU_] |56| 
     654                      ; branchcc occurs ; [] |56| 
     655 00000049       $C$L8:    
     656                      .dwcfi  remember_state
     657                      .dwpsn  file "../drivers/source/sci_io.c",line 57,column 9,is_stmt,isa 0
     658 00000049 28A9          MOV       AL,#-1                ; [CPU_] |57| 
         0000004a FFFF 
     659              $C$DW$51        .dwtag  DW_TAG_TI_branch
     660                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     661                      .dwattr $C$DW$51, DW_AT_TI_return
     662              
     663 0000004b 0006          LRETR     ; [CPU_] 
     664                      ; return occurs ; [] 
     665                      .dwcfi  restore_state
     666 0000004c       $C$L9:    
     667                      .dwpsn  file "../drivers/source/sci_io.c",line 60,column 9,is_stmt,isa 0
     668 0000004c 9A00          MOVB      AL,#0                 ; [CPU_] |60| 
     669                      .dwpsn  file "../drivers/source/sci_io.c",line 59,column 9,is_stmt,isa 0
     670 0000004d 2B00-         MOV       @_deviceOpen,#0       ; [CPU_] |59| 
     671              $C$DW$52        .dwtag  DW_TAG_TI_branch
     672                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     673                      .dwattr $C$DW$52, DW_AT_TI_return
     674              
     675 0000004e 0006          LRETR     ; [CPU_] 
     676                      ; return occurs ; [] 
     677                      .dwattr $C$DW$48, DW_AT_TI_end_file("../drivers/source/sci_io.c")
     678                      .dwattr $C$DW$48, DW_AT_TI_end_line(0x3f)
     679                      .dwattr $C$DW$48, DW_AT_TI_end_column(0x01)
     680                      .dwendentry
     681                      .dwendtag $C$DW$48
     682              
     683              ;**************************************************************
     684              ;* UNDEFINED EXTERNAL REFERENCES                              *
     685              ;**************************************************************
     686                      .global _SCI_putDataBlocking
     687                      .global _SCI_init
     688              
     689              ;***************************************************************
     690              ;* TYPE INFORMATION                                            *
     691              ;***************************************************************
     692              
     693              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$22, DW_AT_name("_SCI_Obj_")
     695                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
     696              $C$DW$53        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     698                      .dwattr $C$DW$53, DW_AT_name("SCICCR")
     699                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_SCICCR")
     700                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:34:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2102410                          PAGE   14

     702              
     703              $C$DW$54        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     705                      .dwattr $C$DW$54, DW_AT_name("SCICTL1")
     706                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SCICTL1")
     707                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     708                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     709              
     710              $C$DW$55        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     712                      .dwattr $C$DW$55, DW_AT_name("SCIHBAUD")
     713                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SCIHBAUD")
     714                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     715                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     716              
     717              $C$DW$56        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$56, DW_AT_name("SCILBAUD")
     720                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SCILBAUD")
     721                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     722                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     723              
     724              $C$DW$57        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     726                      .dwattr $C$DW$57, DW_AT_name("SCICTL2")
     727                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_SCICTL2")
     728                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     729                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     730              
     731              $C$DW$58        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     733                      .dwattr $C$DW$58, DW_AT_name("SCIRXST")
     734                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SCIRXST")
     735                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     736                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$59        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     740                      .dwattr $C$DW$59, DW_AT_name("SCIRXEMU")
     741                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_SCIRXEMU")
     742                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     743                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$60        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     747                      .dwattr $C$DW$60, DW_AT_name("SCIRXBUF")
     748                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SCIRXBUF")
     749                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     750                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$61        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     754                      .dwattr $C$DW$61, DW_AT_name("rsvd_1")
     755                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd_1")
     756                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:34:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2102410                          PAGE   15

     757                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$62        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     761                      .dwattr $C$DW$62, DW_AT_name("SCITXBUF")
     762                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_SCITXBUF")
     763                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     764                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$63        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     768                      .dwattr $C$DW$63, DW_AT_name("SCIFFTX")
     769                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_SCIFFTX")
     770                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     771                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$64        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     775                      .dwattr $C$DW$64, DW_AT_name("SCIFFRX")
     776                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_SCIFFRX")
     777                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     778                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$65        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     782                      .dwattr $C$DW$65, DW_AT_name("SCIFFCT")
     783                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SCIFFCT")
     784                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     785                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$66        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     789                      .dwattr $C$DW$66, DW_AT_name("rsvd_2")
     790                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd_2")
     791                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     792                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794              $C$DW$67        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
     796                      .dwattr $C$DW$67, DW_AT_name("SCIPRI")
     797                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SCIPRI")
     798                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     799                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801                      .dwendtag $C$DW$T$22
     802              
     803              $C$DW$T$23      .dwtag  DW_TAG_typedef
     804                      .dwattr $C$DW$T$23, DW_AT_name("SCI_Obj")
     805                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     806                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     807              
     808              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     809                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
     810                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     811              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 15:34:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2102410                          PAGE   16

     812              $C$DW$T$25      .dwtag  DW_TAG_typedef
     813                      .dwattr $C$DW$T$25, DW_AT_name("SCI_Handle")
     814                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     815                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     816              
     817              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     818                      .dwattr $C$DW$T$2, DW_AT_name("void")
     819              
     820              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     821                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     822                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     823              
     824              $C$DW$T$4       .dwtag  DW_TAG_base_type
     825                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     826                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     827                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     828              
     829              $C$DW$T$5       .dwtag  DW_TAG_base_type
     830                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     831                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     832                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     833              
     834              $C$DW$T$6       .dwtag  DW_TAG_base_type
     835                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     836                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     837                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     838              
     839              $C$DW$T$7       .dwtag  DW_TAG_base_type
     840                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     841                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     842                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     843              
     844              $C$DW$T$8       .dwtag  DW_TAG_base_type
     845                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     846                      .dwattr $C$DW$T$8, DW_AT_name("short")
     847                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     848              
     849              $C$DW$T$9       .dwtag  DW_TAG_base_type
     850                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     851                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     852                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     853              
     854              $C$DW$T$10      .dwtag  DW_TAG_base_type
     855                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     856                      .dwattr $C$DW$T$10, DW_AT_name("int")
     857                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     858              
     859              $C$DW$68        .dwtag  DW_TAG_TI_far_type
