TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.3.LTS *
       3              ;* Date/Time created: Tue Sep 20 20:30:11 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drivers/source/spi.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Users\MaCHaDo\Dropbox\Legstrong\drv8301\legstrong\LegStrong\Debu
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\opt2000.exe C:\\Users\\MaCHaDo\\AppData\\Local\\Temp
      14              ;       C:\ti\ccsv6\tools\compiler\c2000_15.12.3.LTS\bin\ac2000.exe -@C:\\Users\\MaCHaDo\\AppData\\Local\\Tem

    2854                      .dwendtag $C$DW$T$55
    2855              
    2856              $C$DW$T$56      .dwtag  DW_TAG_typedef
    2857                      .dwattr $C$DW$T$56, DW_AT_name("SPI_FifoLevel_e")
    2858                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2859                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2860              
    2861              $C$DW$230       .dwtag  DW_TAG_TI_far_type
    2862                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$56)
    2863              
    2864              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2865                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$230)
    2866              
    2867              
    2868              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2869                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2870              $C$DW$231       .dwtag  DW_TAG_enumerator
    2871                      .dwattr $C$DW$231, DW_AT_name("SPI_SteInv_ActiveLow")
    2872                      .dwattr $C$DW$231, DW_AT_const_value(0x00)
    2873              
    2874              $C$DW$232       .dwtag  DW_TAG_enumerator
    2875                      .dwattr $C$DW$232, DW_AT_name("SPI_SteInv_ActiveHigh")
    2876                      .dwattr $C$DW$232, DW_AT_const_value(0x02)
    2877              
    2878                      .dwendtag $C$DW$T$58
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE   54

    2879              
    2880              $C$DW$T$59      .dwtag  DW_TAG_typedef
    2881                      .dwattr $C$DW$T$59, DW_AT_name("SPI_SteInv_e")
    2882                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2883                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2884              
    2885              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    2886                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$59)
    2887              
    2888              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2889                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$233)
    2890              
    2891              
    2892              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2893                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2894              $C$DW$234       .dwtag  DW_TAG_enumerator
    2895                      .dwattr $C$DW$234, DW_AT_name("SPI_TxSuspend_00")
    2896                      .dwattr $C$DW$234, DW_AT_const_value(0x00)
    2897              
    2898              $C$DW$235       .dwtag  DW_TAG_enumerator
    2899                      .dwattr $C$DW$235, DW_AT_name("SPI_TxSuspend_10")
    2900                      .dwattr $C$DW$235, DW_AT_const_value(0x20)
    2901              
    2902              $C$DW$236       .dwtag  DW_TAG_enumerator
    2903                      .dwattr $C$DW$236, DW_AT_name("SPI_TxSuspend_free")
    2904                      .dwattr $C$DW$236, DW_AT_const_value(0x10)
    2905              
    2906                      .dwendtag $C$DW$T$61
    2907              
    2908              $C$DW$T$62      .dwtag  DW_TAG_typedef
    2909                      .dwattr $C$DW$T$62, DW_AT_name("SPI_EmulationSuspend_e")
    2910                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2911                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2912              
    2913              $C$DW$237       .dwtag  DW_TAG_TI_far_type
    2914                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$62)
    2915              
    2916              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2917                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$237)
    2918              
    2919              
    2920              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2921                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2922              $C$DW$238       .dwtag  DW_TAG_enumerator
    2923                      .dwattr $C$DW$238, DW_AT_name("SPI_TriWire_NormalFourWire")
    2924                      .dwattr $C$DW$238, DW_AT_const_value(0x00)
    2925              
    2926              $C$DW$239       .dwtag  DW_TAG_enumerator
    2927                      .dwattr $C$DW$239, DW_AT_name("SPI_TriWire_ThreeWire")
    2928                      .dwattr $C$DW$239, DW_AT_const_value(0x01)
    2929              
    2930                      .dwendtag $C$DW$T$64
    2931              
    2932              $C$DW$T$65      .dwtag  DW_TAG_typedef
    2933                      .dwattr $C$DW$T$65, DW_AT_name("SPI_TriWire_e")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE   55

    2934                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2935                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2936              
    2937              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    2938                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$65)
    2939              
    2940              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2941                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$240)
    2942              
    2943              
    2944              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2945                      .dwattr $C$DW$T$22, DW_AT_name("_SPI_Obj_")
    2946                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2947              $C$DW$241       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2949                      .dwattr $C$DW$241, DW_AT_name("SPICCR")
    2950                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_SPICCR")
    2951                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2953              
    2954              $C$DW$242       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2956                      .dwattr $C$DW$242, DW_AT_name("SPICTL")
    2957                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_SPICTL")
    2958                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2959                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2960              
    2961              $C$DW$243       .dwtag  DW_TAG_member
    2962                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2963                      .dwattr $C$DW$243, DW_AT_name("SPIST")
    2964                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_SPIST")
    2965                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2966                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2967              
    2968              $C$DW$244       .dwtag  DW_TAG_member
    2969                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2970                      .dwattr $C$DW$244, DW_AT_name("rsvd_1")
    2971                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd_1")
    2972                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2973                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2974              
    2975              $C$DW$245       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2977                      .dwattr $C$DW$245, DW_AT_name("SPIBRR")
    2978                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SPIBRR")
    2979                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2980                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982              $C$DW$246       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2984                      .dwattr $C$DW$246, DW_AT_name("rsvd_2")
    2985                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd_2")
    2986                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2987                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2988              
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE   56

    2989              $C$DW$247       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2991                      .dwattr $C$DW$247, DW_AT_name("SPIEMU")
    2992                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SPIEMU")
    2993                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2994                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2995              
    2996              $C$DW$248       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2998                      .dwattr $C$DW$248, DW_AT_name("SPIRXBUF")
    2999                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_SPIRXBUF")
    3000                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3001                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3002              
    3003              $C$DW$249       .dwtag  DW_TAG_member
    3004                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    3005                      .dwattr $C$DW$249, DW_AT_name("SPITXBUF")
    3006                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_SPITXBUF")
    3007                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3008                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3009              
    3010              $C$DW$250       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    3012                      .dwattr $C$DW$250, DW_AT_name("SPIDAT")
    3013                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_SPIDAT")
    3014                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3015                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3016              
    3017              $C$DW$251       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    3019                      .dwattr $C$DW$251, DW_AT_name("SPIFFTX")
    3020                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_SPIFFTX")
    3021                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3022                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$252       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    3026                      .dwattr $C$DW$252, DW_AT_name("SPIFFRX")
    3027                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_SPIFFRX")
    3028                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3029                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031              $C$DW$253       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    3033                      .dwattr $C$DW$253, DW_AT_name("SPIFFCT")
    3034                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_SPIFFCT")
    3035                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3036                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3037              
    3038              $C$DW$254       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
    3040                      .dwattr $C$DW$254, DW_AT_name("rsvd_3")
    3041                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_rsvd_3")
    3042                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3043                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE   57

    3044              
    3045              $C$DW$255       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    3047                      .dwattr $C$DW$255, DW_AT_name("SPIPRI")
    3048                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_SPIPRI")
    3049                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3050                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052                      .dwendtag $C$DW$T$22
    3053              
    3054              $C$DW$T$67      .dwtag  DW_TAG_typedef
    3055                      .dwattr $C$DW$T$67, DW_AT_name("SPI_Obj")
    3056                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    3057                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3058              
    3059              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3060                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    3061                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    3062              
    3063              $C$DW$T$26      .dwtag  DW_TAG_typedef
    3064                      .dwattr $C$DW$T$26, DW_AT_name("SPI_Handle")
    3065                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3066                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3067              
    3068              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    3069                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$26)
    3070              
    3071              $C$DW$T$68      .dwtag  DW_TAG_const_type
    3072                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$256)
    3073              
    3074              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3075                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3076              
    3077              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3078                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3079                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3080              
    3081              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3082                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3083                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3084                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3085              
    3086              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3087                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3088                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3089                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3090              
    3091              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3092                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3093                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3094                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3095              
    3096              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3097                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3098                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v15.12.3 Tue Sep 20 20:30:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\MaCHaDo\AppData\Local\Temp\2006010                          PAGE   58

    3099                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3100              
    3101              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3102                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3103                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3104                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3105              
    3106              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3107                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3108                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3109                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3110              
    3111              $C$DW$T$10      .dwtag  DW_TAG_base_type
